#coding:UTF-8

'''
Created on 2016年4月16日

@author: zhouzhichao
'''

cmd = """
万=10000

登记费=80
核档费=80

单价,面积=3*万,80
总价 = 单价*面积

交易费=3*面积
首付 = 80*万
借款本金 = 总价-首付

贷款年限 = 20
利率 = 0.049 #4.75    4.90    2.75    3.25
月利率 = 利率 / 12
还款月数 = 12*贷款年限
还款期数=还款月数 

#等额本息
每期还款额=借款本金*月利率*(1+1.0/((1+月利率)**还款月数-1))
print "benxi: ", 每期还款额
print 每期还款额*还款期数+首付
print

已还本金 = 0
#等额本金

借款本金=float(借款本金)
已还本金,已还金额=0,0
for i in xrange(还款期数):
    已还本金 = i*借款本金/还款期数
    每期还款额=借款本金/还款期数 + 月利率*(借款本金-已还本金)
#     print "%d: "%i, 每期还款额
    已还金额 += 每期还款额
print 已还金额+首付

成交价格=总价
印花税 = 成交价格/2000.0

print 首付+印花税+登记费+核档费+交易费

"""



def trans(txt):
    cmd, i = '', 0
    while i < len(txt):
        if ord(txt[i]) > 127:
            for k in 0,1,2: 
                cmd += "_%02X" % ord(txt[i+k])
            i += 3        
        else:
            cmd += txt[i]
            i += 1
    return cmd



if __name__ == '__main__':
    exec trans(cmd)