#coding:UTF-8

data_BiHua = {
1:"一丨丶丿乀乁乙乚乛亅",
2:"丁丂七丄丅丆丩丷乂乃乄乜九了二亠人亻儿入八冂冖冫几凵刀刁刂力勹匕匚匸十卜卩厂厶" \
  "又巜廴讠阝" ,
3:"万丈三上下丌个丫丬丸久乆乇么义乊乞也习乡亇亍于亏亐亡亼亽亾亿兀兦凡凢凣刃刄劜勺" \
  "卂千卄卪卫叉口囗土士夂夊夕大女子孑孒孓宀寸小尢尣尸屮山巛川工己已巳巾干幺广廾弋" \
  "弓彐彑彡彳忄才氵犭纟艹辶门飞饣马",

4:"不与丏丐丑丒专中丮丯丰丹为之乌乢乣乤乥书予云互亓五井亖亢亣什仁仂仃仄仅仆仇仈仉" \
  "今介仌仍从仏仐仑仒仓允兂元內公六兮兯冃冄内円冇冈冗冘凤凶刅分切刈劝办勻勼勽勾勿" \
  "匀匁匂化匹区卅卆升午卍卐卝卞卬厃厄厅历厷厸厹及友双反収圠圡壬夨天太夫夬夭孔尐少" \
  "尤尹尺屯屲巴巿帀币幻廿开弌弔引弖心忆戈戶户戸手扌扎支攴攵文斗斤方无旡日曰月木朩" \
  "欠止歹歺殳毋毌比毛氏气水火灬爪爫父爻爿片牙牛牜犬王瓦礻禸罓耂肀艺见计订讣认讥贝" \
  "车辷邒邓长闩阞队韦风",

5:"且丕世丗丘丙业丛东丝丱主丼乍乎乏乐乧乬亗仔仕他仗付仙仚仛仜仝仞仟仠仡仢代令以仦" \
  "仧仨仩仪仫们仭仮仺兄兰冉冊冋册冎写冚冬冭冮冯凥処凧凷凸凹出击刉刊刋刌刍功加务劢" \
  "匃匄包匆匇北匛匜匝匞卉半卌卟占卡卢卭卮卯厇厈厉厺去厼叏叐发古句另叧叨叩只叫召叭" \
  "叮可台叱史右叴叵叶号司叹叺叻叼叽叾囙囚四囜圢圣圤圥圦圧壭夃处外夘央夯夰失夲夳头" \
  "奴奵奶孕宁宂它宄对尒尓尔尕尻尼屳屴屵屶屷左巧巨巪市布帄帅平幼庀庁庂広廵弁弍弗弘" \
  "归必忇忉忊戉戊戋戹扏扐扑扒打扔払扖斥旦旧曱未末本札朮术朰正母氐民氕氶氷永氹氺氻" \
  "氾氿汀汁汃汄汅汇汈汉灭犮犯犰玄玉玊玌玍瓜甘生用甩田由甲申甴电疋疒癶白皮皿目矛矢" \
  "石示礼禾穴立纠罒肊艻艼艽艾艿芀芁节衤讦讧讨让讪讫讬训议讯记讱轧辸边辺辻込辽邔邖" \
  "邗邘邙邚邛邜邝钅闪阠阡阢阣阤饤饥驭鸟龙",

6:"丞丟丠両丢乑乒乓乔乨乩乪乫乭乮乯买争亘亙亚交亥亦产仯仰仱仲仳仴仵件价仸仹任仼份" \
  "仾仿伀企伂伃伄伅伆伇伈伉伊伋伌伍伎伏伐休伒伓伔伕伖众优伙会伛伜伝伞伟传伡伢伣伤" \
  "伥伦伧伨伩伪伫伬佢佤充兆兇先光兊全共兲关兴再军农冰冱冲决冴凨凩凪凫凼刎刏刐刑划" \
  "刓刔刕刖列刘则刚创劣劤劥劦劧动匈匟匠匡匢卋华协印危厊压厌厍厽厾叒叿吀吁吂吃各吅" \
  "吆吇合吉吊吋同名后吏吐向吒吓吔吕吖吗囘囝回囟因囡团団在圩圪圫圬圭圮圯地圱圲圳圴" \
  "圵圶圷圸圹场圾壮夅夗夙多夛夵夶夷夸夹夺夻夼奷奸她奺奻奼好奾奿妀妁如妃妄妅妆妇妈" \
  "孖字存孙宅宆宇守安寺寻导尖尗尘尥尦尧尽屰屸屹屺屻屼屽屾屿岀岁岂岃岋岌州巟巡巩帆" \
  "帇师年幵并庄庅庆延廷异弎式弐弙弚弛弜当彴彵彶忈忋忏忓忔忕忖忙忚忛忣戌戍戎戏成扗" \
  "托扙扚扛扜扝扞扟扠扡扢扣扤扥扦执扨扩扪扫扬扱收攷旨早旪旫旬旭旮旯曲曳有朱朲朳朴" \
  "朵朶朷朸朹机朻朼朽朾朿杀杁杂权次欢此死毎毕氒氖気氘氼氽汆汊汋汌汍汎汏汐汑汒汓汔" \
  "汕汗汘汙汚汛汜汝江池污汢汣汤汲汷灮灯灰灱灲灳爷牝牞牟犱犲犳犴犵犷犸玎玏玐玑瓧甪" \
  "甶百癿礽祁穵竹米糸糹纡红纣纤纥约级纨纩纪纫缶网羊羽老考而耒耳聿肉肋肌肍肎臣自至" \
  "臼舌舛舟艮色艸芃芄芅芆芇芉芊芋芌芍芎芏芐芑芒芓芕芖芗芝芨虍虫血行衣襾西覀观讲讳" \
  "讴讵讶讷许讹论讻讼讽设访诀贞负贠赱轨达辿迀迁迂迃迄迅迆过迈迉邞邟邠邡邢那邤邥邦" \
  "邧邨邩邪邬邷钆钇闫闬闭问闯阥阦阧阨阩阪阫阬阭阮阯阰阱防阳阴阵阶页饦饧驮驯驰齐",

7: "丣两严串丽乕乱乲乸亊亜亨亩亪伭伮伯估伱伲伳伴伵伶伷伸伹伺伻似伽伾伿佀佁佂佃佄佅" \
   "但佇佈佉佊佋位低住佐佑佒体佔何佖佗佘余佚佛作佝佞佟你佡佣佥佦佧佨克兌免兎兏児兑" \
   "兕兵冏冝况冶冷冸冹冺冻凬刜初刞刟删刡刢刣判別刦刧刨利刪别刬刭助努劫劬劭劮劯劰励" \
   "劲劳労匉匣匤匥医卣卤卲即却卵厎厏厐厑县叓吘吙吚君吜吝吞吟吠吡吢吣吤吥否吧吨吩吪" \
   "含听吭吮启吰吱吲吳吴吵吶吷吸吹吺吻吼吽吾吿呀呁呂呃呄呅呆呇呈呉告呋呌呍呎呏呐呑" \
   "呒呓呔呕呖呗员呙呚呛呜咓咞囤囥囦囧囨囩囪囫囬园囮囯困囱囲図围囵圻圼圽圿址坁坂坃" \
   "坄坅坆均坈坉坊坋坌坍坎坏坐坑坒坓坔坕坖块坘坙坚坛坜坝坞坟坠壯声壱売壳夆夋夽夾夿" \
   "奀奁奂奆妉妊妋妌妍妎妏妐妑妒妓妔妕妖妗妘妙妚妛妜妝妞妟妠妡妢妣妤妥妦妧妨妩妪妫" \
   "姂姉姊姒姖孚孛孜孝孞宊宋完宍宎宏宐宑宒寽対寿尨尩尪尫尬尾尿局屁层屃岄岅岆岇岈岉" \
   "岊岍岎岏岐岑岒岓岔岕岖岗岘岙岚岛岜岠巠巵帉帊帋希帍帎帏帐庇庈庉床庋庌庍庎序庐庑" \
   "庒库应廸廹弃弄弅弝弞弟张弡形彣彤彷彸役彺彻忌忍忎忐忑忒志忘応忟忡忤忦忧忨忪快忬" \
   "忭忮忯忰忱忲忳忴忶忷忸忹忺忻忼忾怀怃怄怅怆怇我戒戓戺戻戼扭扮扯扰扲扳扴扵扶扷扸" \
   "批扺扻扼扽找技抁抂抃抄抅抆抇抈抉把抋抌抍抎抏抐抑抒抓抔投抖抗折抙抚抛抜抝択抟抠" \
   "抡抢抣护报抸拋拒拟攸改攺攻攼斈斘旰旱旲旳旴旵时旷旸昅更曵杄杅杆杇杈杉杊杋杌杍李" \
   "杏材村杒杓杔杕杖杗杘杙杚杛杜杝杞束杠条杢杣杤来杦杧杨杩极欤步歼每毐毜毝氙氚求汖" \
   "汞汥汦汧汨汩汪汫汭汮汯汰汱汳汴汵汶汸汹決汻汼汽汾汿沁沂沃沄沅沆沇沈沉沋沌沍沎沏" \
   "沐沑沒沔沕沖沘沙沚沛沜沞沟沠没沢沣沤沥沦沧沨沩沪泐泛泤泲洰灴灵灶灷灸灹灺灻灼災" \
   "灾灿炀牠牡牢牣牤状犹犺犻犼犽犾犿狁狂狃狄狅狆狇狈玒玓玔玕玖玗玘玙玚玛瓨瓩甫甬男" \
   "甸甹町甼疓疔疕疖疗皀皁皂皃盀盁盯矣矴矵矶社礿祀祂祃禿秀私秂秃究穷竌竍糺系纬纭纮" \
   "纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾罕羋羌耴肐肑肒肓肔肕肖肗肘肙肚肛肜肝肞肟肠臫良" \
   "芈芘芙芚芛芜芞芟芠芡芢芣芤芥芦芧芩芪芫芬芭芮芯芰花芲芳芴芵芶芷芸芹芺芼芽芾芿苀" \
   "苁苂苃苄苅苆苇苈苉苊苋苌苍苎苏苡苣茾虬补見觃角言訁证诂诃评诅识诇诈诉诊诋诌词诎" \
   "诏诐译诒谷豆豕豸貝贡财赤走足身車轩轪轫辛辰辵迊迋迌迍迎迏运近迒迓返迕迖迗还这迚" \
   "进远违连迟邑邭邮邯邰邱邲邳邴邵邶邸邹邺邻酉釆里针钉钊钋钌闰闱闲闳间闵闶闷阷阸阹" \
   "阺阻阼阽阾阿陀陁陂陃附际陆陇陈陉韧饨饩饪饫饬饭饮驱驲驳驴鸠鸡麦龟",

8: "宙定宛宜宝实実宠审尀尙尚尭屄居屆屇屈屉届岝岞岟岡岢岣岤岥岦岧岨岩岪岫岬岭岮岯岰" \
   "竏竺竻籴籵籶糼糽糾糿线绀绁绂练组绅细织终绉绊绋绌绍绎经绐缷罔罖罗罙者耓耵耶肃肏" \
   "並丧丳乖乳乴乵乶乷事些亝亞亟享京佌佩佪佫佬佭佮佯佰佱佲佳佴併佶佷佸佹佺佻佼佽佾" \
   "使侀侁侂侃侄侅來侇侈侉侊例侌侍侎侏侐侑侒侓侔侕侖侗侘侙侚供侜依侞侟侠価侢侣侤侥" \
   "侦侧侨侩侪侫侬侭侹俢兒兓兔兖兩其具典冐冞冼冽冾冿净凭凮凯函刮刯到刱刲刳刴刵制刷" \
   "券刹刺刻刼刽刾刿剀剁剂剆劵劶劷劸効劺劻劼劽劾势勆匊匋匌匦匼卑卒卓協单卖卥卦卧卶" \
   "卷卹卺厒厓厔厕叀叁参叔叕取呝呞呟呠呡呢呣呤呥呦呧周呩呪呫呬呭呮呯呱味呴呵呶呷呸" \
   "呹呺呻呼命呾呿咀咁咂咃咄咅咆咇咈咉咊咋和咍咎咏咐咑咒咔咕咖咗咘咙咚咛咜咝咼哎囶" \
   "囷囸囹固囻囼国图坡坢坣坤坥坦坧坨坩坪坫坬坭坮坯坰坱坲坳坴坵坶坷坸坹坺坻坼坽坾坿" \
   "垀垁垂垃垄垅垆垇垈垉垊备夌夜夝奃奄奅奇奈奉奋奌奍奔妬妭妮妯妰妱妲妳妴妵妶妷妸妹" \
   "妺妻妼妽妾妿姀姁姃姄姅姆姇姈始姌姍姎姏姐姑姓委姗孟孠孡孢季孤孥学孧宓宔宕宖宗官" \
   "岱岲岳岴岵岶岷岸岹岺岻岼岽岾岿峀峁峂峃峄峅巫巶巻帑帒帓帔帕帖帗帘帙帚帛帜幷幸底" \
   "庖店庘庙庚府庝庞废建廻廼弆弢弣弤弥弦弧弨弩弪彔录彼彽彾彿往征徂徃径忝忞忠忢忥忩" \
   "念忽忿态怂怈怉怊怋怌怍怏怐怑怓怔怕怖怗怙怚怛怜怞怟怡怢怦性怩怪怫怬怭怮怯怰怲怳" \
   "怴怵怶怺怽怾怿戔戕或戗戽戾房所承抦抧抨抩抪披抬抭抮抯抰抱抲抳抴抵抶抷抹抺抻押抽" \
   "抾抿拀拁拂拃拄担拆拇拈拉拊拌拍拎拏拐拑拓拔拕拖拗拘拙拚招拝拞拠拡拢拣拤拥拦拧拨" \
   "择攰攽放斉斦斧斨斩斺斻於旹旺旻旼旽旾旿昀昁昂昃昄昆昇昈昉昊昋昌昍明昏昐昑昒易昔" \
   "昕昖昗昘昙昛曶朊朋朌服杪杫杬杭杮杯杰東杲杳杴杵杶杷杸杹杺杻杼杽松板枀枂枃构枅枆" \
   "枇枈枉枊枋枌枍枎枏析枑枒枓枔枕枖林枘枙枚枛果枝枞枟枠枡枢枣枤枥枦枧枨枩枪枫枬枭" \
   "柉柜柹欣欥欦欧武歧歨歩歫歽歾歿殀殁殴毑毞毟氓氛氜氝汬沀沊沓沗沝沫沬沭沮沰沱沲河" \
   "沴沵沶沷沸油沺治沼沽沾沿泀況泂泃泄泅泆泇泈泊泋泌泍泎泏泑泒泓泔法泖泗泘泙泜泝泞" \
   "泟泠泡波泣泥泦泧注泩泪泫泬泭泮泯泱泳泷泸泹泺泻泼泽泾浅炁炂炃炄炅炆炇炈炉炊炋炌" \
   "炍炎炏炐炑炒炓炔炕炖炗炘炙炚炛炜炝炞炬爬爭爸牀版牥牦牧牨物牪牫牬狀狉狋狌狍狎狏" \
   "狐狑狒狓狔狕狖狗狘狙狚狛狜狝狞玜玝玞玟玠玡玢玣玤玥玦玧玨玩玪玫玬玭玮环现玱珁瓝" \
   "瓪瓫瓬瓭瓮瓯瓰瓱瓲甙画甽甾甿畀畁畂畃畄畅疌疘疙疚疛疜疝疞疟疠疡癷的皯盂盰盱盲盳" \
   "直盵矤知矷矸矹矺矻矼矽矾矿砀码砐祄祅祆祇祈祉祊祋祌祍祎秄秅秆秇秈秉秊穸穹空穻竎" \
   "股肢肣肤肥肦肧肨肩肪肫肬肭肮肯肰肱育肳肴肵肶肷肸肹肺肻肼肽肾肿胀胁胏臤臥臽臾舍" \
   "舎舏舠艰苐苑苒苓苔苕苖苗苘苙苚苛苜苝苞苟苠苢苤若苦苧苨苩苪苫苬苭苮苯苰英苲苳苴" \
   "苵苶苷苸苹苺苻苼苽苾苿茀茁茂范茄茅茆茇茉茊茋茌茎茏茐茑茒茓茔茕茚虎虏虭虮虯虰虱" \
   "虲衦衧表衩衪衫衬衱规觅视诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩豖责贤败" \
   "账货质贩贪贫贬购贮贯軋转轭轮软轰迠迡迢迣迤迥迦迧迨迩迪迫迬迭迮迯述迱迲迳邼邽邾" \
   "邿郀郁郂郃郄郅郆郇郈郉郊郋郍郎郏郐郑郓郔郕郘郱采金釒钍钎钏钐钑钒钓钔钕钖钗長镸" \
   "門闸闹阜陊陋陌降陎陏限陑陒陓陔陕隶隹雨靑青非靣顶顷飏飠饯饰饱饲饳饴驵驶驷驸驹驺" \
   "驻驼驽驾驿骀鱼鸢鸣鸤黾齿",

9: "临举乗乹乺乻乼乽亭亮亯亰亱亲侮侯侰侱侲侳侴侵侶侷侸侺侻侼侽侾便俀俁係促俄俅俆俇" \
   "俈俉俊俋俌俍俎俏俐俑俒俓俔俕俖俗俘俙俚俛俜保俞俟俠信俣俤俥俦俧俨俩俪俫俬俭修兗" \
   "兘兙兪兹兺养冑冒冟冠凁凂凃凾剃剄剅則剈剉削剋剌前剎剏剐剑勀勁勂勃勄勅勇勈勉勊勋" \
   "匍匧匨匩匽南単卸卻卼卽厖厗厘厙厚厛受变叙叚叛叜叝呰呲咟咠咡咢咣咤咥咦咧咨咩咪咫" \
   "咬咭咮咯咰咱咲咳咴咵咶咷咸咹咺咻咽咾咿哀品哂哃哄哅哆哇哈哉哊哋哌响哏哐哑哒哓哔" \
   "哕哖哗哘哙哚哛哜哝哞哟哪唌囿圀型垌垍垎垏垐垑垒垓垔垕垖垗垘垙垚垛垜垝垞垟垠垡垢" \
   "垣垤垥垦垧垨垩垪垫垬垭垮垯垰垱垲垳垴垵垹埅城埏壴壵夈変复奊奎奏奐契奒奓奕奖姕姘" \
   "姙姚姛姜姝姞姟姠姡姢姣姤姥姦姧姨姩姪姫姭姮姯姰姱姲姳姴姵姶姷姸姹姺姻姼姽姾姿娀" \
   "威娂娃娄娅娆娇娈娍娗娜娫娰孨孩孪客宣室宥宦宨宩宪宫宬封専将尛尜尝尮尯屋屌屍屎屏" \
   "峆峇峈峉峊峋峌峍峎峏峐峑峒峓峔峕峖峗峘峙峚峛峜峝峞峟峠峡峢峣峤峥峦峧峫峸巬巭差" \
   "巷巹巺巼帝帞帟帠帡帢帣帤帥带帧帮幽庛庠庡庢庣庤庥度庭庰廽弇弈弫弬弭弮弯彖彥彦" \
   "彪待徆徇很徉徊律後徍徔怎怒怘思怠怣怤急怨怱怷怸怹总怼恀恂恃恄恅恆恇恈恉恊恌恍恎" \
   "恑恒恓恔恗恘恛恜恞恟恠恡恢恤恦恨恪恫恬恮恰恱恲恸恹恺恻恼恽恾战扁扂扃拜拪拫括拭" \
   "拮拯拰拱拴拵拶拷拸拹拺拻拼拽拾挀持挂挃挄挅挆指按挊挋挌挍挎挏挑挒挓挔挕挖挗挘挜" \
   "挝挞挟挠挡挢挣挤挥挦挧挪挷挺挻捓捛攱政敀敁敂敃敄故斪斫施斾斿旀既昚昜昝昞星映昡" \
   "昢昣昤春昦昧昨昩昪昫昬昭昮是昰昱昲昳昴昵昶昷昸昹昺昻昼昽显昿曷朎朏朐朑枮枯枰枱" \
   "枲枳枴枵架枷枸枹枺枻枼枾枿柀柁柂柃柄柅柆柇柈柊柋柌柍柎柏某柑柒染柔柕柖柗柘柙柚" \
   "柛柝柞柟柠柢柣柤查柦柧柨柩柪柫柬柭柮柯柰柱柲柳柵柶柷柸柺査柼柽柾柿栀栁栂栃栄栅" \
   "栆标栈栉栊栋栌栍栎栏栐树桏桒桞欨欩欪歪殂殃殄殅殆殇残段殶毒毖毗毘毠毡氞氟氠氡氢" \
   "沯泉泚泴泵泶泿洀洁洂洃洄洅洆洇洈洉洊洋洌洎洏洐洑洒洓洔洕洗洘洙洚洛洝洞洟洠洡洢" \
   "洣洤津洦洧洨洩洪洫洬洭洮洱洲洳洴洵洶洷洸洹洺活洼洽派洿浀浂浃浄浇浈浉浊测浌浍济" \
   "浏浐浑浒浓浔浕涎涏炟炠炡炢炣炤炥炦炧炨炩炪炫炭炮炯炰炱炲炳炴炵炶炷炸点為炻炼炽" \
   "炾炿烀烁烂烃爮爯爰爼牁牉牊牭牮牯牰牱牲牳牴牵狊狟狠狡狢狣狤狥狦狧狨狩狪狫独狭狮" \
   "狯狰狱狲狿玅玲玳玴玵玶玷玸玹玻玽玾玿珀珂珃珄珅珆珇珈珉珊珋珌珍珎珏珐珑瓳瓴瓵甚" \
   "甠甭甮畆畇畈畉畊畋界畍畎畏畐畑畒畓疢疣疤疥疦疧疨疩疪疫疬疭疮疯疺癸癹発皅皆皇皈" \
   "皍盃盄盅盆盇盈盶盷相盹盺盻盼盽盾盿眀省眂眃眄眅眆眇眈眉眊看県眍眨矜矦矧矨矩砂砃" \
   "砄砅砆砇砈砉砊砋砌砍砎砏砑砒砓研砕砖砗砘砙砚砛砜砭祏祐祑祒祓祔祕祖祗祙祚祛祜祝" \
   "神祠祢禹禺秋秌种秎秏秐科秒秓秔秕秖秗秬秭穼穽穾穿窀突窂窃窆竐竑竒竓竔竕竖竗竼竽" \
   "竾竿笀笁笂笃笈籷籸籹籺类籼籽籾籿粀粁粂紀紁紂紃約紅紆紇紈紉級绑绒结绔绕绖绗绘给" \
   "绚绛络绝绞统缸罘罚羍美羏羑羗羾羿耇耉耍耎耏耐耑耔耷胂胃胄胅胆胇胈胉胊胋背胍胎胐" \
   "胑胒胓胕胖胗胘胙胚胛胜胝胞胟胠胡胢胣胤胥胦胧胨胩胪胫脉臿舁舡舢舣舤芔茈茍茖茗茘" \
   "茙茛茜茞茟茠茡茢茤茥茦茧茨茩茪茫茬茭茮茯茰茱茲茳茴茵茶茷茸茹茺茼茽茿荀荁荂荃荄" \
   "荅荆荇荈草荊荋荌荍荎荏荐荑荒荓荔荕荖荗荘荙荚荛荜荝荞荟荠荡荢荣荤荥荦荧荨荩荪荫" \
   "荬荭荮药荿莒莚莛虐虳虴虵虶虷虸虹虺虻虼虽虾虿蚀蚁蚂蚃蚤衁衂衍衎衭衯衲衳衴衵衶衸" \
   "衹衻衼衽衿袀袂袄袅袆袇要覌觇览觉觓觔訂訃訄訅訆訇計诪诫诬语诮误诰诱诲诳说诵诶貞" \
   "貟負贰贱贲贳贴贵贶贷贸费贺贻赲赳赴赵趴軌軍轱轲轳轴轵轶轷轸轹轺轻迴迵迶迷迸迹迺" \
   "迻迼追迾迿退送适逃逄逅逆逇逈选逊郖郗郙郚郛郜郝郞郟郠郡郢郣郤郥郦郧酊酋重釓釔钘" \
   "钙钚钛钜钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯閁閂闺闻闼闽闾闿阀阁阂陖陗陘陙陛" \
   "陜陝陞陟陠陡院陣除陥陦陧陨险面革韋韨韭音頁顸项顺须風飐飑飒飛食饵饶饷饸饹饺饻饼" \
   "首香骁骂骃骄骅骆骇骈骉骨鬼鳬鸥鸦鸧鸨鸩",

10:"丵乘亳俯俰俱俲俳俴俵俶俷俸俹俺俻俼俽俾俿倀倁倂倃倄倅倆倇倈倉倊個倌倍倎倏倐們倒" \
   "倓倔倕倖倗倘候倚倛倜倝倞借倠倡倢倣値倥倦倧倨倩倪倫倬倭倮倯倰倱倲倳倴倵倶倷倸倹" \
   "债倻值倽倾倿偀偌偖健党兛兞兼冓冔冡冢冣冤冥冦冧凄凅准凇凈凉凊凋凌凍凎剒剓剔剕剖" \
   "剗剘剙剚剛剜剝剞剟剠剡剢剣剤剥剦剧剮勌勍勎勏勐勑務匎匪匫匿卨卿厜厝厞原叞叟哠員" \
   "哢哣哤哥哦哧哨哩哫哬哭哮哯哰哱哲哳哴哵哶哷哸哹哺哻哼哽哾哿唀唁唂唃唄唅唆唇唈唉" \
   "唊唋唍唎唏唐唑唒唓唔唕唖唗唘唙唚唛唜唝唞唟唠唡唢唣唤唥唦唧唨唴啊圁圂圃圄圅圆垶" \
   "垷垸垺垻垼垽垾垿埀埁埂埃埄埆埇埈埉埊埋埌埍埐埑埒埓埔埕埖埗埘埙埚埛堲壶夎夏夞套" \
   "奘奙奚姬娉娊娋娌娎娏娐娑娒娓娔娕娖娘娙娚娛娝娞娟娠娡娢娣娤娥娦娧娨娩娪娭娮娯娱" \
   "娲娳娴娿婀婲孫孬孭宧宭宮宯宰宱宲害宴宵家宷宸容宺宻宼宽宾尃射尅將屐屑屒屓屔展屖" \
   "屗屘屙峨峩峪峬峭峮峯峰峱峲峳峴峵島峷峹峺峻峼峽峾峿崀崁崂崃崄崅崋巸帨帩帪師帬席" \
   "帯帰帱座庨庩庪庫庬庮庯弉弰弱弲弳彨徎徏徐徑徒従徕恁恋恏恐恕恖恙恚恝恣恥恧恩恭息" \
   "恳恴恵恶恷悀悁悂悃悄悅悇悈悋悌悍悎悏悑悒悓悔悕悖悗悙悚悛悜悝悞悟悢悦悧悩悭悮悯" \
   "戙扄扅扆扇拲拳拿挈挐挙挚挛挨挩挫挬挭挮振挰挱挳挴挵挶挸挹挼挽挾挿捀捁捂捃捄捅捆" \
   "捇捈捉捊捋捌捍捎捏捐捑捒捔捕捖捗捘捙捚捜捝捞损捠捡换捣捤揤敆敇效敉敊敋敌敖斊斋" \
   "料斚旁旂旃旄旅旆旊晀晁時晃晄晅晆晇晈晉晊晋晌晍晎晏晐晑晒晓晔晕晖晘晙晚晛晜晝晞" \
   "晟晠書曺曻朒朓朔朕朗枽柡柴栒栓栔栕栖栗栘栙栚栛栜栝栞栟栠校栢栣栤栥栦栧栨栩株栫" \
   "栬栭栮栯栰栱栲栳栴栵栶样核根栺栻格栽栾栿桀桁桂桃桄桅框桇案桉桊桋桌桍桎桐桑桓桔" \
   "桕桖桗桘桙桚桛桜桝桟桠桡桢档桤桥桦桧桨桩桪梃梆梛條梠梡梢梣梤梥梧梨梩梴棦欬欭欮" \
   "欯欰欱欴歬歭殈殉殊殷殺毙毢毣毤毥毦毧毨毩毪氣氤氥氦氧氨氩泰洍洖洜洯流浆浖浗浘浙" \
   "浚浛浜浝浞浟浠浡浢浣浤浥浦浧浨浩浪浫浬浭浮浯浰浱浲浳浴浵浶海浸浹浺浻浼浽浾浿涀" \
   "涁涂涃涄涅涆涇消涉涊涋涌涍涐涑涒涓涔涕涖涗涘涙涚涛涜涝涞涟涠涡涢涣涤涥润涧涨涩" \
   "淓淽烄烅烆烇烈烉烊烋烌烍烎烏烐烑烒烓烔烕烖烗烘烙烚烛烜烝烞烟烠烡烢烣烤烥烦烧烨" \
   "烩烪烫烬热烮烵烶烻焒爱爹牂牶牷牸特牺狳狴狵狶狷狸狹狺狻狼狽狾猀猁猂猃猐玆玺玼珒" \
   "珓珔珕珖珗珘珙珚珛珜珝珞珟珠珡珢珣珤珥珦珧珨珩珪珫珬班珮珯珰珱珲珹珽琊瓞瓟瓶瓷" \
   "瓸甡畔畕畖畗畘留畚畛畜畝畞畟畠畢疍疰疱疲疳疴疶疷疸疹疻疼疽疾疿痀痁痂痃痄病痆症" \
   "痈痉皊皋皌皰皱盉益盋盌盍盎盏盐监眎眏眐眑眒眓眔眕眖眗眘眙眚眛眜眝眞真眠眡眢眣眤" \
   "眧眩眪眫眬眿矝砝砞砟砠砡砢砣砤砥砧砨砩砪砫砬砮砯砰砱砲砳破砵砶砷砸砹砺砻砼砽砾" \
   "砿础硁祘祟祡祣祤祥祧祩祪祫祬祮祯离秘秙秚秛秜秝秞租秠秡秢秣秤秥秦秧秨秩秪秫秮积" \
   "称窄窅窇窈窉窊窋窌窍窎竘站竚竛竜竝竞笄笅笆笇笉笊笋笌笍笎笏笐笑笒笓笔笕笖笫粃粄" \
   "粅粆粇粈粉粊粋粌粍粎粏粐粑粔紊紋紌納紎紏紐紑紒紓純紕紖紗紘紙紛紜紝紞紟素紡索紣" \
   "紤紥紦紧绠绡绢绣绤绥绦继绨缹缺缻缼罛罜罝罞罟罠罡罢羐羒羓羔羖羘羙羞翀翁翂翃翄翅" \
   "翆耄耆耊耕耖耗耘耙耟耸耹耺耻耼耽耾耿聀聁聂肁肂胭胮胯胰胱胲胳胴胵胶胷胸胹胺胻胼" \
   "能胿脀脁脂脃脄脅脆脇脈脊脋脌脍脎脏脐脑脒脓脠脡脩臬臭致舀舐舥舦舧舨舩航舫般舭舮" \
   "舯舰舱艳芻茝茣荰荱荲荳荴荵荶荷荸荹荺荻荼荽荾莀莁莂莃莄莅莆莇莈莉莊莋莌莍莎莏莐" \
   "莑莓莔莕莖莗莘莙莜莝莞莟莠莡莢莣莤莥莦莧莨莩莪莫莬莭莮莯莰莱莲莳莴莵莶获莸莹莺" \
   "莻莼莽菃菦華虑虒虓虔蚄蚅蚆蚇蚈蚉蚊蚋蚌蚍蚎蚏蚐蚑蚒蚓蚔蚕蚖蚗蚘蚙蚚蚛蚜蚝蚞蚟蚠" \
   "蚡蚢蚣蚥蚦蚧蚨蚩蚪蚬蚷衃衄衏衐衮衰衷衺衾袁袃袉袊袍袎袏袐袑袒袓袔袕袖袗袘袙袚袛" \
   "袜袝袟袡袢袣袥袦袧袨袩袪被袮袯覂覍覎觊觙訉訊訋訌訍討訏訐訑訒訓訔訕訖託記訙訯请" \
   "诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谉谊谸豇豈豗豹豺豻財貢貣貤贼贽贾贿赀赁赂赃资" \
   "赅赆赶起赸趵趶趷趸趿躬軎軏軐軑軒軓軔軕轼载轾轿辀辁辂较辱逋逌逍逎透逐逑递逓途逕" \
   "逖逗逘這通逛逜逝逞速造逡逢連逤逥逦逧邕部郩郪郫郬郭郮郯郰郲郳郴郵郷郸都鄀酌配酎" \
   "酏酐酑酒釕釖釗釘釙釚釛釜針釞釟釠釡釢钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄" \
   "铅铆铇铈铉铊铋铌铍铎閃閄閅阃阄阅阆陚陪陫陬陭陮陯陰陱陲陳陴陵陶陷陸陹険陼隺隻隼" \
   "隽难顼顽顾顿颀颁颂颃预飢飣飤饽饾饿馀馁馂馬骊骋验骍骎骏高髟鬥鬯鬲鱽鸪鸫鸬鸭鸮鸯" \
   "鸰鸱鸲鸳鸴鸵鸶龀彧",

11:"乾乿亀偁偂偃偄偅偆假偈偉偊偋偍偎偏偐偑偒偓偔偕偗偘偙做偛停偝偞偟偠偡偢偣偤偦偧" \
   "偩偪偫偬偭偮偯偰偱偲偳側偵偶偷偸偹偺偻偼偽偾偿傀傁傇傞傦兜兝兽冕冨减凐凑凰剨剪" \
   "剫剬剭副剰剱剳剶勒勓勔動勖勗勘勚匏匐匒匘匙匬匭匮匾區卙卾厠厡厢厣厩參叄唩唪唫唬" \
   "唭售唯唰唱唲唳唵唶唷唸唹唺唻唼唽唾唿啀啁啂啃啄啅商啇啈啉啋啌啍啎問啐啑啒啓啔啕" \
   "啖啗啘啚啛啜啝啞啟啠啡啢啤啥啦啧啨啩啪啫啬啭啮啯啰啱啲啳啴啵啶啷啸啹喎喏喐喯喵" \
   "圇圈圉圊國埜埝埞域埠埡埢埣埤埥埦埧埨埩埪埫埬埭埮埯埰埱埲埳埴埵埶執埸培基埻埼埽" \
   "埾埿堀堁堂堃堄堅堆堇堈堉堊堋堌堍堎堏堐堑堒堓堔堕堝堵壷壸够夠奛奜奝奞奟奢娬娵娶" \
   "娷娸娹娺娻娼娽娾婁婂婃婄婅婆婇婈婉婊婋婌婍婎婏婐婑婒婓婔婕婖婗婘婙婚婛婜婝婞婟" \
   "婠婡婢婤婥婦婧婨婩婪婫婬婭婮婯婰婱婳婴婵婶婼媌媎媖媧嫏孮孯孰孲宿寀寁寂寃寄寅密" \
   "寇寈寉專尉屚屛屜屝屠崆崇崈崉崊崌崍崎崏崐崑崒崓崔崕崖崗崘崙崚崛崜崝崞崟崠崡崢崣" \
   "崤崥崦崧崨崩崪崫崬崭崮崯崰巢巣帲帳帴帵帶帷常帹帺帻帼帾庱庲庳庴庵庶康庸庹庺庻庼" \
   "庾庿廊弴張弶強弸弹彗彩彫彬徖得徘徙徛徜徝從徟徠徢徣徤恿悆悉悊悐悘悠悡患悤悥您悪" \
   "悫悬悰悱悴悵悷悸悺悻悼悽悾悿惀惂惃情惆惇惈惊惋惍惏惐惓惔惕惗惘惙惚惛惜惝惞惟惤" \
   "惦惧惨惬惭惮惯愥戚戛戜戝扈挲捥捦捧捨捩捪捫捬捭据捯捰捱捲捳捴捵捶捷捸捹捺捻捼捽" \
   "捾捿掀掁掂掃掄掅掆掇授掉掊掋掍掎掏掐掑排掓掕掖掗掘掙掚掛掜掝掞掟掠採探掤接掦控" \
   "推掩措掫掬掭掮掯掲掳掴掵掶掷掸掹掺掻掼掿揵揶敍敎敏敐救敒敓敔敕敗敘教敚敛敝敢斍" \
   "斎斏斛斜斬断旇旈旉旋旌旍旎族旣晗晡晢晣晤晥晦晧晨晩曹曼曽朖朘朙朚望桫桬桭桮桯桰" \
   "桱桲桳桴桵桶桷桸桹桺桻桼桽桾桿梀梁梂梄梅梇梈梉梊梋梌梍梎梏梐梑梒梓梔梕梖梗梘梙" \
   "梚梜梞梟梦梪梫梬梭梮梯械梱梲梳梵梶梷梸梹梺梻梼梽梾梿检棁棂棻椘椛楖欫欲欳欵欶欷" \
   "欸殌殍殎殏殐殑殒殓殸殹殻毫毬毭氪氫涪涫涬涭涮涯涰涱液涳涴涵涶涷涸涹涺涻涼涽涾涿" \
   "淀淁淂淃淄淅淆淇淈淉淊淋淌淍淎淏淐淑淒淔淕淖淗淘淙淚淛淜淝淞淟淠淡淢淣淤淥淦淧" \
   "淨淩淪淫淬淭淮淯淰深淲淳淴淶混淸淹淺添淿渀渁渂渃渄清渆渇済渉渊渋渌渍渎渏渐渑渒" \
   "渓渔渕渖渗渚渠渦渮渵渶湕湴烯烰烱烲烳烴烷烸烹烺烼烽烾烿焀焁焂焃焄焅焆焇焈焉焊焋" \
   "焌焍焎焏焐焑焓焔焕焖焗焘焫爽牻牼牽牾牿犁猄猅猇猈猉猊猍猎猏猑猓猔猕猖猗猘猙猚猛" \
   "猜猝猞猟猠猡猧猪猫率玈珳珴珵珶珸珺珻珼現珿琀琁琂球琄琅理琇琈琉琋琌琍琎琏琐琑琒" \
   "琓琷瓠瓹瓺瓻瓼甛甜產産畡畣畤略畦畧畨畩異疵痊痋痌痍痎痏痐痑痒痓痔痕痖皉皎皏皐皑" \
   "皲盒盓盔盕盖盗盘盛眥眦眭眮眯眰眱眲眳眴眵眶眷眸眹眺眻眼眽眾着睁矪矫砦硂硃硄硅硆" \
   "硇硈硉硊硋硌硍硎硏硐硑硒硓硔硕硖硗硘硙硚硛硟硭祦票祭祰祱祲祳祴祵祶祷祸禼秱秲秳" \
   "秴秵秶秷秸秹秺移秼秽秾稆窏窐窑窒窓窔窕窚竟章竡竫笗笘笙笚笛笜笝笞笟笠笡笢笣笤笥" \
   "符笧笨笩笪第笭笮笯笰笱笲笳笴笵笶笷笸笹笺笻笼笽笾筇粒粓粕粖粗粘粙粚粛粜粝粣紨紩" \
   "紬紭紮累細紱紲紳紴紵紶紷紸紹紺紻紼紽紾紿絀絁終絃組絅絆絇絈絉絊絋経绩绪绫绬续绮" \
   "绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缍缽罣羕羚羛羜羝羟翇翈翉翊翋翌翍翎翏翐翑" \
   "習耈耚耛耜耝耞聃聄聅聆聇聈聉聊聋职聍胬脕脖脗脘脙脚脛脜脝脞脟脢脣脤脥脦脧脨脪脫" \
   "脬脭脮脯脰脱脲脳脴脵脶脷脸舂舑舲舳舴舵舶舷舸船舺舻艴莾莿菀菁菂菄菅菆菇菈菉菊菋" \
   "菌菍菎菏菑菒菓菔菕菖菗菘菙菚菛菜菝菞菟菠菡菢菣菤菥菧菨菩菪菫菬菭菮菰菱菲菳菴菵" \
   "菶菷菸菹菺菻菼菽菾菿萀萁萂萃萄萅萆萇萈萉萊萋萌萍萎萏萐萑萒萓萔萕萖萗萘萙萚萛萜" \
   "萝萞萟萠萡萢萣萤营萦萧萨萵萸著蒁蓈處虖虗虘虙虚蚫蚭蚮蚯蚰蚱蚲蚳蚴蚵蚶蚸蚹蚺蚻蚼" \
   "蚽蚾蚿蛀蛁蛂蛃蛄蛅蛆蛇蛈蛉蛊蛋蛌蛍蛎蛏衅衑衒術衔袈袋袌袞袠袤袬袭袰袱袳袴袵袶袷" \
   "袸袹袺袻袼袽袾袿裀裃裄裆裇裈裉規覐覑覒覓覔視觋觕觖觗觘訛訜訝訞訟訠訡訢訣訤訥訦" \
   "訧訨訩訪訫訬設訮訰許訲訳詎谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谹谺谻豉豘豙" \
   "豚豛豜豝象豼豽貥貦貧貨販貪貫責貭貮貶赇赈赉赊赥赦赧赹赺赻赼赽赾赿趀趹趺趻趼趽趾" \
   "跀跁跂跃跄距躭躮躯軖軗軘軙軚軛軜軝軞軟軠軡転軣辄辅辆逨逩逪逫逬逭逮逯逰週進逳逴" \
   "逵逶逷逸逹逺逻過邫郹郻郼郾郿鄁鄂鄃鄄鄅鄆鄇鄈鄉鄊鄋酓酔酕酖酗酘酙酚酛酜酝酞釈野" \
   "釣釤釥釦釧釨釩釪釫釬釭釮釯釰釱釲釳釴釵釶釷釸釹釺釻釼鈒铏铐铑铒铓铔铕铖铗铘铙铚" \
   "铛铜铝铞铟铠铡铢铣铤铥铦铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷镹閆閇閈閉閊阇阈阉阊" \
   "阋阌阍阎阏阐陻陽陾陿隀隁隂隃隄隅隆隇隈隉隊隋隌隍階随隐隗隿雀雩雪雫雭靪頂頃頄颅" \
   "领颇颈飡飥飦馃馄馅馆馗骐骑骒骓骔骕骖骩髙魚鱾鳥鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹵鹿麥麸麻黃" \
   "黄黒龁龚龛",

12:"聓联聠胔胾脔脹脺脻脼脽脾脿腀腁腂腃腄腅腆腇腈腉腊腋腌腍腎腏腑腒腓腔腕腖腗腘腙腚" \
   "亁亴亵偨傂傃傄傅傆傈傉傊傋傌傍傎傏傐傑傒傓傔傕傖傗傘備傚傛傜傝傟傠傡傢傣傤傥傧" \
   "储傩傲僃兟兠凒凓凔凕凖凱凲凿剩割剴創勛勜勝勞募匑博厤厥厦厧厨厫叅啙啣啺啻啼啽啾" \
   "啿喀喁喂喃善喅喆喇喈喉喊喋喌喑喒喓喔喕喖喗喘喙喚喛喜喝喞喟喠喡喢喣喤喥喦喧喨喩" \
   "喪喫喬喭單喰喱喲喳喴営喷喸喹喺喻喼喽喾嗏嗖嗗嗞嗟嗢嗴嘅圌圍圎圏圐堖堗堘堙堚堛堜" \
   "堞堟堠堡堢堣堤堥堦堧堨堩堪堫堬堭堮堯堰報堳場堶堷堸堹堺堻堼堾堿塀塁塂塃塄塅塆塇" \
   "塈塊塔塟塠塦塭壹壺壻夡奠奡奣奤奥婣婷婸婹婺婻婽婾婿媀媁媂媃媄媅媆媇媈媉媊媋媍媏" \
   "媐媑媒媓媔媕媗媘媙媚媛媜媝媞媟媠媡媢媣媤媥媦媨媩媪媫媬媭媮媯媶媿嫂嫅孱孳寊寋富" \
   "寍寎寏寐寑寒寓寔寕尊尋尌尞尰就尳属屟屡崱崲崳崴崵崶崷崸崹崺崻崼崽崾崿嵀嵁嵂嵃嵄" \
   "嵅嵆嵇嵈嵉嵋嵌嵍嵎嵏嵐嵑嵒嵓嵔嵕嵖嵗嵘嵙嵚嵛嵜嵝嵫嵬嵯嵳巯巽帽帿幀幁幂幃幄幅幆" \
   "幇幈幉幾庽廀廁廂廃廄廆廋弑强弻弼弽弾彘彭徚御徥徦徧徨復循徫悲悳悶悹惁惄惉惌惎惑" \
   "惒惖惠惡惢惣惥惩惪惫惰惱惲惴惵惶惸惹惺惻惼惽惾惿愀愃愄愅愇愉愊愋愌愎愐愑愒愓愔" \
   "愕愖愘愜愝愞愠愡愢愣愤愦愧愲愺慅慌慨戞戟戠戡戢扉扊掌掔掣掰掱掽掾揀揁揂揃揄揆揇" \
   "揈揉揊揋揌揍揎描提揑插揓揔揕揖揗揘揙揚換揜揝揞揟揠握揢揣揥揦揨揩揪揬揭揮揯揰揲" \
   "揳援揷揸揹揺揻揼揽揾揿搀搁搂搃搄搅搓搔搜搥搭搰搽摒摡攲敜敞敟敠敡散敤敥敦敧敨敩" \
   "敪敬斌斐斑斝斮斯旐旑旔旤晪晫晬晭普景晰晱晲晳晴晵晶晷晹智晻晼晽晾晿暀暁暂暃暎暏" \
   "暑曾替最朁朂朜朝朞期朠棃棄棅棆棇棈棉棊棋棌棍棎棏棐棑棒棓棔棕棖棗棘棙棚棛棜棝棞" \
   "棟棠棡棢棣棤棥棧棨棪棫棬棭森棯棰棱棲棳棴棵棶棷棸棹棺棼棽棾棿椀椁椂椃椄椅椆椇椈" \
   "椉椊椋椌植椎椏椐椑椒椓椔椕椖椗椙椚検椝椞椟椠椡椢椣椤椥椦椧椨椩椪椫椬椭椮椰楇楉" \
   "楗楛楧楮楰極榔欹欺欻欼欽款欿歄歮歯殔殕殖殗殘殙殚殛殼殽毮毯毰毱毲毳毴毵毶毽氬氭" \
   "氮氯氰淵淼淾渘渙減渜渝渞渟渡渢渣渤渥渧渨温渪渫測渭港渰渱渲渳渴渷游渹渺渻渼渽渾" \
   "渿湀湁湂湃湄湅湆湇湈湉湊湋湌湍湎湏湐湑湒湓湔湖湗湘湙湚湛湜湝湞湟湠湡湢湣湤湥湦" \
   "湧湨湩湪湫湭湮湯湰湱湲湳湵湶湷湸湹湺湻湼湽湾湿満溁溂溃溄溅溆溇溈溉溊溋溌溚溞溠" \
   "溲滁滋滑滞焙焚焛焜焝焞焟焠無焢焣焤焥焦焧焨焩焪焬焭焮焯焰焱焲焳焴焵然焷焸焹焺焻" \
   "焼焽焾焿煀煐煑煚煡煮煱爲爺牋牌牍牚犀犂犃犄犅犆犇犈犉犊犋犍猆猋猌猒猢猣猤猥猦猨" \
   "猩猬猭猯猰猱猲猳猴猵猶猸猹猾獀獇珷琔琕琖琗琘琙琚琛琜琝琞琟琠琡琢琣琤琥琦琨琩琪" \
   "琫琬琭琮琯琰琱琲琳琴琵琶琸琹琺琻琼琽瑘瑛瑯瓽瓾瓿甀甁甤甥甦甯番畫畬畭畮畯畱畲畳" \
   "畴疎疏痗痘痙痚痛痜痝痞痟痠痡痢痣痤痥痦痧痨痩痪痫痾登發皒皓皔皕皖皳皴盙盚盜睂睃" \
   "睄睅睆睇睈睉睊睋睌睍睎睏睐睑矞矟矬短硜硝硞硠硡硢硣硤硥硦硧硨硩硪硫硬确硯硰硱硲" \
   "硳硴硵硶硷祹祺祻祼祽祾祿禂禃禄禅禆禇禍禽秿稀稁稂稃稄稅稇稈稉稊程稌稍税窖窗窘窙" \
   "窛窜窝竢竣竤童竦竧笿筀筁筂筃筄筅筆筈等筊筋筌筍筎筏筐筑筒筓答筕策筗筘筙筚筛筜筝" \
   "筥筬筳筵粞粟粠粡粢粤粥粦粧粨粩粪粫粬粭紪紫絍絎絏結絑絒絓絔絕絖絗絘絙絚絛絜絝絞" \
   "絟絠絡絢絣絤絥給絧絨絩絪絫絬絭絮絯絰統絲絳絴絵絶絷絽絾綁綎綖缂缃缄缅缆缇缈缉缊" \
   "缋缌缎缏缐缑缒缓缔缕编缗缘缙缾缿罀罤罥罦羠羡羢翓翔翕翖翗翘翙翚翛耋耠聎聏聐聑聒" \
   "腡腱腴臦臮臯臰臵臶臷臸臹舃舄舒舜舼舽舾舿艇艵茻菐萩萪萫萬萭萮萯萰萱萲萳萴萶萷萹" \
   "萺萻萼落萾萿葀葁葂葃葄葅葆葇葈葉葊葋葌葍葎葏葐葑葒葓葔葕葖葘葙葚葛葜葝葞葟葠葡" \
   "葢董葤葥葦葧葨葩葪葫葬葭葮葯葰葱葲葳葴葵葶葷葸葹葺葻葼葽葾葿蒀蒂蒃蒄蒅蒆蒇蒈蒉" \
   "蒊蒋蒌蒍蒎蒏蒐蒢蒫蒾蓃蓇蓚蓱蔇虛虝蛐蛑蛒蛓蛔蛕蛗蛘蛙蛚蛛蛜蛝蛞蛟蛠蛡蛢蛣蛤蛥蛦" \
   "蛧蛨蛩蛪蛫蛬蛭蛮蛯蛰蛱蛲蛳蛴蜑蜒蜓衆衇衈衉衕衖街袲裁裂装裋裌裍裎裐裑裒裓裕裖裗" \
   "裙補裞裡裢裣裤裥褁覃覄覕覗覘覙覚觌觍觚觛觝觞訴訵訶訷訸訹診註証訽詀詁詂詃詄詅詆" \
   "詇詈詉詊詋詌詍詏詐詑詒詓詔評詖詗詘詙詚詛詜詝詞詟詠谟谠谡谢谣谤谥谦谧豞豟豠豾豿" \
   "貀貁貂貃貯貰貱貳貴貵買貸貹貺費貼貽貾貿賀賁赋赌赍赎赏赐赑赒赓赔赕趁趂趃趄超趆趇" \
   "趈趉越趋跅跆跇跈跉跊跋跌跍跎跏跑跒跓跔跕跖跗跘跙跚跛跜跞践躰軤軥軦軧軨軩軪軫軬" \
   "軮軯軰軱軲軳軴軵軶軷軸軹軺軻軼軽辇辈辉辊辋辌辍辎辜辝逼逽逾逿遀遁遂遃遄遅遆遇遈" \
   "遉遊運遌遍遏遐遑遒道達違遖遗鄌鄍鄎鄏鄐鄑鄒鄓鄔鄕鄖鄗鄚酟酠酡酢酣酤酥酦釉释量釽" \
   "釾釿鈀鈁鈂鈃鈄鈅鈆鈇鈈鈉鈊鈋鈌鈍鈎鈏鈐鈑鈓鈔鈕鈖鈗鈘鈙鈚鈛鈜鈝鈞鈟鈠鈡鈢鈣鈤鈥" \
   "鈦鈧鈨鈩鈪鈫鈬鉅鉯铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕" \
   "镺開閌閍閎閏閐閑閒間閔閕閖閗阑阒阓阔阕隑隒隓隔隕隖隘隙隞雁雂雃雄雅集雇雈雋雬雮" \
   "雯雰雱雲雳靓靔靟靫靬靭靮靯靰靱靸韌韩韮項順頇須颉颊颋颌颍颎颏颩颪飓飧飨飩飪飫飭" \
   "飯飰飲馇馈馉馊馋馭馮骗骘骙骚骛骪骫骬骭骮髠鬽鱿鲀鲁鲂鲃鳦鹁鹂鹃鹄鹅鹆鹇鹈黍黑黹" \
   "鼋鼎龂",

13:"亂亃亄亶亷傪傫催傭傮傯傰傱傳傴債傶傷傸傹傺傻傼傽傾傿僀僁僂僄僅僆僇僈僉僋僌働像" \
   "僙兡兾兿凗剷剸剹剺剻剼剽剾剿勠勡勢勣勤勦勧匓匯厀厁厪叠喍喿嗀嗁嗂嗃嗄嗅嗆嗇嗈嗉" \
   "嗊嗋嗌嗍嗎嗐嗑嗒嗓嗔嗕嗘嗙嗚嗛嗜嗝嗠嗡嗣嗤嗥嗦嗧嗨嗩嗪嗫嗬嗭嗮嗯嗰嗱嗲嗳嗵嗶嗷" \
   "嗸嗹嗼嘟嘩圑園圓圔圕堽塉塋塌塍塎塏塐塑塒塓塕塖塗塘塙塚塛塜塝塞塡塢塣塤塥塧塨塩" \
   "塪填塬塮塯塰塱塳塻墎墓墷壼壾夢奦媰媱媲媳媴媵媷媸媹媺媻媼媽媾嫀嫁嫃嫄嫆嫇嫈嫉嫊" \
   "嫋嫌嫍嫎嫐嫑嫒嫓嫔嫟嫫嫯嬅嬋孴孶寖寗寘寙寚寛寜寝寞尟尠尲尴嵊嵞嵟嵠嵡嵢嵣嵤嵥嵦" \
   "嵧嵨嵩嵪嵭嵮嵰嵱嵲嵴嵵嵶嶅幊幋幌幍幎幏幐幕幙幹廅廇廈廉廌廍廒廓廕弒弿彀彁彂彃彙" \
   "彚彮徬徭微徯徰想惷愁愂愆愈愍意愗愙愚愛感愩愪愫愭愮愯愰愱愴愵愶愷愹愼愽愾慀慃慄" \
   "慆慈慉慊慍慎慏慑慔慠慥慩慪戣戤戥戦揅揧揫揱搆搇搈搉搊搋搌損搎搏搐搑搒搕搖搗搘搙" \
   "搚搛搝搞搟搠搡搢搣搤搦搧搨搩搪搬搮搯搱搲搳搵搶搷搸搹携搼搾摀摁摂摃摄摅摆摇摈摉" \
   "摊摋摓摙摛摸撶敫敭敮敯数斒斞斟新斱旒旓旕晸暄暅暆暇暈暉暊暋暌暍暐暒暓暔暕暖暗暘" \
   "暙暛會朡棩椯椱椲椳椴椵椶椷椸椹椺椻椼椽椾椿楀楁楂楃楄楅楆楈楊楋楌楍楎楏楐楑楒楓" \
   "楔楕楘楙楚楜楝楞楟楠楡楢楣楤楥楦楨楩楪楫楬業楯楱楲楳楴楶楷楸楹楺楻楼楽楾楿榀榁" \
   "概榃榄榅榆榇榈榉榊榋榌榘榙榳榵榾槆槌槎槐歀歁歂歃歅歆歇歈歌歱歲歳殜殟殾殿毀毁毂" \
   "毷毸毹毺毻毼氱氲湬溍溎溏源溑溒溓溔溕準溗溘溙溛溜溝溟溡溢溣溤溥溦溧溨溩溪溫溬溭" \
   "溮溯溰溱溳溴溵溶溷溸溹溺溻溼溽溾溿滀滂滃滄滅滆滇滈滉滊滌滍滏滐滒滓滔滖滗滘滙滚" \
   "滛滜滝滟滠满滢滣滤滥滦滧滨滩滪滭滶漓漠漣漨漭漷煁煂煃煄煅煆煇煈煉煊煋煌煍煎煏煒" \
   "煓煔煕煖煗煘煙煜煝煞煟煠煢煣煤煥煦照煨煩煪煫煬煭煯煰煲煳煴煵煶煷煸煺熍熓牃牎牏" \
   "牐牑牒犌犎犏犐犑献猷猺猻猼猽猿獁獂獅獆獈獉獊獏獒獓琧琾琿瑀瑁瑂瑃瑄瑅瑆瑇瑈瑉瑊" \
   "瑋瑌瑍瑎瑏瑐瑑瑒瑓瑔瑕瑖瑗瑙瑚瑜瑝瑞瑟瑥瑰瑳瑵瓡甂甃甄甅甆甝甞畵當畷畸畹畺痬痭" \
   "痮痯痰痱痲痳痴痵痶痷痸痹痺痻痼痽痿瘀瘁瘂瘃瘄瘅瘆瘏瘐瘑瘔皗皘皙皵盝盞盟睒睓睔睕" \
   "睖睗睘睙睚睛睜睝睞睟睠睡睢督睤睥睦睧睨睩睪睫睬睭睰睷睹瞄矠矮硸硹硺硻硼硽硾硿碀" \
   "碁碂碃碄碅碆碇碈碉碊碋碌碍碎碏碐碑碒碓碔碕碖碗碘碙碚碛碜碢碤碰禀禁禈禉禊禋禌禎" \
   "福禐禑禒禓禔禕禖禗禘禙稏稐稑稒稓稔稕稖稗稘稙稚稛稜稝稞稟稠稡稢稣稤稥窞窟窠窡窢" \
   "窣窤窥窦窧窩竨竩竪筞筟筠筡筢筣筤筦筧筨筩筪筫筭筮筯筰筱筲筴筶筷筸筹筺筻筼筽签筿" \
   "简節粮粯粰粱粲粳粴粵糀絸絹絺絻絼絿綀綂綃綄綅綆綇綈綉綊綋綌綍綏綐綑綒經綔綕綗綘" \
   "継続綛綤缚缛缜缝缞缟缠缡缢缣缤罧罨罩罪罫罬罭置署羣群羥羦羧羨義羪翜翝耡耢聕聖聗" \
   "聘肄肅肆腛腜腝腞腟腠腢腣腤腥腦腧腨腩腪腫腬腭腮腯腰腲腳腵腶腷腸腹腺腻腼腽腾腿膄" \
   "膇舅與艀艁艂艃艄艅艆艈艉蒑蒒蒓蒔蒕蒖蒗蒘蒙蒚蒛蒜蒝蒞蒟蒠蒡蒣蒤蒥蒦蒧蒨蒩蒪蒬蒭" \
   "蒮蒯蒰蒱蒲蒳蒴蒵蒶蒷蒸蒹蒺蒻蒼蒽蒿蓀蓁蓂蓄蓅蓆蓉蓊蓋蓌蓍蓎蓏蓐蓑蓒蓓蓔蓕蓖蓗蓘" \
   "蓙蓛蓜蓝蓞蓟蓠蓡蓢蓣蓤蓥蓦蓧蓨蓩蓪蓫蓬蓮蓽蔀蔭蔯蔱虜虞號虡蛖蛵蛶蛷蛸蛹蛺蛻蛼蛽" \
   "蛾蛿蜁蜂蜃蜄蜅蜆蜇蜈蜉蜊蜋蜌蜍蜎蜏蜐蜔蜕蜖蜗蜣蜹蝆蝍衘衙裊裏裔裘裚裛裝裟裠裧裨" \
   "裩裪裬裭裮裯裰裱裲裶裷裸裺裼裾裿褀褂褃褄褚覅覛覜觎觜觟觠觡觢解觤觥触觧訾訿詡詢" \
   "詣詤詥試詧詨詩詪詫詬詭詮詯詰話該詳詴詵詶詷詸詹詺詻詼詽詾詿誀誁誂誃誄誅誆誇誈誉" \
   "誊誔誕誠谨谩谪谫谬谼豊豋豢豣豤豥豦貄貅貆貇貈貉貊貲賂賃賄賅賆資賈賉賊賋賌賍賎赖" \
   "赗赨赩赪趌趍趎趏趐趑趒趓趔跐跟跠跡跢跣跤跥跦跧跨跩跪跫跬跭跮路跰跱跲跳跴跶跷跸" \
   "跹跺跻躱躲躳軭軾軿輀輁輂較輄輅輆輇輈載輊輋輌辏辐辑辒输辔辞辟辠農遘遙遚遛遜遝遞" \
   "遟遠遡遢遣遤遥遨遳郌郒鄘鄙鄛鄜鄝鄞鄟鄠鄡鄢鄣鄤鄥酧酨酩酪酫酬酭酮酯酰酱鈮鈯鈰鈱" \
   "鈲鈳鈴鈵鈶鈷鈸鈹鈺鈻鈼鈽鈾鈿鉀鉁鉂鉃鉄鉆鉇鉈鉉鉊鉋鉌鉍鉎鉏鉐鉑鉒鉓鉔鉕鉖鉗鉘鉙" \
   "鉚鉛鉜鉝鉞鉟鉠鉡鉢鉣鉤鉥鉦鉧鉨鉩鉪鉫鉬鉭鉮鉰鉱鉲鉳鉴銏銰锖锗锘错锚锛锜锝锞锟锠" \
   "锡锢锣锤锥锦锧锨锩锪锫锬锭键锯锰锱锳镻閘閙閚閛閜閝閞閟閠阖阗阘阙隚際障隝隟隠隡" \
   "雉雊雍雎雏雴雵零雷雸雹雺電雼雽雾靕靖靲靳靴靵靶靷靹韪韫韴韵頉頊頋頌頍頎頏預頑頒" \
   "頓颐频颒颓颔颕颖颫颬飔飕飬飮飱飳飴飵飶飷飹飻飼飽飾飿餀馌馍馎馏馐馚馯馰馱馲馳馴" \
   "馵馺骜骝骞骟骯骰骱髡髢鬾鬿魀魁魂魛魜魝魞鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鳧鳨鳩鳪鳫鳭" \
   "鳮鳯鳰鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔麀麁麂黽鼌鼓鼔鼠鼡龃龄龅龆",

14:"僊僎僐僑僒僓僔僕僖僗僘僚僛僜僝僞僟僠僡僢僣僤僥僦僧僨僩僪僫僬僭僮僯僰僱僲僳僴僷" \
   "儆兢冩凘凳凴劀劁劂劃劄勥勨勩勪勫勬勭勱匰匱匲厬厭厮厯厰厲叆嗺嗻嗽嗾嗿嘀嘁嘂嘃嘄" \
   "嘆嘇嘈嘉嘊嘋嘌嘍嘎嘏嘐嘑嘒嘓嘔嘕嘖嘗嘘嘙嘚嘛嘜嘝嘞嘡嘢嘣嘤嘥嘦嘧嘨噉噑圖圗團圙" \
   "塲塴塵塶塷塸塹塺塼塽塾塿墁墂境墄墅墆墇墈墉墊墋墌墍墏墐墑墒墔墕墖増墘墙墚墛墜墬" \
   "墭墮墴墸壽夐夣夤夥奧奨奩奪奬嫕嫖嫗嫘嫙嫚嫛嫜嫝嫞嫠嫡嫢嫣嫤嫥嫦嫧嫨嫩嫪嫬嫭嫮嫰" \
   "嫱嫲嫳嫷嫹孵孷察寠寡寢寣寤寥實寧寨寬對尡屢屣嵷嵸嵺嵻嵼嵽嵾嵿嶀嶁嶂嶃嶄嶆嶇嶈嶉" \
   "嶊嶋嶌嶍嶎嶐嶞巰幑幒幓幔幖幗幘幚幛幣廎廏廐廑廔廖廗廘廙廜廣弊彄彅彆彉彯彰徱徳徴" \
   "徶愨愬愳愸愻愿慁慂慇態慐慒慓慕慖慘慚慛慝慞慟慡慢慣慬慯慱慲慳慴慵慷慺慻慽憀憁憆" \
   "憏憜戧戨戩截戫戬搫搴搻搿摌摍摎摏摐摑摔摕摖摗摘摚摜摝摞摟摠摢摣摤摥摦摧摪摫摬摭" \
   "摮摱摲摳摴摵摶摷摹摺摻摼摽摾摿撁撂撄撇撖撦撯撱撾擆敱敲敳敶斠斡斲旖旗暚暜暝暞暟" \
   "暠暡暢暣暤暥暦暧暨曄曅朄朅朢榍榎榏榐榑榒榓榕榖榗榚榛榜榝榞榟榠榡榢榣榤榥榦榧榨" \
   "榩榪榫榬榭榮榯榰榱榲榴榶榷榸榹榺榻榼榽榿槀槁槂槃槄槅槇槈槉槊構槍槏槑槒槓槔槕槖" \
   "槗様槙槚槛槜槝槞槟槠槡槤槨槩槪槫槬槭槮槯槰樃樄樆樇樋模樤樥樺歉歊歋歍歰歴殝殞殠" \
   "殡毄毓毾氳滎滫滬滮滯滰滱滲滳滴滵滷滸滹滺滻滼滽滾滿漁漂漃漄漅漆漇漈漉漊漋漌漍漎" \
   "漏漑演漕漖漗漘漙漚漛漜漝漞漟漡漢漤漥漧漩漪漫漬漮漯漰漱漲漳漴漵漶漸漹漺漻漼漾潀" \
   "潂潃潄潅潆潇潈潉潊潋潌潍潎潒潢潩潳潴澉澚濄煛煹煻煼煽煾煿熀熁熂熃熄熅熆熇熈熉熊" \
   "熋熌熎熏熐熑熒熔熕熖熗熘熙熚熢熥熬燁爳爾牄牓牔犒犓犔犕犖犗獃獄獌獍獐獑獔獕獙獚" \
   "瑠瑡瑢瑣瑤瑦瑧瑨瑪瑫瑭瑮瑱瑲瑴瑶瑷瑸瑹璃璈璉璍璓甇甈甉甍甧畻畼畽疐疑瘇瘈瘉瘊瘋" \
   "瘌瘍瘎瘒瘓瘕瘖瘗瘘瘙瘟瘣瘥瘦瘧瘩皶皷皸皹盠盡盢監睮睯睱睲睳睴睵睶睸睺睻睼睽睾睿" \
   "瞀瞁瞂瞃瞅瞆瞇瞍碝碞碟碠碡碣碥碦碧碨碩碪碫碬碭碮碯碱碲碳碴碵碶碷碸碹磀磁磆磈磋" \
   "磓禚禛禝禞禟禠禡禢禣稦稧稨稩稪稫稬稭種稯稰稱稲稳稵穁穊窨窪窫窬窭竬竭竮端竰箁箂" \
   "箃箄箅箆箇箈箉箊箋箌箍箎箏箐箑箒箓箔箕箖算箘箙箚箛箜箝箞箟箠管箢箣箤箥箦箧箨箩" \
   "箪箫箬箸粶粷粸粹粺粻粼粽精粿糁綜綝綞綟綠綡綢綣綥綦綧綨綩綪綫綬維綮綯綰綱網綳綴" \
   "綵綶綷綸綹綺綻綼綽綾綿緀緁緂緃緄緅緆緇緈緉緊緋緌緍緎総緐緑緒緓緔緕緢緺缥缦缧缨" \
   "缩缪缫罁罂罯罰罱罳罴羫翞翟翠翡翢翣翤翥耣耤耥聙聚聛聜聝聞聟聡聢聣肇肈腐膀膁膂膃" \
   "膅膆膈膉膊膋膌膍膎膏膐膑膖膜臧臺舆舓舔舕舝舞艊艋艌艍蓭蓯蓰蓲蓳蓴蓵蓶蓷蓸蓺蓻蓼" \
   "蓾蓿蔁蔂蔄蔅蔆蔈蔉蔊蔋蔌蔍蔎蔏蔐蔑蔒蔓蔔蔕蔖蔗蔘蔙蔚蔛蔜蔝蔞蔟蔠蔡蔢蔣蔤蔥蔦蔧" \
   "蔨蔩蔪蔫蔮蔰蔲蔳蔴蔵蔶蔷蔸蔹蔺蔻蔼蔽蕏蕖蕯薌薖虠蜀蜘蜙蜚蜛蜜蜝蜞蜟蜠蜡蜢蜤蜥蜦" \
   "蜧蜨蜩蜪蜫蜬蜭蜮蜯蜰蜱蜲蜳蜴蜶蜷蜸蜺蜻蜼蜽蜾蜿蝀蝁蝂蝃蝄蝅蝇蝈蝉蝊蝋蝕蝧蝫蝸螂" \
   "裫裳裴裵裹裻製褅褆複褈褉褊褋褌褍褐褑褓褔褕褖褗褘褙褛褝褞褡褨褪覝覞覟覠覡觏觨觩" \
   "觪觫訚誋誌認誎誏誐誑誒誓誖誗誘誙誚誛誜誝語誟誡誢誣誤誥誦誧誨誩說誫説読誮誾谭谮" \
   "谯谰谱谲谽豧豨豩豪貋貌貍賏賐賑賒賓賔賕賖賗賘赘赙赚赛赫趕趖趗趘趙趚跼跽跾跿踀踁" \
   "踂踃踄踅踆踇踈踉踊踋踌踍踎躴躵輍輎輏輐輑輒輓輔輕辕辖辗辡辢辣遦遧適遪遫遬遭遮遯" \
   "遰遱鄦鄧鄩鄪鄫鄬鄭鄮鄯鄰鄱鄲酲酳酴酵酶酷酸酹酺酻酼酽酾酿鈭鉵鉶鉷鉸鉹鉺鉻鉼鉽鉾" \
   "鉿銀銁銂銃銄銅銆銇銈銉銊銋銌銍銎銐銑銒銓銔銕銖銗銘銙銚銛銜銝銞銟銠銡銢銣銤銥銦" \
   "銧銨銩銪銫銬銭銮銯銱鋁鋋鋌鋣鋩鋮锲锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镄镅閡関閣閤" \
   "閥閦閧閨閩閪閭閮阚隢隣隤隥隧隨隩隫雌雐雑雒雿需霁霆靗靘静靤靺靻靼靽靾靿鞀鞁鞂鞃" \
   "鞄鞅鞆韍韎韬韶韷頔頕頖頗領頙頚颗颭颮颯颰颱飖飗飸餁餂餃餄餅餆餇餉餌餎餏馑馒馛馜" \
   "馝馶馷馸馹馻馼馽馾馿駀駁駂駃駄駅駆駇駏骠骡骢骲骳骵骶骷髚髣髤髥髦髧髨髩髪鬦魃魄" \
   "魅魆魟魠魡魢魥鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鳱鳲鳳鳴鳵鳶鹕鹖鹗鹘鹙鹚鹛鹜麧麼麽" \
   "鼏鼐鼑鼻齊龇龈",


15:"僵僶僸價僺僻僼僽僾僿儀儁儂儃億儅儇儈儉儊儋儌儍儎儏儙儚冪凙凚凛凜劅劆劇劈劉劊劋" \
   "劌劍劎劏劐勮勯勰勲匔匳厱叇嘠嘪嘫嘬嘭嘮嘰嘱嘲嘳嘵嘶嘷嘸嘹嘺嘻嘼嘽嘾嘿噀噁噂噃噄" \
   "噅噆噇噈噊噋噌噍噎噏噐噒噓噔噕噖噗噘噙噚噛噜噝噠噢噧噴噵噶圚墀墝增墟墠墡墢墣墤" \
   "墥墦墧墨墩墪墫墯墰墱墲墳墵墶墹墺壿夀夦奫奭嫴嫵嫶嫸嫺嫻嫼嫽嫾嫿嬀嬁嬂嬃嬄嬆嬇嬈" \
   "嬉嬊嬌嬍嬎嬏嬘嬞審寪寫寭寮寯導尵層履屦屧嵹嶏嶑嶒嶓嶔嶕嶖嶗嶘嶙嶚嶛嶜嶝嶟嶠嶡嶢" \
   "嶣嶤嶥嶯嶱嶲嶴巤幜幝幞幟幠幡幢幤幥幩廚廛廝廞廟廠廡廢廤彈影徲徵德徸徹徺慗慙慜慤" \
   "慦慧慫慭慮慰慶慸慹慼慾慿憂憃憄憅憇憈憉憋憍憎憐憒憓憔憕憘憚憛憞憟憡憢憣憤憦憧憨" \
   "憪憫憬憭憮憯憰憱憳憽懂懏戭戮戯摨摩摯摰撀撃撅撆撈撊撋撌撍撎撏撐撑撒撓撔撕撗撘撙" \
   "撚撛撜撝撞撟撠撡撢撣撤撥撧撨撩撪撫撬播撮撰撲撳撴撵撷撸撹撺撻擏擒擕擖擛敵敷數敹" \
   "敺敻斢斳暩暪暫暬暭暮暯暰暱暲暳暴暵暶暷暹暼曂曃曏槢槣槥槦槧槱槲槳槴槵槶槷槸槹槺" \
   "槻槼槽槾槿樀樁樂樅樈樉樊樌樍樎樏樐樑樒樓樔樕樖樗樘標樚樛樜樝樞樟樠樢樣樦樧権横" \
   "樫樬樭樮樯樰樱橄橗橡橢橥檛歎歏歐歑歒歓歔歵歶殢殣殤殥殦毃毅毆毿氀氁氂滕漀漐漒漦" \
   "漽漿潁潏潐潑潓潔潕潖潗潘潙潛潜潝潟潠潡潣潤潥潦潧潨潪潫潬潭潮潯潰潱潲潵潶潷潸潹" \
   "潺潻潼潽潾潿澁澂澄澅澆澇澈澊澋澌澍澎澏澐澑澒澓澔澕澖澗澘澙澛澜澝澳澻澾濆濎濐熛" \
   "熜熝熞熟熠熡熣熤熦熧熨熩熪熫熭熮熯熰熱熲熳熴熵熼熿爴牅牕牖牗犘犙犚犛獋獎獖獗獘" \
   "獛獜獝獞獟獠獡獢獤獦瑩瑬瑺瑻瑼瑽瑾璀璁璂璄璅璆璇璊璋璌璎璖璜璡甊甋甌甎畾畿瘚瘛" \
   "瘜瘝瘞瘠瘡瘢瘤瘨瘪瘫瘼癊皚皛皜皝皞皣皺盤瞈瞉瞊瞋瞌瞎瞏瞐瞑瞒瞓瞙瞝瞢瞱確碻碼碽" \
   "碾碿磂磃磄磅磇磉磊磌磍磎磏磐磑磒磔磕磗磘磙磝磤禜禤禥禩稴稶稷稸稹稺稻稼稽稾稿穀" \
   "穂穃窮窯窰窱窲窳窴箭箮箯箰箱箲箳箴箵箶箷箹箺箻箼箽箾箿篁篂篃範篅篆篇篈篊篋篌篍" \
   "篎篏篐篑篒篓篨糂糃糄糅糆糇糈糉糊糋糌糍糎糔緖緗緘緙線緛緜緝緞緟締緡緣緤緥緦緧編" \
   "緩緪緫緬緭緮緯緰緱緲緳練緵緶緷緸緹緼緽緾緿縀縁縂縃縄縅縆縇縋縌縎縒缬缭缮缯罵罶" \
   "膡膢膣膤膵膷膼臱舖舗艎艏艐艑艒艓艔艖艘蓹蔃蔬蔾蔿蕀蕁蕂蕃蕄蕅蕆蕇蕈蕉蕊蕋蕌蕍蕎" \
   "蕐蕑蕒蕓蕔蕕蕘蕙蕚蕛蕜蕝蕞蕟蕠蕡蕢蕣蕤蕥蕦蕧蕨蕩蕪蕫蕬蕮蕰蕱蕲蕳蕴蕵蕸蕺薁薘薡" \
   "藔虢蜵蝌蝎蝏蝐蝑蝒蝓蝔蝖蝗蝘蝙蝚蝛蝜蝝蝞蝟蝠蝡蝢蝣蝤蝥蝦蝨蝩蝪蝬蝭蝮蝯蝰蝱蝲蝳" \
   "蝴蝵蝶蝷蝹蝺蝻蝼蝽蝾蝿螀螁螆螋螖螝衚衛衜衝裦褎褏褒褜褟褠褢褣褤褥褦褫褬褯褲褳褴" \
   "褵襅覢覣覤覥覩觐觑觬觭觮觯觰誯誰誱課誳誴誵誶誷誸誹誺誻誼誽調諀諁諂諃諄諅諆談諈" \
   "諉諊請諌諍諎諏諐諑諒諓諔諕論諗諘諙諚諛諣諸諾谳谴谵谾豌豍豎豫豬貎貏貓賙賚賛賜賝" \
   "賞賟賠賡賢賣賤賥賦賧賨賩質賫賬賭赜赭趛趜趝趞趟趠趡趢趣趤踏踐踑踒踓踔踕踖踗踘踙" \
   "踚踛踜踝踞踟踠踡踢踣踤踥踦踧踨踩踪踫踬踭踮踯踷踺踻蹃躶躷躸躹躺躻躼輖輗輘輙輚輛" \
   "輜輝輞輟輠輡輢輣輤輥輦輧輨輩輪輫輬辘辤辳遲遴遵遶遷選遹遺遻遼邁邆郶鄳鄴鄵鄶鄷鄸" \
   "醀醁醂醃醄醅醆醇醈醉醊醋醌醏銲銳銴銵銶銷銸銹銺銻銼銽銾銿鋀鋂鋃鋄鋅鋆鋇鋈鋉鋊鋍" \
   "鋎鋏鋐鋑鋒鋓鋔鋕鋖鋗鋘鋙鋚鋛鋜鋝鋞鋟鋠鋡鋢鋤鋥鋦鋧鋨鋪鋫鋬鋭鋯鋰鋱鋲鋳鋴鋵鋶錒" \
   "錵錺錻镆镇镈镉镊镋镌镍镎镏镐镑镒镓镔镕閫閬閯閰閱閲閳閴阛隦險雓霂霃霄霅震霈霉霊" \
   "靚靠靥鞇鞈鞉鞊鞋鞌鞍鞎鞏鞐鞑鞒鞗韏韐韑韯韰頛頜頝頞頟頠頡頢頣頦頧頨頩頪頫頬頲题" \
   "颙颚颛颜额颲颳飘飺餈養餋餍餑餒餓餔餕餖餗餘餙馓馔駈駉駊駋駌駍駎駐駑駒駓駔駕駖駗" \
   "駘駙駚駛駜駝駞駟駠骣骴骸骹骺骻骼骿髛髫髬髮髯髰髱髲髳髴鬧魇魣魤魦魧魨魩魪魫魬魭" \
   "魮魯魰魱魲魳魴魵魶魷魸魹鮔鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鳷鳸鳹鳺鳻鳼鳽鳾鳿鴀鴁鴂鴃" \
   "罷罸罼羬羭羮羯羰翦翧翨翩翪翫翬翭耦耧聤聥嵚庱膓膔膕膗膘膚膛膝膞膟膠",

16:"亸儐儑儒儓儔儕儖儗儘儛儜儝儞儣儫兣冀凝凞劑劒劓劔勳勵匴叡嘯嘴噞噟噡噣噤噥噦器噩" \
   "噪噫噬噭噮噯噰噱噲噳噷噸噹噺噻噼嚃嚄嚆圛圜墻墼墽墾墿壀壁壂壃壄壅壆壇壈壉壊壋壌" \
   "壒夁奮奯嬐嬑嬒嬓嬔嬕嬖嬗嬙嬚嬛嬜嬝嬟嬠嬡嬢嬨嬩嬳嬴學孹寰嶦嶧嶨嶩嶪嶫嶬嶭嶮嶰嶳" \
   "嶵嶶嶼幦幧幨幪幯廥廦廧廨廩廪彇彊彋彛彜徻徼憊憌憑憖憗憙憝憠憥憩憲憴憶憷憸憹憺憻" \
   "憼憾憿懀懁懄懅懆懈懊懌懍懎懐懒懓懔懙懜懞戰戱撉撼撽撿擀擁擂擃擄擅擇擈擉擋擌操擎" \
   "擐擑擓擔擗擙據擜擝擞擭擳攳整敼敽敾敿斓斴旘旙暸暺暻暽暾暿曀曁曆曇曈曉曊曋曌曍曔" \
   "朆朣朤朥樨樲樳樴樵樶樷樸樹樻樼樽樾樿橀橁橂橃橅橆橇橈橉橊橋橌橍橎橏橐橑橒橓橔橕" \
   "橖橘橙橛橜橝橞機橠橣橤橦橧橨橩橪橫橬橭橮橯橰橱橲橳橴橵橶橷橸橹橺橻橼橽檃檇檎檖" \
   "檙檝檠檤檧檨歕歖歘歙歚歷殧殨殪殫毇毈氃氄氅氆氇潚潞澃澞澟澠澡澢澣澤澥澦澧澨澪澫" \
   "澬澭澮澯澰澱澲澴澵澶澷澸澹澺澼澽澿激濁濂濃濅濇濈濉濊濋濍濏濑濒濓濖濗濛濨濩濸瀄" \
   "熶熷熸熹熺熻熾燀燂燃燄燅燆燇燈燉燊燋燌燍燎燏燐燑燒燓燔燕燖燗燘燙燚燛燜燝燞營燠" \
   "燤燧燪燵犜犝犞犟獣獥獧獨獩獪獫獬獭獲獴瑿璏璑璒璔璕璘璙璚璝璞璟璠璢璣璤璥璭璲瓢" \
   "甏甐甑甒疀疁疂瘬瘭瘮瘯瘰瘱瘲瘳瘴瘵瘶瘷瘸瘹瘺瘻瘽瘾瘿癀癃皟皠皡皻盥盦盧瞔瞕瞖瞗" \
   "瞘瞚瞛瞜瞞瞟瞠瞡瞣瞥瞰磖磚磛磜磞磟磠磡磢磣磥磦磧磨磩磪磫磬磭磮磲磺禧禨禪禫禭穄" \
   "穅穆穇穈穋穌積穎穏穐穑穒穓穔窵窶窷窸窹窺窻窼窽窿竱築篔篕篖篗篘篙篚篛篜篝篞篟篠" \
   "篡篢篣篤篥篦篧篩篪篫篬篭篮篯篰篱篳篴篷簉簑簔糏糐糑糒糓糕糖糗糘糙糚糢緻縈縉縊縍" \
   "縏縐縑縓縔縕縖縗縘縙縚縛縜縝縞縟縠縡縢縣縤縥縦縧縨縪縫縭縸縺缰缱缲缳缴罃罹罺罻" \
   "羱羲翮翯翰翱翴耨耩耪聬聮聱膙膦膧膨膩膪膫膬膭膮膯膰膱膲膳膴膶膸膹臇臈臲臻興舉舘" \
   "艕艗艙蕗蕭蕶蕷蕹蕻蕼蕽蕾蕿薀薂薃薄薅薆薇薈薉薊薋薍薎薏薐薑薒薓薔薕薗薙薚薛薜薝" \
   "薞薟薠薢薣薤薥薦薧薨薩薪薫薬薭薮薯薳薽藇虣虤虥虦螃螄螅螇螈螉螊螌融螎螏螐螑螒螓" \
   "螔螕螗螘螙螚螛螜螞螟螠螡螢螣螤螥螦螧螨螩螭螯螴螶蟆蟇蟒衞衟衠衡褧褩褭褮褰褱褶褷" \
   "褸褹褾褿襀襂襐襒襔覦覧覨親觱諜諝諞諟諠諡諢諤諥諦諧諨諩諪諫諬諭諮諯諰諱諲諳諴諵" \
   "諶諷諹諺諻諼諽諿謀謁謂謃謉謊謎謏謔豭豮豱貐貑貒賮賯賰賱賲賳賴賵赝赞赟赠赬赮趥趦" \
   "趧踰踱踲踳踴踵踶踸踹踼踽踾踿蹀蹁蹂蹄蹅蹆蹉躽躾輭輮輯輰輱輲輳輴輵輶輷輸輹輺輻輼" \
   "辙辚辥辦辧辨辩遽遾避邀邂還邅郺鄹鄺醍醎醐醑醒醓醔醕醖醗醙醚醛醜醝鋷鋸鋹鋺鋻鋼鋽" \
   "鋾鋿錀錁錂錃錄錅錆錇錈錉錊錋錌錍錎錏錐錑錓錔錕錖錗錘錙錚錛錜錝錞錟錠錡錢錣錤錥" \
   "錦錧錨錩錪錫錬錭錮錯錰錱録錳錴錶錷錸錹錼錽錾錿鍀鍁鍂鍃鍄鍅鍆鍈鍋鍣鍩鍵鍺鎁鎯镖" \
   "镗镘镙镚镛镜镝镞镟镠镼閵閶閷閸閹閺閻閼閽閾閿闀闁闂闍隬隭隮隯隰隱隲隷雔雕霋霌霍" \
   "霎霏霐霑霒霓霔霕霖霗霙靛靜靦鞓鞔鞕鞖鞘鞙韒韸頤頥頭頮頯頰頱頳頴頵頶頷頸頹頺頻頼" \
   "頽颞颟颠颡颴颵飙飚餐餚餛餜餝餞餟餠餡餢餣餤餦餧館餩馞馟馠駡駢駣駤駥駦駧駨駩駪駫" \
   "駬駭駮駯駰駱駲駳骽骾髭髵髶髷髸髹髺髻鬇鬨鬳魈魉魺魻魼魽魾魿鮀鮁鮂鮃鮄鮅鮇鮈鮉鮊" \
   "鮋鮌鮍鮎鮏鮐鮑鮒鮓鮕鮖鮗鮘鮣鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鴊鴏鴐鴑鴒鴓鴕鴖鴗鴘" \
   "鴙鴚鴛鴝鴞鴟鴠鴡鴢鴣鴤鴥鴦鴧鴨鴩鴪鴫鴬鹥鹦鹧鹨鹷鹾麅麆麇麈麬麭麮麺黇黈黉黔黕黖" \
   "黗默黺鼼鼽齓龍",

17:"償儠儡儢儤儥儦儧儨儩優儬儰儲凟劕勴勶匵厳噽噾噿嚀嚁嚂嚅嚇嚈嚉嚊嚋嚌嚍嚎嚏嚐嚑嚒" \
   "嚓嚝嚮嚺壍壎壏壐壑壓壔壕壖壗壙嬣嬤嬥嬦嬧嬪嬫嬬嬭嬮嬯嬰嬱嬲嬵嬶嬷嬺孺孻寱寲尶尷" \
   "屨嶷嶸嶹嶺嶻嶽嶾嶿巁幫幬幭彌彍徽徾憵懃懇應懋懑懗懚懛懝懠懡懢懤懥懦懧懨懩懭懱戲" \
   "戴擊擘擟擠擡擢擣擤擦擧擨擩擫擬擮擯擰擱擲擴擿攁攃斀斁斂斃斣斵斶旚曎曐曑曒曓曕曖" \
   "曗曙曚朦橚橾橿檀檁檂檄檅檆檈檉檊檋檌檍檏檐檑檒檓檔檕檗檘檚檜檞檟檡檢檣檥檦檩檪" \
   "檬檴櫆櫛櫣歗歛歜歝歟殩殬殭殮毚氈氉氊氋澀澩濌濔濕濘濙濚濜濝濞濟濠濡濢濣濤濥濦濧" \
   "濪濫濬濭濮濯濰濱濲濴濵濶濹濻濿瀁瀇瀎瀞瀡熽燡燢燣燥燦燨燩燫燬燭燮燯燰燱燲燳燴燶" \
   "燷爵牆犠獮獯獰獱獳獷璐璗璛璦璨璩璪璫璬璮璯環璱璳璴璵瓁瓂甓甔甕疃疄癁療癄癅癆癇" \
   "癈癉癋癌癍癎癘皢皤皥皼盨盩盪瞤瞦瞧瞨瞩瞪瞫瞬瞭瞮瞯瞲瞳瞴瞵瞶瞷瞸矯矰磯磰磱磳磴" \
   "磵磶磷磸磹磻磼磽磾磿礀礁礂礃礄礅礇礈礍禦禬禮禯穉穕穖穗穘穙穚穛穜穝穞穟窾竀竁竂" \
   "竃竲竳竴篲篵篶篸篹篺篻篼篾篿簀簁簂簃簄簅簆簇簈簊簋簌簍簎簏簐簒簓簕簖簗簘簧簻糛" \
   "糜糝糞糟糠糡縩縬縮縯縰縱縲縳縴縵縶縷縹縻縼總績縿繀繁繂繃繄繅繆繇繈繉繊繋繌繍繤" \
   "罄罅罆罽罾罿羀羁翲翳翵翶翼耫耬聯聰聲聳聴膥膺膻膽膾膿臀臁臂臃臄臅臆臉臊臌臒臨臩" \
   "舊艚艛艜艝艱薰薱薲薴薵薶薷薸薹薺薻薼薾薿藀藁藂藃藄藅藆藈藉藊藋藌藍藎藏藐藑藒藓" \
   "藗藡藬藱蘤虧虨螪螫螬螮螰螱螲螳螵螷螸螹螺螻螼螽螾螿蟀蟁蟂蟃蟄蟅蟈蟉蟊蟋蟌蟍蟎蟏" \
   "蟐蟑蟓蟝蟞蟥蠁蠎褺褻褼褽襁襃襄襆襇襈襉襊襋襌襍襎襏襑襓襕襖襚覫覬覭覮覯觲觳謄謅" \
   "謆謇謈謋謌謍謐謑謒謓謕謖謗謘謙謚講謜謝謞謟謠謡謢謧謨謩謷謸谿豀豁豏豯豰豲豳貔貕" \
   "貖貘賶賷賹賺賻購賽贅赡赢赯趨蹇蹈蹊蹋蹌蹍蹎蹏蹐蹑蹒蹓蹕蹥輽輾輿轀轁轂轃轄轅轋辪" \
   "辫邃邇邈邉鄻鄼鄽鄾鄿醘醞醟醠醡醢醣醤醨鍇鍉鍊鍌鍍鍎鍏鍐鍑鍒鍓鍔鍕鍖鍗鍘鍙鍚鍛鍜" \
   "鍝鍞鍟鍠鍡鍢鍤鍥鍦鍧鍨鍪鍫鍬鍭鍮鍯鍰鍱鍲鍳鍴鍶鍷鍸鍹鍻鍼鍽鍾鍿鎀鎂鎃鎄鎅鎆鎇鎈" \
   "鎚鎝鎡鎪鎺镡镢镣镤镥镦镧镨镩镪镫闃闄闅闆闇闈闉闊闋闌闎闏隳隸雖雘雚霘霚霛霜霝霞" \
   "霟霠霡鞚鞛鞜鞝鞞鞟鞠鞡鞬韓韔韕韱韺顀顁顂顃顄顅顆顇顈顉顊颶颷餥餪餫餬餭餯餰餱餲" \
   "餳餴餵餶餷餸餽餿馘馡馢馣駴駵駶駷駸駹駺駻駼駽駾駿騀騁騂騃骤髀髁髼髽髾髿鬀鬁鬂鬴" \
   "魊魋魌魍魎魏鮆鮙鮚鮛鮜鮝鮞鮟鮠鮡鮢鮤鮥鮦鮧鮨鮩鮪鮫鮬鮭鮮鮯鮰鮱鮲鮳鮴鮺鯅鯈鯎鯐" \
   "鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鴜鴭鴮鴯鴰鴱鴲鴳鴴鴵鴶鴷鴸鴹鴺鴻鴼鴽鴾鴿鵀鵁鵂" \
   "鵃鵄鵅鵆鵇鵈鵉鵐鹩鹪鹫鹬麉麊麋麯麰麿黊黋黏黚黛黜點黻黿鼢鼣鼤鼾鼿齋齔齢龋龌龜龠",


18:"儭儮儯儱儵冁叢嚔嚕嚖嚗嚘嚙嚚嚛嚜嚞嚟嚠嚡嚢嚣嚤壘壝夑奰嬸嬻嬼屩屪巀巂幮廫彝彞懕" \
   "懖懘懟懣懪懫懬懮懰懳懴懵戳擥擪擵擶擷擸擹擺擻擼擽擾攂攄攅攆斔斷旛旞曘曛曜曞曠檫" \
   "檭檮檯檰檱檲檳檵檶檷檸檹檺檻檼檽檾檿櫀櫁櫂櫃櫄櫅櫇櫈櫉櫊櫎櫒櫔櫗櫙櫚櫡櫭歞歸殯" \
   "毉濷濺濼濽濾瀀瀂瀃瀅瀆瀈瀉瀊瀋瀌瀍瀏瀐瀑瀒瀓瀔瀦燸燹燺燻燼燽燾燿爀爁爃爄爇爌爗" \
   "犡獵獶璧璶璸璹璻璼璾璿瓀瓊瓋瓍甖疅癏癐癑癒癓癔癕癖癗癙癚癛癜癝癞癤皦皧皨皽盫盬" \
   "瞹瞺瞻瞼瞽瞾瞿矀矁矂矆矇矱礆礉礊礋礌礎礏礐礑礒礓礔礕礖礚礜礞礠礡禰禱禲穠穡穢穣" \
   "穥穫竄竅竆竵篽簙簚簛簜簝簞簟簠簡簢簣簤簥簦簨簩簪簭簮簯簰簱簲簶糣糤糥糦糧糨繎繏" \
   "繐繑繒繓織繕繖繗繘繙繚繛繜繝繞繟繠繢繣繥繦繧繨繭繸罇罈罉羂羃羳羴羵翷翸翹翺翻耭" \
   "耮聵聶職臍臎臏臐臑臓臗舙艞艟艠艥藕藖藘藙藚藛藜藝藞藟藠藢藣藤藥藦藧藨藩藪藫藭藯" \
   "藰藲藳藴藵藷藸虩蟔蟖蟗蟘蟙蟚蟛蟜蟟蟠蟡蟢蟣蟤蟦蟧蟨蟩蟪蟫蟬蟭蟮蟯蟱蟲蟳蟴蟵蟼蟽" \
   "蠂蠄蠆蠇襗襘襙襛襜襝襟襠襡襢覆覰覱覲観覷觴觵謣謤謥謦謪謫謬謭謮謯謰謱謲謳謴謵謶" \
   "謹謺謻謼謾譀譁譇豂豃豐豴豵貗貙賾賿贀贁贂贃贄趩趪蹔蹖蹗蹘蹙蹚蹛蹜蹝蹞蹟蹠蹡蹢蹣" \
   "蹤蹦蹧蹩躀躇躿軀軁轆轇轈轉轊轌辬邊邋邌鄨酀酂醥醦醧醩醪醫醬釐鎉鎊鎋鎌鎍鎎鎏鎐鎑" \
   "鎒鎓鎔鎕鎖鎗鎘鎙鎛鎜鎞鎟鎠鎢鎣鎤鎥鎦鎧鎨鎩鎫鎬鎭鎮鎰鎱鎲鎳鎴鎵鎶鎷鎸鎹鎻鎼鎽鎾" \
   "鎿鏈鏊鏌鏠鏵镬镭镮镯镰镱闐闑闒闓闔闕闖闗闘隴雗雙雛雜雝雞雟雠離霢霣霤霥霧霩靝鞢" \
   "鞣鞤鞥鞦鞧鞨鞩鞪鞫鞭鞮鞯鞰韖韗韘韙韚韞韹頾頿顋題額顎顏顐顑顒顓顔顕颢颣颸颹颺颼" \
   "颾餮餹餺餻餼餾饀饁饂饃饆饈馤馥馦馧騄騅騆騇騈騉騊騋騌騍騎騏騐騑騒験騝騧髂髃髄髅" \
   "髊髜鬃鬄鬅鬆鬈鬩鬵鬶鮵鮶鮷鮸鮹鮻鮼鮽鮾鮿鯀鯁鯂鯃鯄鯆鯇鯉鯊鯋鯌鯍鯏鯑鯒鯓鯽鳌鳍" \
   "鳎鳏鳐鳑鳒鵊鵋鵌鵍鵎鵏鵑鵒鵓鵔鵕鵖鵗鵘鵙鵚鵛鵜鵝鵞鵟鵠鵢鵣鵤鵥鹭鹮鹯鹰麌麍麎麏" \
   "麐麱麲黝黟黠黡鼀鼁鼂鼕鼖鼥鼦鼧鼨鼩鼪鼫鼬齀齁齌齕龎",


19:"儳儴劖勷勸厴嚥嚦嚧嚨嚩嚪嚫嚬嚭嚯嚰嚴壚壛壜壞壟壠壡壢夒夓嬹嬽嬾嬿孼孽寳寴寵屫巃" \
   "巄巅巆巌幰廬廭彟徿懯懲懶懷懻攀攇攈攉攊攋攌攍攎攏攐攑攒攚斄旜旝旟曝曟曡曢櫋櫌櫍" \
   "櫏櫐櫑櫓櫕櫖櫘櫜櫝櫞櫟櫠櫢櫤櫥櫦櫧櫫櫲櫵歠殰殱氌濳瀕瀖瀗瀘瀙瀚瀛瀜瀝瀟瀠瀢瀣瀤" \
   "瀥瀧瀨瀩瀫瀬瀭瀮瀯瀳爂爅爆爈爉爊爍爎爑爕牘犢犣犤犥犦獸獹獺璷璺璽瓃瓄瓅瓆瓇瓈瓉" \
   "瓣疆疇癟癠癡癢癣皩矃矄矅矈矉矊矋矌矎礗礘礙礛礝礟礢礣礤礦礪穤穦穧穨穩穪穬簫簬簳" \
   "簴簵簷簸簹簺簼簽簾簿籀籁籂籅籆籈糩糪糫糬糭繡繩繪繫繬繮繯繰繱繲繳繴繵繶繷繹繺繾" \
   "纄缵罊罋羄羅羆羶羷羸羹翽翾耯聸聼臋臔臕臘舋舚艡艢艣艤艧艨艶藮藶藹藺藻藼藽藾藿蘀" \
   "蘁蘂蘃蘄蘅蘆蘇蘈蘉蘊蘋蘍蘎蘏蘐蘑蘒蘓蘔蘕蘟蘢蘣蘧蟕蟰蟶蟷蟸蟹蟺蟻蟾蟿蠀蠃蠅蠈蠉" \
   "蠊蠋蠌蠍蠏蠓蠖蠞襞襣襤襥襦襧襨襪覇覈覴覵覶覸觶觹謽謿譂譃譄譆譈證譊譋譌譎譏譐譑" \
   "譒譓譔譕譖譗識譙譚譛譜警譪谶豶豷貚贆贇贈贉贊贋贌贎趫趬趭蹨蹪蹫蹬蹭蹮蹯蹰蹱蹲蹳" \
   "蹴蹵蹶蹷蹸蹹蹺蹻蹼蹽蹾蹿躂躉軂軃軄軅轍轎轏轐轑轒轓轔轕辭辴邍酁酃酄醭醮醯醰醱鏀" \
   "鏁鏂鏃鏄鏅鏆鏇鏉鏋鏍鏎鏏鏐鏑鏒鏓鏔鏕鏖鏗鏘鏙鏚鏛鏜鏝鏞鏟鏡鏢鏣鏤鏥鏦鏧鏨鏩鏪鏫" \
   "鏬鏭鏮鏯鏰鏱鏲鐄鐆鐊鐌鐯鐹镲闙闚闛關闝闞隵雡難霦霨霪霫霬霭霳靡鞱鞲鞳鞴鞵鞶鞷鞸" \
   "鞹鞾韛韜韝韟韠韡韲韻韼顖顗願顙顚顛顜顝類颤颻颽颿飀饄饅饇饉騔騕騖騗騘騙騚騛騜騞" \
   "騟騠騡騢騣騤騥騦騨騩騭騰騲騷骥髆髇髈髉髋髌鬉鬊鬋鬌鬍鬎鬏鬷魐魑鯔鯕鯖鯗鯘鯙鯚鯛" \
   "鯜鯝鯞鯟鯠鯡鯢鯣鯤鯥鯦鯧鯨鯩鯪鯫鯬鯭鯮鯯鯰鯱鯲鯳鯴鯵鰎鳓鳔鳕鳖鳗鳘鳙鳚鳛鵡鵦鵧" \
   "鵨鵩鵪鵫鵬鵭鵮鵯鵰鵱鵲鵳鵴鵵鵶鵷鵸鵹鵺鵻鵼鵽鵾鵿鶀鶁鶂鶃鶄鶅鶆鶇鶈鶉鶊鶋鶌鶍鶎" \
   "鶏鶐鶑鶓鶜鶧鹱鹲鹸鹹麑麒麓麔麕麖麗麳麴黀黢黣黼鼃鼄鼗鼭鼮齍齖齗齘龏龐",
20:"儶兤匶匷嚱嚲嚳嚵嚶嚷嚸嚹嚼嚽嚾嚿壣壤壥壦孀孁孂孃孄孅孆孉孾寶巇巈巉巊巍巏幱廮廯" \
   "廰忀忁懸懹懺懽攓攔攕攖攗攘攙斅斆曣曤曥曦曧曨朧櫨櫩櫪櫬櫮櫯櫰櫱櫳櫴櫶櫸櫽櫿欂瀪" \
   "瀰瀱瀲瀴瀵瀶瀷瀸瀹瀺瀻瀼瀽瀾瀿灀灁灂灆灌爋爏爐爒爓爔爖爘犧犨獻獼獽獾瓌瓎瓏瓐瓑" \
   "瓒甗疈癥癦皪皫皾盭矍矏矒矲礥礧礨礩礫礬穭穮穯竇競竷籃籄籇籉籊籋籌籍籎籏籕糮糯糰" \
   "糲繻繼繽繿纀纁纂纃纊罌羺翿耀聹聺聻臖臙臚臛臜艦艩蘌蘖蘗蘘蘙蘚蘛蘜蘝蘞蘠蘡蘥蘦蘨" \
   "蘩蘪蘫蘭蘮蘯蘰蘳蘶蠐蠑蠒蠔蠕蠗蠘蠙蠚蠛蠣衊襩襫襬襭襮覹覺覻觷觸譍譝譞譟譠譡譢譣" \
   "譤譥譧譨譩譫譬譭譮譯議譱譲譴護譽豑賸贍趮躁躃躄躅躆躈軆轖轗轘轙轚轝辮酅酆醲醳醴" \
   "醵醶醷醸釋鏳鏶鏷鏸鏹鏺鏻鏼鏾鏿鐀鐁鐂鐃鐅鐇鐈鐉鐋鐍鐎鐏鐐鐑鐒鐓鐔鐕鐖鐗鐘鐙鐚鐛" \
   "鐜鐝鐞鐟鐠鐡鐢鐣鐤鐥鐦鐧鐨鐩鐫鐭鐷鐼镳镴镽闟闠闡闢闣闤闥闦闧霮霯霰霱霴霵鞺鞻韽" \
   "韾響顟顠顡顢顣颥飁飂飃飄饊饋饌饍饎饐饑饒饓饗饙馨騪騫騬騮騯騱騳騴騵騶騸驀驁驊骦" \
   "骧髍髎髏鬐鬑鬒鬓鬔鬪鬸魒魓魔魖鯶鯷鯸鯹鯺鯻鯼鯾鯿鰀鰁鰂鰃鰄鰅鰆鰇鰈鰉鰊鰋鰌鰍鰏" \
   "鰐鰑鰒鰓鰔鰕鰖鰗鰘鰙鰚鰛鰠鰦鰰鱀鳜鳝鳞鳟鶒鶔鶕鶖鶗鶘鶙鶚鶛鶝鶞鶟鶠鶡鶢鶣鶤鶥鶦" \
   "鶨鶩鶪鶫鶻鶿鷀鷌鹺麘麙麚麛麵黁黤黥黦黧黨黩黪鼍鼯鼰齙齚齛齝齞齟齠齡齣龑",
21:"儷儸儹儺儼劗劘卛嚻囀囁囂囃囄囆囈夔孇孈寷屬巋巐廱忂懼懾攛攜攝攡斕曩朇櫹櫺櫻櫼櫾" \
   "欀欁欃欄欅權欌欍歡殲灃灄灅灇灈灉灊灋灍灏灐灕爙爚爛爝爟爢爤犩瓓瓔瓖瓘疉癧癨癩癪" \
   "癫癮皬矐矑矓礭礮礯礰礱礲礳礴禳禴竈竉籐籑籒籓籔籖纅纆纇纈纉纋續纍纎纏纐罍羻羼耰" \
   "臝臟艪蘬蘲蘴蘵蘷蘺蠜蠝蠟蠠蠡蠢蠤蠩蠫襯襰襱覼覽觺觼譅譳譵譶譸譹譺譻譼讂贐贑贒贓" \
   "贔赣趯趰躊躋躌躍躎躏躑軇轛轜轞轟辯邎酇酈醹醺醻鏴鏽鐪鐬鐮鐰鐱鐲鐳鐴鐵鐶鐸鐺鐻鐽" \
   "鐾鐿鑀鑁鑉鑊鑓鑝雤露霶霷霸霹霺霻霿靀靧鞼鞽鞿韃韢顤顥顦顧顨颦飅飆飇飈飉飊飜饏饖" \
   "饘饚饛馩騹騺騻騼騽騾騿驂驃驄驅驇驉髐髒髓鬕鬖鬗鬘鬫鬹鬺魕鰜鰝鰞鰟鰡鰢鰣鰤鰥鰧鰨" \
   "鰩鰪鰫鰬鰭鰮鰯鰱鰲鰷鱁鱃鳠鳡鳢鳣鶬鶭鶮鶯鶰鶱鶲鶳鶴鶵鶶鶷鶸鶹鶺鶼鶽鶾鷁鷂鷃鷄鷅" \
   "鷆鷇鷈鷉鷊鷋鷍鷎鷏鷔鹻麜麝麶黫黬黭黮黯鼅鼙鼚鼛鼱齎齜齤齥齦齧齨齩龒龡",
22:"亹儻囅囇囉囊囋囌囎圝壧奱孊孋孌孍孿巎巑巒巓巔巕巖巗廲彎彲懿戂戵攞攟攠攢攤攦攧櫷" \
   "欆欇欈欉欋欎氍灑灒灔灖灗灘爜爞爠爡獿玀玁玂瓕瓗瓙瓤疊癬癭皭矔礵礶礷禵穰穱竊竸籗" \
   "籘籙籚籛籜籝籟籠籡籧糱糴糵纑纒罎罏羇耱耲聽聾臞艫蘱蘸蘹蘻蘼蘽蘾蘿虀虁蠥蠦蠧蠨蠪" \
   "蠬蠭蠴襲襳襴襶襷覾覿觻觽譾譿讀讁讃讄讅讆讎豄贕贖贗贘躐躒躓躔躕躖躗躚轠轡轢邏邐" \
   "鑂鑃鑄鑅鑆鑇鑈鑋鑌鑍鑎鑏鑐鑑鑒鑔鑖鑛鑧镵镶镾霼霽霾韀韁韂韄韣頀顩顪顫顭飋饔饕驆" \
   "驈驋驍驎驏驐驑驒驓驔驕驚髑體髝鬙鬚鬛鬜鬝鬻鰳鰴鰵鰶鰸鰹鰺鰻鰼鰽鰾鰿鱂鱄鱅鱆鱇鱈" \
   "鱉鱌鱑鱜鳤鷐鷑鷒鷓鷕鷖鷗鷘鷙鷚鷛鷜鷝鷞鷟鷠鷩鹳鹴麞麟黐黰黱鼘鼜鼲鼳鼴鼵齂齪齫齬" \
   "龓龔龕龢",
23:"儽劙劚囏囐囒壨奲孏巘巚彏戀戁戃戄攣攥攨攩攪攫曪曫曬曮欏欐欑欒欕毊灓灙灚灛灜灡玃" \
   "瓚癯癰禶禷籞籢籣籤籥籦籨纓纔纕纖罐臢艬虃虄虅虇蠮蠯蠰蠱蠳蠸襵襺襼覉觾讇讈讉變讋" \
   "讌讍讏讐讔豅贏贙贚趱躘躙躛躜躠轣轤醼鑕鑗鑘鑙鑚鑜鑞鑟鑠鑡鑢鑣鑤鑥鑦靁靆靨韅韈韤" \
   "顬顮顯颧饜馪驌驖驗驙驛驜髕髖髞鬞鬟鬠魗魘魙鱊鱋鱍鱎鱏鱒鱓鱔鱕鱖鱗鱘鱙鱚鱛鱝鷡鷢" \
   "鷣鷤鷥鷦鷧鷨鷪鷬鷭鷮鷯鷰鷱鷲鷳鷴鷵鷶鷷鷸鷻鷼鹼黂黲黳黴鼆鼇鼶鼷鼸鼹齃齄齏齭齮齯" \
   "齰齱龝",
24:"儾囍囑囓囕壩孎屭巙攬攭斖曭欓欔欗灝灞灟灠爣瓛瓥癱癲矕矖矗矙礸礹穲穳籩籪籬纗羈羉" \
   "艭艷虂虆虈虉蠲蠵蠶蠷蠹蠺衋衢襸襹襻觀讑讒讓讕讖貛贛贜躝躞躟躤軈醽醾醿釀釂鑨鑩鑪" \
   "鑫鑬鑮雥雦靂靃靄靅靇靈韆韇韥顰饝驝驞驟鬡鬢鬬鬭鱐鱞鱟鱠鱡鱢鱣鱤鱥鱦鱧鱩鱪鱫鱮鱯" \
   "鷫鷹鷺鷽鷾鷿鸀鸁鸂鸃鸄鸅鸆鸇鸈鸉鸊鸏鸒鹽麠黌鼞齅齆齲齳齴齵齶齷齹",
25:"囔壪廳彠戅戆攮斸曯欖欘欙欚欛欝灢灣爥爦犪矘矡籫籭籮糶纘纙纚纛臠臡蠻襽覊觿讗讘讙" \
   "讛豒躡躢躣躥鑭鑯鑰鑱鑲鑳鑵靉韉顱顲饞饟馕髗鬣鱨鱬鱭鱰鱴鱶鸋鸌鸍鸎鸐鸑麡黵鼈鼉鼝" \
   "鼟齇齸齺齻龣",
26:"圞欜氎灎灤灦癳矚籯籰糳糷虊虪蠼讚趲躦躧躪轥釁釃釄釅鑴鑶鑷鑸鑹鑺靊顴飌驠驡驢驣驥" \
   "鱱鱲鱳鱵鸓鸔黶鼊龤",
27:"灥灧灨犫纜纝虌蠽蠾蠿讜讝讞豓貜躩軉鑻鑼鑽鑾靋靌靍靎顳飍飝饠饡馫驤驦驧驩鬤鬮鬰鱷" \
   "鱸鸕鸖鸗黷齈",
28:"囖戇欞欟爧癴豔躨鑿钀钁钂钄雧驨鸘鸙鸚鸛麢黸鼺齼齽龞爨",
29:"纞虋讟钃靏韊驘驪鬱鱹鸜麷",
30:"厵癵籱饢驫鱺鸝鸞灩麣",
32:"灪籲龖",
33:"爩鱻麤龗",
35:"齾",
36:"齉", 
39:"靐", 
48:"龘" 
}

data_PingShuiYunBiao = {
"东":"上平1:东同童僮铜桐峒筒瞳中(中间)衷忠盅虫冲终忡崇嵩崧菘戎绒弓躬宫穹融雄熊穷冯风枫疯丰充隆窿空公功工攻蒙蒙朦瞢笼胧栊咙聋珑砻泷蓬篷洪荭红虹鸿丛翁嗡匆葱聪骢通棕烘崆",
"冬":"上平2:冬咚彤农侬宗淙锺钟龙茏舂松淞冲容榕蓉溶庸佣慵封胸凶匈汹雍邕痈浓脓重(重复)从(服从)逢缝峰锋丰蜂烽葑纵(纵横)踪茸蛩邛筇跫供(供给)蚣喁",
"江":"上平3:江缸窗邦降(降伏)双泷庞撞豇扛杠腔梆桩幢蛩(冬韵同)",
"支":"上平4:支枝肢移(竹移)为(施为)垂吹陂碑奇宜仪皮儿离施知驰池规危夷师姿迟龟眉悲之芝时诗棋旗辞词期祠基疑姬丝司葵医帷思滋持随痴维卮麋螭麾墀弥慈遗肌脂雌披嬉尸狸炊湄篱兹差(参差)疲茨卑亏蕤骑(跨马)歧岐谁斯澌私窥熙欺疵赀羁彝髭颐资糜饥衰锥姨夔祗涯(佳、麻韵同)伊追蓍缁萁箕椎罴篪萎匙脾坻嶷治(治国)骊綦怡尼漪牺饴而鸱推(灰韵同)陲魑锤缡璃羸帔蘼芪畸羲曦欹猗崎崖筛狮蛳绥虽粢瓷嫠痍惟唯机耆逵岿丕毗枇貔楣霉辎蚩嗤媸飔埘莳鲥鹚笞漓贻禧噫其琪祺麒栀鹂累踟琵祁骐訾咨睢馗胝鳍蛇(委蛇)陴淇丽(地名)厮氏(月氏)僖嘻琦怩熹孜罹磁痿隋逶郦嵋椅(音漪,木名)",
"微":"上平5:微薇晖辉徽挥韦围帏违闱霏菲(芳菲)妃飞非扉肥威祈畿机几(微也、如见几)讥玑稀希衣(衣服)依归饥(支韵同)矶欷诽绯晞葳巍沂圻颀",
"鱼":"上平6:鱼渔初书舒居裾琚车(麻韵同)渠蕖余予(我也)誉(动词)舆胥狙锄疏蔬梳虚嘘墟徐猪闾庐驴诸储除滁蜍如畲淤妤苴菹沮徂龉茹榈於祛蘧疽蛆醵纾樗躇(药韵同)欤据(拮据)",
"虞":"上平7:虞愚娱隅无芜巫于衢癯瞿氍儒襦濡须需朱珠株诛朱铢蛛殊俞瑜榆愉逾渝窬谀腴区躯驱岖趋扶符凫芙雏敷麸夫肤纡输枢厨俱驹模谟摹蒲逋胡湖瑚乎壶狐弧孤辜姑觚菰徒途涂荼图屠奴吾梧吴租卢鲈炉芦颅垆蚨孥帑苏酥乌污(污秽)枯粗都茱侏姝禺拘嵎蹰桴俘臾萸吁滹瓠糊醐呼沽酤泸舻轳鸬驽匍葡铺(铺盖)菟诬呜迂盂竽趺毋孺酴鸪骷刳蛄晡蒱葫呱蝴劬殂猢郛孚",
"齐":"上平8:齐黎犁梨妻(夫妻)萋凄堤低题提蹄啼鸡稽兮倪霓西栖犀嘶撕梯鼙赍迷泥溪蹊圭闺携畦嵇跻奚脐醯黧蠡醍鹈奎批砒睽荑篦齑藜猊蜺鲵羝",
"佳":"上平9:佳街鞋牌柴钗差(差使)崖涯(支麻韵同)偕阶皆谐骸排乖怀淮豺侪埋霾斋槐(灰韵同)睚崽楷秸揩挨俳",
"灰":"上平10:灰恢魁隈回徊槐(佳韵同)梅枚玫媒煤雷颓崔催摧堆陪杯醅嵬推(支韵同)诙裴培盔偎煨瑰茴追胚徘坯桅傀儡(贿韵同)莓开哀埃台苔抬该才材财裁栽哉来莱灾猜孩徕骀胎唉垓挨皑呆腮",
"真":"上平11:真因茵辛新薪晨辰臣人仁神亲申身宾滨槟缤邻鳞麟珍瞋尘陈春津秦频苹颦濒银垠筠巾囷民岷泯(轸韵同)珉贫莼淳醇纯唇伦轮沦抡匀旬巡驯钧均榛莘遵循甄宸纶椿鹑屯呻粼嶙辚磷呻伸绅寅姻荀询峋氤恂嫔彬皴娠闽纫湮肫逡菌臻豳",
"文":"上平12:文闻纹蚊云分(分离)氛纷芬焚坟群裙君军勤斤筋勋薰曛醺芸耘芹欣氲荤汶汾殷雯贲纭昕熏",
"元":"上平13:元原源沅鼋园袁猿垣烦蕃樊喧萱暄冤言轩藩媛援辕番繁翻幡璠鸳鹓蜿湲爰掀燔圈谖魂浑温孙门尊(樽)存敦墩炖暾蹲豚村屯囤(囤积)盆奔论(动词)昏痕根恩吞荪扪昆鲲坤仑婚阍髡馄喷狲饨臀跟瘟飧棔",
"寒":"上平14:寒韩翰(翰韵同)丹单安鞍难(艰难)餐檀坛滩弹残干肝竿阑栏澜兰看(翰韵同)刊丸完桓纨端湍酸团攒官观(观看)鸾銮峦冠(衣冠)欢宽盘蟠漫(大水貌)叹(翰韵同)邯郸摊玕拦珊狻鼾杆跚姗殚箪瘅谰獾倌棺剜潘拼(问韵同)盘般蹒瘢磐瞒谩馒鳗钻抟邗汗(可汗)",
"删":"上平15:删潸关弯湾还环鬟寰班斑蛮颜奸攀顽山闲艰间(中间)悭患(谏韵同)孱潺擐圜菅般(寒韵同)颁鬘疝讪斓娴鹇鳏殷(赤黑色)纶(纶巾)",

"先":"下平1:先前千阡笺天坚肩贤弦烟燕(地名)莲怜连田填巅鬈宣年颠牵妍研(研究)眠渊涓捐娟边编悬泉迁仙鲜(新鲜)钱煎然延筵毡旃蝉缠廛联篇偏绵全镌穿川缘鸢旋船涎鞭专圆员乾(乾坤)虔愆权拳椽传焉嫣鞯褰搴铅舷跹鹃筌痊诠悛先邅禅婵躔颛燃涟琏便(安也)翩骈癫阗钿(霰韵同)沿蜒胭芊鳊胼滇佃畋咽湮狷蠲蔫骞膻扇棉拴荃籼砖挛儇璇卷(曲也)扁(扁舟)单(单于)溅(溅溅)犍",
"萧":"下平2:萧箫挑貂刁凋雕迢条髫调(调和)蜩枭浇聊辽寥撩寮僚尧宵消霄绡销超朝潮嚣骄娇蕉焦椒饶硝烧(焚烧)遥徭摇谣瑶韶昭招镳瓢苗猫腰桥乔娆妖飘逍潇鸮骁祧鹪鹩缭獠嘹夭(夭夭)幺邀要(要求)姚樵谯憔标飚嫖漂(漂浮)剽佻龆苕岧噍哓跷侥了(明了)魈峣描钊轺桡铫鹞翘枵侨窑礁",
"肴":"下平3:肴巢交郊茅嘲钞包胶苞梢姣庖匏坳敲胞抛蛟崤鵁鞘抄蝥咆哮凹淆教(使也)跑艄捎爻咬铙茭炮(炮制)泡鲛刨抓",
"豪":"下平4:豪劳毫操(操持)髦绦刀萄猱褒桃糟旄袍挠(巧韵同)蒿涛皋号(号呼)陶鳌曹遭羔糕高搔毛艘滔骚韬缫膏牢醪逃濠壕饕洮淘叨啕篙熬遨翱嗷臊嗥尻鏖螯獒敖牦漕嘈槽掏唠涝捞痨芼",
"歌":"下平5:歌多罗河戈阿和(和平)波科柯陀娥蛾鹅萝荷(荷花)何过(经过)磨(琢磨)螺禾珂蓑婆坡呵哥轲沱鼍拖驼跎佗(他)颇(偏颇)峨俄摩么娑莎迦疴苛蹉嵯驮箩逻锣哪挪锅诃窠蝌髁倭涡窝讹陂鄱皤魔梭唆骡挼靴瘸搓哦瘥酡",
"麻":"下平6:麻花霞家茶华沙车(鱼韵同)牙蛇瓜斜邪芽嘉瑕纱鸦遮叉奢涯(支佳韵同)巴耶嗟遐加笳赊槎差(差错)蟆骅虾葭袈裟砂衙呀琶耙芭杷笆疤爬葩些(少也)佘鲨查楂渣爹挝咤拿椰珈跏枷迦痂茄桠丫哑划哗夸胯抓洼呱",
"阳":"下平7:阳杨扬香乡光昌堂章张王房芳长塘妆常凉霜藏场央泱鸯秧嫱床方浆觞梁娘庄黄仓皇装殇襄骧相湘箱缃创忘芒望尝偿樯枪坊囊郎唐狂强肠康冈苍匡荒遑行妨棠翔良航倡伥羌庆姜僵缰疆粮穰将墙桑刚祥详洋徉佯粱量羊伤汤鲂樟彰漳璋猖商防筐煌隍凰蝗惶璜廊浪当裆珰沧纲亢吭潢钢丧盲簧忙茫傍汪臧琅当庠裳昂障糖疡锵杭邙赃滂禳攘瓤抢螳踉眶炀阊彭蒋亡殃蔷镶孀搪彷胱磅膀螃",
"庚":"下平8:庚更(更改)羹盲横(纵横)觥彭亨英烹平枰京惊荆明盟鸣荣莹兵兄卿生甥笙牲擎鲸迎行(行走)衡耕萌甍宏闳茎罂莺樱泓橙争筝清情晴精睛菁晶旌盈楹瀛嬴赢营婴缨贞成盛(盛受)城诚呈程酲声征正(正月)轻名令(使令)并(并州)倾萦琼峥嵘撑粳坑铿撄鹦黥蘅澎膨棚浜坪苹钲伧檠嘤轰铮狰宁狞瞪绷怦璎砰氓鲭侦柽蛏茔赪茕赓黉瞠",
"青":"下平9:青经泾形陉亭庭廷霆蜓停丁仃馨星腥醒(醉醒)惺俜灵龄玲铃伶零听(径韵同)冥溟铭瓶屏萍荧萤荣扃垧蜻硎苓聆瓴翎娉婷宁暝瞑螟猩钉疔叮厅町泠棂囹羚蛉咛型邢",
"蒸":"下平10:蒸烝承丞惩澄陵凌绫菱冰膺鹰应(应当)蝇绳升缯凭乘(驾乘,动词)胜(胜任)兴(兴起)仍兢矜征(征求)称(称赞)登灯僧憎增曾矰层能朋鹏肱薨腾藤恒罾崩滕誊崚嶒姮塍冯症簦瞢凝(径韵同)棱楞",
"尤":"下平11:尤邮优尤流旒留骝榴刘由油游猷悠攸牛修羞秋周州洲舟酬雠柔俦畴筹稠丘邱抽瘳遒收鸠搜驺愁休囚求裘仇浮谋牟眸侔矛侯喉猴讴鸥楼陬偷头投钩沟幽纠啾楸蚯踌绸惆勾娄琉疣犹邹兜呦咻貅球蜉蝣辀帱阄瘤硫浏庥湫泅酋瓯啁飕鍪篌抠篝诌骰偻沤(水泡,名词)蝼髅搂欧彪掊虬揉蹂抔不(与有韵‘否’通)瓿缪(绸缪)",
"侵":"下平12:侵寻浔临林霖针箴斟沈心琴禽擒衾钦吟今襟(衿)金音阴岑簪(覃韵同)壬任(负荷)歆森禁(力所胜任)祲喑琛涔骎参(参差)忱淋妊掺参(人参)椹郴芩檎琳蟫愔喑黔嵚",
"覃":"下平13:覃潭参(参考)骖南楠男谙庵含涵函(包函)岚蚕探贪耽眈龛堪谈甘三酣柑惭蓝担簪(侵韵同)谭昙坛婪戡颔痰篮褴蚶憨泔聃邯蟫(侵韵同)",
"盐":"下平14:盐檐廉帘嫌严占(占卜)髯谦奁纤签瞻蟾炎添兼缣沾尖潜阎镰黏淹钳甜恬拈砭詹蒹歼黔钤佥觇崦渐鹣腌襜阉",
"咸":"下平15:咸函(书函)缄岩谗衔帆衫杉监(监察)凡馋芟搀喃嵌掺巉",

"董":"上声1:董懂动孔总笼(东韵同)拢桶捅蓊蠓汞",
"仲":"上声2:肿种(种子)踵宠垅(陇)拥冗重(轻重)冢捧勇甬踊涌俑蛹恐拱竦悚耸巩怂奉",
"讲":"上声3:讲港棒蚌项耩",
"纸":"上声4:纸只咫是靡彼毁委诡髓累技绮觜此泚蕊徙尔弭婢侈弛豕紫旨指视美否(否泰)痞兕几姊比水轨止徴市喜已纪跪妓蚁鄙晷子仔梓矢雉死履垒癸趾址以已似耜祀史驶耳使(使令)里理李起杞圯跂士仕俟始齿矣耻麂枳峙鲤迩氏玺巳(辰巳)滓苡倚匕迤逦旖旎舣蚍秕芷拟你企诔捶屣棰揣豸祉恃",
"尾":"上声5:尾苇鬼岂卉几(几多)伟斐菲(菲薄)匪篚娓悱榧韪炜虺玮虮",
"语":"上声6:语(语言)圉圄吕侣旅杼伫与(给予)予(赐予)渚煮暑鼠汝茹(食也)黍杵处(居住、处理)贮女许拒炬距所楚础阻俎沮叙绪序屿墅巨去(除也)苣举讵溆浒钜醑咀诅苎抒楮",
"雨":"上声7:麌雨宇舞府鼓虎古股贾(商贾)估土吐圃庾户树(种植,动词)煦诩努辅组乳弩补鲁橹睹腐数(动词)簿竖普侮斧聚午伍釜缕部柱矩武五苦取抚浦主杜坞祖愈堵扈父甫禹羽怒(遇韵同)腑拊俯罟赌卤姥鹉拄莽(养韵同)栩窭脯妩庑否(是否)麈褛篓偻酤牡谱怙肚踽虏孥诂瞽羖祜沪雇仵缶母某亩蛊琥",
"荠":"上声8:荠礼体米启陛洗邸底抵弟坻柢涕悌济(水名)澧醴诋眯娣棨递昵睨蠡",
"蟹":"上声9:蟹解洒楷(佳韵同)拐矮摆买骇",
"贿":"上声10:贿悔罪馁每块汇猥璀磊蕾傀儡腿海改采彩在宰醢铠恺待殆怠乃载(岁也)凯闿倍蓓迨亥",
"轸":"上声11:轸敏允引尹尽忍准隼笋盾(阮韵同)闵悯菌(真韵同)蚓牝殒紧蠢陨哂诊疹赈肾蜃膑黾泯窘吮缜",
"吻":"上声12:吻粉蕴愤隐谨近忿抆刎揾槿瑾恽韫",
"阮":"上声13:阮远(远近)晚苑返反饭(动词)偃蹇琬沅宛婉畹菀蜿绻巘挽堰混棍阃悃捆衮滚鲧稳本畚笨损忖囤遁很沌恳垦龈",
"旱":"上声14:旱暖管琯满短馆(翰韵同)缓盥(翰韵同)碗懒伞伴卵散(散布)伴诞罕瀚(浣)断(断绝)侃算(动词)款但坦袒纂缎拌懑谰莞",
"潸":"上声15:潸眼简版板阪盏产限绾柬拣撰馔赧皖汕铲羼见楝栈",
"铣":"上声16:铣善(善恶)遣(遣送)浅典转(霰韵同)衍犬选冕辇免展茧辨篆勉剪卷显饯(霰韵同)践喘藓软蹇(阮韵同)演兖件腆跣缅缱鲜(少也)殄扁匾蚬岘畎燹隽键变泫癣阐颤膳鳝舛娩辗邅先韵同)脔辫捻",
"小":"上声17:筱小表鸟了(未了,了得)晓少(多少)扰绕绍杪沼眇矫皎杳窈窕袅挑(挑拨)掉(啸韵同)肇缥缈渺淼茑赵兆缴缭(萧韵同)夭(夭折)悄舀侥蓼娆硗剿晁藐秒殍了(了望)",
"巧":"上声18:巧饱卯狡爪鲍挠(豪韵同)搅绞拗咬炒吵佼姣(肴韵同)昴茆獠(萧韵同)",
"皓":"上声19:皓宝藻早枣老好(好丑)道稻造(造作)脑恼岛倒(跌到)祷(号韵同)捣抱讨考燥扫(号韵同)嫂保鸨稿草昊浩镐杲缟槁堡皂瑙媪燠袄懊葆褓芼澡套涝蚤拷栲",
"哿":"上声20:哿火舸亸舵我拖娜荷(负荷)可左果裹朵锁琐堕惰妥坐(坐立)裸跛颇(稍也)夥颗祸桠婀逻卵那坷爹(麻韵同)簸叵垛哆硪么(歌韵同)峨(歌韵同)",
"马":"上声21:马下(上下)者野雅瓦寡社写泻夏(华夏)也把厦惹冶贾(姓贾)假(真假)且玛姐舍喏赭洒嘏剐打耍那",
"养":"上声22:养痒象像橡仰朗桨奖蒋敞氅厂枉往颡强(勉强)惘两曩丈杖仗(漾韵同)响掌党想鲞榜爽广享向飨幌莽纺长(长幼)网荡上(上升)壤赏仿罔谠倘魍魉谎蟒漭嗓盎恍脏(肮脏)吭沆慷襁镪抢肮犷",
"梗":"上声23:梗影景井岭领境警请饼永骋逞颖颍顷整静省幸颈郢猛丙炳杏秉耿矿冷靖哽绠荇艋蜢皿儆悻婧阱狰(庚韵同)靓惺打瘿并(合并)犷眚憬鲠",
"迥":"上声24:迥炯茗挺艇梃醒(青韵同)酩酊并(并行,并且)等鼎顶肯拯謦刭溟",
"有":"上声25:有酒首口母(麌韵同)妇(麌韵同)後柳友斗狗久负(麌韵同)厚手叟守否(麌韵同)右受牖偶走阜(麌韵同)九后咎薮吼帚垢舅纽藕朽臼肘韭亩(麌韵同)剖诱牡(麌韵同)缶酉苟丑糗扣叩某莠寿绶玖授蹂(尤韵同)揉(尤韵同)溲纣钮扭呕殴纠耦掊瓿拇姆擞绺抖陡蚪篓黝赳取麌韵同)",
"寝":"上声26:寝饮(饮食)锦品枕(枕衾)审甚(沁韵同)廪衽稔凛懔沈(姓氏)朕荏婶沈(沈阳)葚禀噤谂怎恁饪覃",
"感":"上声27:感览揽胆澹(淡,勘韵同)啖坎惨敢颔(覃韵同)撼毯糁湛菡萏罱椠喊嵌(咸韵同)橄榄",
"琰":"上声28:俭焰敛(艳韵同)险检脸染掩点簟贬冉苒陕谄俨闪剡忝(艳韵同)琰奄歉芡崭堑渐(盐韵同)罨捡弇崦玷",
"槛":"上声29:豏槛范减舰犯湛巉(咸韵同)斩黯范",

"送":"去声1:送梦凤洞众瓮贡弄冻痛栋恸仲中(击中)粽讽空(空缺)控哄赣",
"宋":"去声2:宋用颂诵统纵(放纵)讼种(种植)综俸供(供设，名词)从(仆从)缝(隙也)重(再也)共",
"绛":"去声3:绛降(升降)巷撞(江韵同)戆",
"置":"去声4:寘置事地意志思(名词)泪吏赐自字义利器位戏至次累(连累)伪寺瑞智记异致备肆翠骑(车骑,名词)使(使者)试类弃饵媚鼻易(容易)辔坠醉议翅避笥帜炽粹莳谊帅厕寄睡忌贰萃穗二臂嗣吹(鼓吹,名词)遂恣四骥季刺驷寐魅积(积蓄)被懿觊冀愧匮恚馈蒉篑柜暨庇豉莉腻秘比(近也)鸷毖啻示嗜饲伺遗(馈遗)薏祟值惴屣眦詈企渍譬跛挚燧隧悴尿稚雉莅悸肄泌识(记也)侍踬为(因为)",
"未":"去声5:未味气贵费沸尉畏慰蔚魏纬胃汇(字汇)谓渭卉(尾韵同)讳毅既衣(着衣,动词)蜚溉(队韵同)翡诽",
"御":"去声6:御处(处所)去虑誉(名词)署据驭曙助絮著(显著)箸豫恕与(参与)遽疏(书疏)庶预语(告也)踞倨蓣淤锯觑狙(鱼韵同)翥薯",
"遇":"去声7:遇路辂赂露鹭树(树木)度(制度)渡赋布步固素具务雾鹜数(数量)怒(麌韵同)附兔故顾句墓慕暮募注住注驻炷祚裕误悟寤戍库护屦诉妒惧趣娶铸绔傅付谕喻妪芋捕哺互孺寓赴冱吐(麌韵同)污(动词)恶(憎恶)晤煦酤讣仆(偃仆)赙驸婺锢蛀飓怖铺(店铺)塑愫蠹溯镀璐雇瓠迕妇负阜副富(宥韵同)醋措",
"霁":"去声8:霁制计势世丽岁济(渡也)第艺惠慧币弟滞际涕(荠韵同)厉契(契约)敝弊毙帝蔽髻锐戾裔袂系祭卫隶闭逝缀翳替细桂税婿例誓筮蕙诣砺励瘗噬继脆睿毳曳蒂睇妻(以女妻人)递逮蓟蚋薜荔唳捩粝泥(拘泥)媲嬖彗睥睨剂嚏谛缔剃屉悌俪锲贳掣羿棣蟪剃娣说(游说)赘憩鳜彘呓谜挤",
"泰":"去声9:泰太带外盖大(个韵同)濑赖籁蔡害蔼艾丐奈柰汰癞霭会旆最贝沛霈绘脍荟狈侩桧蜕酹外兑",
"卦":"去声10:卦挂画(图画)懈廨邂隘卖派债怪坏诫戒界介芥械薤拜快迈败稗晒瀣湃寨疥届蒯篑蒉喟聩块惫",
"队":"去声11:队内辈佩退碎背秽对废悔诲晦昧配妹喙溃吠肺耒块碓刈悖焙淬敦(盘敦)塞(边塞)爱代载(载运)态菜碍戴贷黛概岱溉慨耐在(所在)鼐玳再袋逮埭赉赛忾暧咳嗳睐",
"震":"去声12:震信印进润阵镇刃顺慎鬓晋骏闰峻衅振俊舜赆吝烬讯仞迅汛趁衬仅觐蔺浚赈(轸韵同)龀认殡摈缙躏廑谆瞬韧浚殉馑",
"问":"去声13:问闻(名誉)运晕韵训粪忿(吻韵同)酝郡分(名分)紊愠近(动词)抆拼奋郓捃靳",
"愿":"去声14:愿怨万饭(名词)献健建宪劝蔓券远(动词)侃键贩畈曼挽(挽联)瑗媛圈(猪圈)论(名词)恨寸困顿遁(阮韵同)钝闷逊嫩溷诨巽褪喷(元韵同)艮揾",
"翰":"去声15:翰(寒韵同)瀚岸汉难(灾难)断(决断)乱叹(寒韵同)观(楼观)干(树干,干练)散(解散)旦算(名词)玩烂贯半案按炭汗赞漫(寒韵同。又副词，独用)冠(冠军)灌爨窜幔粲灿璨换焕唤涣悍弹(名词)惮段看(寒韵同)判叛绊鹳伴畔锻腕惋馆旰捍疸但罐盥婉缎缦侃蒜钻谰",
"谏":"去声16:谏雁患涧间(间隔)宦晏慢盼篆栈(潸韵同)惯串绽幻瓣苋办谩讪(删韵同)铲绾孪篡裥扮",
"霰":"去声17:霰殿面县变箭战扇煽膳传(传记)见砚院练链燕宴贱馔荐绢彦掾便(便利)眷倦羡奠遍恋啭眩钏倩卞汴片禅(封禅)谴溅饯善(动词)转(以力转动)卷(书卷)甸电咽茜单念(念书)眄淀靛佃钿(先韵同)镟漩拣缮现狷炫绚绽线煎选旋颤擅缘(衣饰)撰唁谚媛忭弁援研(磨研)",
"啸":"去声18:啸笑照庙窍妙诏召邵要(重要)曜耀调(音调)钓吊叫眺少(老少)诮料疗潦掉(筱韵同)峤徼跳嘹漂镣廖尿肖鞘悄(筱韵同)峭哨俏醮燎(筱韵同)鹩鹞轿骠票铫(萧韵同)",
"效":"去声19:效教(教训)貌校孝闹豹罩棹觉(寤也)较窖爆炮(枪炮)泡(肴韵同)刨(肴韵同)稍钞(肴韵同)拗敲(肴韵同)淖",
"号":"去声20:号(号令)帽报导操(操行)盗噪灶奥告(告诉)诰到蹈傲暴(强暴)好(爱好)劳(慰劳)躁造(造就)冒悼倒(颠倒)燥犒靠懊瑁燠(皓韵同)耄糙套(皓韵同)纛(沃韵同)潦耗",
"个":"去声21:个贺佐大(泰韵同)饿过(歌韵同。又过失,独用)座和(唱和)挫课唾播破卧货簸轲(轗轲)驮髁(歌韵同)磋作做剁磨(磨磐)懦糯缚锉挼些(楚些)",
"驾":"去声22:祃驾夜下(降也)谢榭罢夏(春夏)霸暇灞嫁赦籍(凭籍)假(休假)蔗化舍(庐舍)价射骂稼架诈亚麝怕借卸帕坝靶鹧贳炙嗄乍咤诧侘(罅吓娅哑讶迓华(姓华)桦话胯(遇韵同)跨衩柘",
"漾":"去声23:漾上(上下)望(阳韵同)相(卿相)将(将帅)状帐唱让浪(波浪)酿旷壮放向忘仗(养韵同)畅量(数量)葬匠障瘴谤尚涨饷样藏(库藏)舫访贶嶂当(适当)抗桁妄怆宕怅创酱况亮傍(依傍)丧(丧失)恙谅胀鬯脏(内脏)吭砀伉圹纩桄挡旺炕亢(高亢)阆防",
"敬":"去声24:敬命正(正直)令(命令)证性政镜盛(茂盛)行(学行)圣咏姓庆映病柄劲竞靓净竟孟诤更(更加)并(梗韵同)聘硬炳泳迸横(蛮横)摒阱檠迎郑獍",
"径":"去声25:径定听胜(胜败)罄磬应(答应)赠乘(名词)佞邓证秤称(相称)莹(庚韵同)孕兴(兴趣)剩凭(蒸韵同)迳甑宁胫暝(夜也)钉(动词)订饤锭謦泞瞪蹭蹬亘(亘古)镫(鞍镫)滢凳磴泾",
"宥":"去声26:宥候就售(尤韵同)寿(有韵同)秀绣宿(星宿)奏兽漏富(遇韵同)陋狩昼寇茂旧胄宙袖岫柚覆复(又也)救厩臭佑右囿豆饾窦瘦漱咒究疚谬皱逅嗅遘溜镂逗透骤又侑幼读(句读)堠仆副(遇韵同)锈鹫绉咮灸籀酎诟蔻僦构扣购彀戊懋贸袤嗽凑鼬甃沤(动词)",
"沁":"去声27:沁饮(使饮)禁(禁令)任(信任)荫浸谮谶枕(动词)噤甚(寝韵同)鸩赁喑渗窨妊",
"勘":"去声28:勘暗滥啖担憾暂三(再三)绀憨澹(咸韵同)瞰淡缆",
"艳":"去声29:艳剑念验堑赡店占(占据)敛(聚敛)厌焰(俭韵同)垫欠僭酽潋滟俺砭坫",
"陷":"去声30:陷鉴泛梵忏赚蘸嵌站馅",

"屋":"入声1:屋木竹目服福禄谷熟肉族鹿漉腹菊陆轴逐苜蓿宿(住宿)牧伏夙读(读书)犊渎牍椟黩毂复(恢复)粥肃碌骕鬻育六缩哭幅斛戮仆畜蓄叔淑倏独卜馥沐速祝麓辘镞蹙筑穆睦秃縠覆辐瀑郁(忧郁,郁郁葱葱)舳掬踘蹴跼茯袱鵩鹆髑槲扑匐簌蔟煜复(复杂)蝠菔孰塾矗竺曝鞠嗾谡簏国(职韵同)副",
"沃":"入声2:沃俗玉足曲粟烛属录辱狱绿毒局欲束鹄蜀促触续浴酷躅褥旭笃督赎渌纛碡北(职韵同)瞩嘱勖溽缛梏",#欲笃督赎渌
"觉":"入声3:觉(知觉)角桷榷岳乐(音乐)捉朔数(频数)卓啄琢剥驳雹璞朴壳确浊擢濯渥幄握学龌龊槊搦镯喔邈荦",
"质":"入声4:质日笔出室实疾术一乙壹吉秩率律逸佚失漆栗毕恤密蜜桔溢瑟膝匹述黜弼跸七叱卒(终也)虱悉戌嫉帅(动词)蒺侄踬怵蟋筚篥必泌荜秫栉唧帙溧谧昵轶聿诘耋垤捽茁觱鹬窒苾",
"物":"入声5:物佛拂屈郁(馥郁,郁郁乎文哉)乞掘(月韵同)吃(口吃)讫绂弗勿迄不怫绋沸茀厥倔黻崛尉蔚契屹熨(未韵同)绂",
"月":"入声6:月骨发阙越谒没伐罚卒(士卒)竭窟笏钺歇突忽袜曰阀筏鹘(黠韵同)厥(物韵同)蹶蕨殁橛掘(物韵同)核蝎勃渤悖(队韵同)孛揭(屑韵同)碣粤樾鳜脖饽鹁捽(质韵同)猝惚兀讷(呐)羯凸咄(曷韵同)矻",
"曷":"入声7:曷达末阔钵脱夺褐割沫拔(挺拔)葛闼渴拨豁括抹遏挞跋撮泼秣掇(屑韵同)聒獭(黠韵同)刺喝磕蘖瘌袜活鸹斡怛钹捋",
"黠":"入声8:黠拔(拔擢)八察杀刹轧戛瞎刮刷滑辖铩猾捌叭札扎帕茁鹘揠萨捺",
"屑":"入声9:屑节雪绝列烈结穴说血舌洁别缺裂热决铁灭折拙切悦辙诀泄锲咽(呜咽)轶噎彻澈哲鳖设啮劣玦截窃孽浙孑桔颉拮撷揭褐(曷韵同)缬碣(月韵同)挈抉亵薛拽(曳)爇冽瞥迭跌阅餮耋垤捏页阕觖谲鴂撇蹩篾楔惙辍啜缀撤绁杰桀涅霓蜺(齐,锡韵同)批(齐韵同)",
"药":"入声10:药薄恶(善恶)作乐(哀乐)落阁鹤爵弱约脚雀幕洛壑索郭错跃若酌托削铎凿箔鹊诺萼度(测度)橐钥龠瀹着著虐掠获(收获)泊搏藿嚼勺谑廓绰霍镬莫箨缚貉各略骆寞膜鄂博昨柝格拓轹铄烁灼疟蒻箬芍躇却噱矍攫醵踱魄酪络烙珞膊粕簿柞漠摸酢怍涸郝垩谔鳄噩锷颚缴扩椁陌(陌韵同)",
"陌":"入声11:陌石客白泽伯迹宅席策册碧籍(典籍)格役帛戟璧驿麦额柏魄积(积聚)脉夕液尺隙逆画(动词)百辟赤易(变易)革脊翮屐获(猎获)适索厄隔益窄核舄掷责坼惜癖僻掖腋释译峄择摘弈奕迫疫昔赫瘠谪亦硕貊跖鹡碛蹐只炙(动词)踯斥穸鬲骼舶珀吓磔拆喀蚱舴剧檗擘栅啧帻箦扼划蜴辟帼蝈刺嵴汐藉螫蓦摭襞虢哑(笑声)绎射(音亦)",
"锡":"入声12:锡壁历枥击绩绩笛敌滴镝檄激寂觌溺觅狄荻幂戚鹢涤的吃沥雳霹惕剔砾翟籴倜析晰淅蜥劈甓嫡轹栎阋菂踢迪皙裼逖蜺阒汨(汨罗江)",
"职":"入声13:职国德食(饮食)蚀色力翼墨极殛息熄直值得北黑侧贼饰刻则塞(闭塞)式轼域蜮殖植敕亟棘惑忒默织匿慝亿忆臆薏特勒肋幅仄昃稷识(知识)逼克即唧(质韵同)弋拭陟恻测翊洫啬穑鲫抑或匐(屋韵同)",
"缉":"入声14:缉辑戢立集邑急入泣湿习给十拾袭及级涩楫(叶韵同)粒汁蛰执笠隰汲吸絷挹浥悒岌熠葺什芨廿揖煜(屋韵同)歙笈(叶韵同)圾褶翕",
"合":"入声15:合塔答纳榻閤杂腊匝阖蛤衲沓鸽踏拓拉盍塌咂盒卅搭褡飒磕榼遢蹋蜡溘邋趿",
"叶":"入声16:叶帖贴牒接猎妾蝶叠箧惬涉鬣捷颊楫(缉韵同)聂摄慑镊蹑协侠荚挟铗浃睫厌靥蹀躞燮摺辄婕谍堞霎嗫喋碟鲽捻晔躐笈(缉韵同)",
"洽":"入声17:洽狭峡法甲业邺匣压鸭乏怯劫胁插锸押狎夹恰蛱硖掐剳袷眨胛呷歃闸霎(叶韵同)",
}

# data_YunBu2YinDiao = None

data_JuXingName={'平':'__', '仄':'**', '弯':'_*', '直':'*_',}
# data_JuXingMark=None#{'__':'平', '**':'仄', '_*':'弯', '*_':'直',}

data_JuXing = {'__':'__**_', '**':'@*__*', '_*':'@__**', '*_':'@**__',}
# data_JuXing7 = None#{'__':'@_@**__', '**':'@*@__**', '_*':'@_@*__*', '*_':'@*__**_',}

#           '平直仄平',   '弯直仄平',  '仄平弯直',   '直平弯直',   '平仄直弯',   '弯仄直弯',  '仄弯平仄',   '直弯平仄',   '弯仄平仄',   '弯仄弯仄')
data_ShiXing=('__*_**__', '_**_**__', '**___**_', '*____**_', '__***__*', '_****__*', '**_*__**', '*__*__**', '_***__**', '_***_***')


data_CiPai = {
"十六令":("单阙16字平韵:_^,@*__**_^,__*,@**__^",),
"梧桐影":("单阙20字仄韵:**_,__*^,_**__*_,__**__*^",),
"醉妆词":("单阙22字仄韵:*_*^,*_*^(叠上句后二),**__*^,*_*^(叠第二句),*_*^(叠第一句),**__*^",),
"捣练子":("单阙27字平韵:_**,*__^,@*__@*_^,@*@__**,@_@**__^",),
"潇湘神":("单阙27字平韵:_*_^,_*_^(叠),*_@**__^,***__**,___**__^",),
"忆江南":("单阙27字平韵:_@*,@**__^,@*@__**,@_@**__^,@**__^",),
"渔父": ("单阙27字平韵:@*__**_^,@_@**__^,_**,*__^,@_@**__^",),
"阳关曲":("单阙28字平韵:*__*___^,_*__**_^,*_***__,_*___*_^",),
"采莲子":("单阙28字平韵:_*__**_^,@__**__^,*_**__*,**__**_^",),
"九张机":("单阙30字变韵:@__^,@_***__^,@_@*__*^,__@*,__@*,_**__^",),
"江南春":("单阙30字平韵:_**,*__^,___**,***__^,@_@*__*,@*__@*_^",),
"南乡子":("单阙30字变韵:_**,*__^,@_@**__^,@*@__**^,__*^,@*@__**^",
         "双调56字平韵:@**__^,@*__@*_^,@*@__**,__^,@*__@*_^;@**__^,@*__@*_^,@*@__**,__^,@*__@*_^",),
"忆王孙":("单阙31字平韵:@_@**__^,@*__@*_^,@*__@*_^,*__^,@*__@*_^",
         "双调54字仄韵:_*@__**^,_**,___*^,@__**__,@_*,__*^;_*@__**^,_**,___*^,@__**__,@_*,__*^",),
"蕃女怨":("单阙31字仄韵:*__*_**^,**_*^,*__,_**^,*__*^,*__**_*^,*_*^",),
"调笑令":("单阙32字变韵:_*,_*(叠),@@@_@*^,@@@*@_^,@*@_*_^,_*^,_*^(叠),@*@_@*^",),
"如梦令":("单阙33字仄韵:@*@__*^,@*@__*^,@**__,@*@__*^,_*^,_*^(叠),@*@__*^",),
"风流子":("单阙34字仄韵:_*@_@*^,@*@_@*^,_**,*__,@*@_@*^,_*^,_*^,@*@__*^",
         "双调109字平韵:**_**,__*,***__^,*____,**_*,*___*__^,*_*,___**,_**__^,_**_,___*,*__*,_*__^;*__*_^,__***,**__^,_**___,_*__^,*__**,__**,*__*,**__^,@*@_@*,_*__^",),
"归国谣":("双调34字仄韵:_**^,@*@__**^,@_@*__*^;@@@@_@*^,__*^,@_@*__*^",),
"定西番":("双调35字变韵:@*@_@*^,_**,*__^,*__^;@*@_@*,@_@*_^,@*@_@*,**_^",),
"长相思":("双调36字平韵:@@_^,*@_^(叠),@*__@*_^,@_@*_^;@@_^,*@_^(叠),@*__@*_^,@_@*_^",),
"相见欢":("双调36字变韵:@_@*__^,*__^,@*@__**__^;@@*^,@_*^,*__^,@*@__**__^",),
"醉太平":("双调38字平韵:__*_^,__*_^,@_@*__^,*__*_^;@_*_^,@_*_^,@_@*__^,*@_*_^",),
"长命女":("双调39字仄韵:_**^,**____*^,**__*^;@*@_@*^,@*@_@*^,_*@__**^,**__*^",),
"生查子":("双调40字仄韵:@_@*_,@*__*^,@**__,@*__*^;@_@*_,@*__*^,@**__,@*__*^",),
"抛球乐":("单阙40字平韵:**__**_^,*__**__^,___*__*,_*___*_^,**__*,_*__*__^",),
"醉公子":("双调40字仄韵:_**_*^,_*__*^,***__,___**^;__*_*^,**__*^,*___*,_*_**^",),
"杨柳枝":("双调40字变韵:@*__**_^,*__^,@*__**_^,*__^;**___**^,_**^,__***__^,*__^",),
"昭君怨":("双调40字变韵:@*@_@*^,@*@_@*^,@**__^,*__^;@*@_@*^,@*@_@*^,@**__^,*__^",),
"蝴蝶儿":("双调40字变韵:___,*__^,___**__^,*__*_^;_*__*,__**_^,___*__*^,**_*_^",),
"点绛唇":("双调41字仄韵:@*__,@_@*__*^,@_@*^,@*__*^;@*__,@*__*^,__*^,@_@*^,@*__*^",),
"春光好":("单阙41字平韵:_**,*__^,*__^,_*___*_^,*__^,_*___*,__***_^,_*___**,*__^",),
"浣溪沙":("双调42字平韵:@*__@*_^,@_@**__^,@_@**__^;@*@__**,@_@**__^,@_@**__^",),
"关河令":("双调43字仄韵:_**__**^,**__*^,*_*_,___**^;___***^,***___*^,**_*,___**^",),
"霜天晓角":("双调43字仄韵:@_@*^,@*__*^,@*@__*,_@*,@_*^;@__**^,@__**^,@*@_@*,@@*,@_*^",),
"采桑子":("双调44字平韵:@_@*__*,@*__^,@*__^,@*__@*_^;@_@*__*,@*__^,@*__^,@*__@*_^",),
"巫山一段云":("双调44字平韵:@*__*,__@*_^,@_@**__^,@**__^;@*__*,__@*_^,@_@**__^,@**__^",),
"菩萨蛮":("双调44字变韵:@_@*__*^,@_@*__*^,@**__^,@_@*_^;@__**^,@*__*^,@**__^,@_@*_^",),
"卜算子":("双调44字仄韵:@**__,@*__*^,@*__**_,@*__*^;@**__,@*__*^,@*__**_,@*__*^",
         "双调46字仄韵:@**__,@*__*^,@*__**_,@_*,__*^;@**__,@*__*^,@*__**_,@_*,__*^",),
"诉衷情":("双调44字平韵:@_@**__^,@**__^,@_@*_*,@**__^;_**,*__^,*__^,@__*,@*__,@*__^",
         "双调45字平韵:@_@**__^,@**__^,@_@*_*,@**,*__^;_**,*__^,*__^,@__*,@*__,@*__^",),
"减木兰花":("双调44字变韵:@_@*^,@*@__**^,@*__^,@*__@*_^;@_@*^,@*@__**^,@*__^,@*__@*_^",),
"天门谣":("双调45字仄韵:_*__*^,*_*,___*^,__*^,*___*^;***___**^,**____*^,_**^,***,__**^",),
"好事近":("双调45字仄韵:@**__,@**__*^,@*@__*,*@__*^;@_@**__,@@*_*^,@*@__*,*@_@*^",),
"谒金门":("双调45字仄韵:_@*^,@**__*^,@*@__**^,@__**^;@*@_@*^,@*@__*^,@*@__**^,@__**^",),
"一落索":("双调46字仄韵:***___,*__*^,*_*_*__,****_*^;***___,___*^,**_**__,__*__*^",),
"清平乐":("双调46字变韵:@_@*^,@*__*^,@*@__**^,@*@_@*^;@_@*__^,@_@*__^,@*@_@*,@_@*__^",),
"更漏子":("双调46字变韵:@@_,@@*^,@*@__*^,@**,*__^,@_@*_^;_@*^,@_*^,@*@_@*^,@**,*__^,@_@*_^",),
"荆州亭":("双调46字仄韵:_*@_@*^,@*@_@*^,@**__,@*@_@*^;@*@_@*^,**@_@*^,@**__,@*@_@*^",),
"忆秦娥":("双调46字仄韵:_@*^,@_@*__*^,__*^(叠),@_@*,@__*^;@_@*__*^,@_@*__*^,__*^(叠),@_@*,@__*^",),
"画堂春":("双调47字平韵:__@**__^,@_@*__^,@_@**__^,@*__^;@*@_**,@_@*__^,@_@**__,@*__^",
         "双调49字平韵:__@**__^,@_@*__^,@_@**__^,@**__^;@*__**,@_@*__^,@_@**__,@**__^",),
"忆少年":("双调47字仄韵:__**,__**,___*^,__***,*___*^;*_*___*_,*__,*__*^,__*_*,*__**^",),
"乌夜啼":("双调47字平韵:**__*,@_**__^,@_@*__*,@**__^;@*@_@*,@_**__^,@_@*__*,@**__^",
         "双调48字变韵:@*@_@*,@_**__^,@_@*__*,@**__^;@*@_@*,@_**__^@_@*__*,@**__^",),
"阮郎归":("双调47字平韵:@_@**__^,@_@*_^,@_@**__^,@_@*_^;_**,*__^,@_@*_^,@_@**__^,@_@*_^",),
"喜迁莺":("双调47字变韵:@@*,*__^,@**__^,@_@**__^,@**__^;@_*^,__*^,@*@__*^,@_@**__^,@**__^",),
"甘草子":("双调47字仄韵:_*^,**______*^,**___,**__*^;_*____*^,***___*^,**__*_*^,**__*^",),
"武陵春":("双调48字平韵:@*@__**,@**__^,@*__@*_,@**__^;@*@__**,@**__^,@*__@*_,@**__^",
        "双调49字平韵:@*@__**,@**__^,@*__@*_,@**__^;@*@__**,@**__^,@*__@*_,@@*,*__^",),
"人月圆":("双调48字平韵:@_@*__*,@**__^,@_@*,@_@*,@*__^;@_@*,@_@*,@*__^,@_@*,@_@_,@*__^",),
"摊破浣溪沙":("双调48字平韵:@*__**_^,__@**__^,@*@__**,*__^;@*@__**,@_@**__^,@*@__**,*__^",),
"秋蕊香":("双调48字仄韵:_*___*^,_*___*^,__*___*^,_**__*^;___*__*^,*_*^,*_*___*^,_*___*^",),
"眼儿媚":("双调48字平韵:__***__^,@**__^,@_@*,@_@*,@*__^;@_@*__*,@**__^,@_@*,@_@*,@*__^",),
"桃源忆故人":("双调48字仄韵:@_@*__*^,@*@__*^,@*@__*^,@*__*^;@_@*__*^,@*@__*^,@*@__*^,@*__*^",),
"朝中措":("双调48字平韵:@_@**__^,@**__^,@*@_@*,@_@*__^;@_@*,@_@*,@*__^,@*@_@*,@_@*__^",),
"采桑子添":("双调48字平韵:@_@*__*,@*__^,@*__^(叠),@*__,@**__^;@_@*__*,@*__^,@*__^(叠),@*__,@**__^",),
"烛影摇红":("双调48字仄韵:**__,*__*__*^,___**__,**__*^;**__**^,*_*,_***^,*_**,*___,*__*^",
          "双调50字仄韵:_*__,**_,_**,__*^,___**__,_*__*^;_*__**^,___,__**^,*__*,**__,___*^",),
"撼庭秋":("双调48字仄韵:___*_*^,**__*^,*__*,__**,*__*^;__**,__**,*__*^,*_*__,__**,*__*^",),
"河渎神":("双调49字平韵:***__^,*__*__^,*__**__^,**__*_^;_**__**,___*__^,_*___*,**_*__^",),
"酒泉子":("双调49字变韵:_*__,@*@__**,@_@**__^,@**__^;@_@*__*^,@*@__**^,@_@**__^,@**__^",),
"贺圣朝":("双调49字仄韵:@_@*@_*^,*@__*^,@_@**__,*@__*^;@_@*,@_@*^,*___*^,@_@**__,*___*^",),
"太常引":("双调49字平韵:@_@**__^,@**__^,@**__^,@@*,__*_^;@_@*,@_@*,@**__^,@**__^,@@*,__*_^",
         "双调50字平韵:@_@**__^,@**,*__^,@**__^,@@*,__*_^;@_@*,@_@*,@**__^,@**__^,@@*,__*_^",),
"柳梢青":("双调49字平韵:@*__,@_@*,@*__^,@*__,@_@*,@*__^;@_@*__^,*@*,__*_^,@*__,@_@*,@*__^",
         "双调49字变韵:@*__,@_@*,@_@*^,@*__,@_@*,@_@*^;@_@*__^,*@*,@_@*^,@*__,@_@*,@_@*^",),
"应天长":("双调49字仄韵:___*__*^,_**__**^,__*^,__*^,_**___*^;*__**^,**_*_*^,_*_***^,__***^",),
"花犯":("单阙49字仄韵:*__,__**,__*_*^,*__*^,_**__,_*_*^,*_**__*^,___**^,**_,@__*,___**^",),
"滴滴金":("单阙50字仄韵:@_*@@_*^,@_@,*_*^,@@@@*__,*_@_*^,_@*@@_*^,@_@,*_*^,@@_@*__,*@__*^",),
"西江月":("双调50字变韵:@*@_@*,@_@*__^,@_@*@__^,@*@_@*^;@*@_@*,@_@*__^,@_@*@__^,@*@_@*^",),
"加抛球乐":("单阙50字平韵:**__**_^,*__**__^,*__*__*,___**__^,**__*,_*__*__^,**__*,__*__^",),
"醉花间":("双调50字仄韵:__**_**^,___**^,_**__,_*__*^;___**^,**__*^,*_***^,__***__,___,_**^",),
"荷叶杯":("双调50字变韵:@*@__*^,_*^,@**__^,@__**__,@**__;@*@__*^,_*^,@**__^,@__**__,@**__",),
"少年游":("双调50字平韵:@_@**__^,@**__^,@_@*,@_@*;@**__^,@_@*__*,@**__^,@*__,@_@*,@**__^",),
"留春令":("双调50字仄韵:*__*,*__*,*__*^,*___*__,*_*__*^;_*___**^,*___*^,_*__*__,*_*__*^",),
"惜分飞":("双调50字仄韵:@*@__@*^,@*@_@*^,@*__*^,@_@*__*^;@@@@_@*^,@*@_@*^,@*__*^,@_@*__*^",
         "双调54字仄韵:@*@__@*^,@@*,_@**^,@*@_@*^,@_@*__*^;@*@__**^,@@*_@**^,@*@_@*^,@_@*__*^",),
"八拍蛮":("双调51字变韵:_**__**,*__**__^,_**__**,*__**__^;@@@@_,@*__*^,@*__@@@,@_*,@_*^",),
"思远人":("双调51字仄韵:_*___**,_*__*^,__**,___*,_**_*^;*__*__*^,**__*^,***__,*__*,____*^",),
"燕归梁":("双调51字平韵:**__**_^,***__^,____*__^,*_*,*__^;__**,__**,__*__^,***_*__^,*_*,___^",),
"河传":("双调51字仄韵:@*@*^,@@*@,@_@*^,@@@@,_***^,@__**^;@_**__*^,__*^,@*_**^,*@@@_*^,@__**^",
       "双调55字平韵:**,_*,___*,_*__^,__**,_*_*__^,__**_^;__***__^,*__,*_*__^,*___*,*_*__^*__^",),
"醉花阴":("双调52字仄韵:@*@__**^,@*__*^,@**__,@*__,@*__*^;@_@*__*^,@*__*^,@**__,@*__,@*__*^",),
"南歌子":("双调52字平韵:@*__*,__@*_^,@_@**__^,@*@_@**__^;@*__*,__@*_^,@_@**__^,@*@_@**__^",),
"青门饮":("双调52字仄韵:**__*^,_**__*^,__***_*^,@_@*,***_*^;__**__*^,**__*^,*_**_*,*_**__*^",),
"望江东":("双调52字仄韵:_*__*_*^,***,__*^,@_@**_*^,***,__*^;__**__*^,***,__*^,@_@**_*^,*_*,__*^",),
"忆汉月":("单阙53字仄韵:_**__*^,@@*__*^,*_@*@__,*_@*__*^,@__**,@**,*__*^,@_@**_*^,**@*___*^",),
"江南柳":("双调54字平韵:__*,__*__^,_**__*_,*__**__^,_**__^;_**,_**__^,_*___**,*__**__^,_**__^",),
"浪淘沙":("双调54字平韵:@**__^,@*__^,@_@**__^,@*@__**,@*__^;@**__^,@*__^,@_@**__^,@*@__**,@*__^",),
"鹧鸪天":("双调55字平韵:@*__@*_^,@_@**__^,@_@*__*,@*@_@*_^;_**,*__^,@_@**__^,@_@*__*,@*@_@*_^",),
"芳草渡":("双调56字平韵:__*,*__^,_**,*__^,__***__^,__**,***__^;_***__^,_**,*__^,___**__^,__*,_**,*__^",),
"瑞鹧鸪":("双调56字平韵:@_@**__^,@*__@*_^,@*@__**,@_@**__^;__@*__*,@**_@*_^,@*@_@@*,@_@**__^",),
"木兰花令":("双调56字仄韵:@_@__**^,@_@__**^,@_@**__,@*@__**^;@_@__**^,@_@__**^,@_@**__,@*@__**^",),
"鹊桥仙":("双调56字仄韵:@_@*,@_@*,@*@_@*^,@_@**__,@@*,@_@*^;@_@*,@_@*,@*@_@*^,@_@**__,@@*,@_@*^",),
"玉楼春":("双调56字仄韵:@_@*__*^,@*@__**^,@_@**__,@*@__**^;@_@*__*^,@*@__**^,@_@**__,@*@__**^",),
"虞美人":("双调56字变韵:@_@*__*^,@*__*^,@_@**__^,@*@_@**__^;@_@*__*^,@*__*^,@_@**__^,@*@_@**__^",),
"茶瓶儿":("双调56字仄韵:*____**^,*_*,___*^,_*__*^,*__**,*__*^;_*___**^,_**___*^,_*__*^,*__*,**__*^",),
"夜游宫":("双调57字仄韵:@*__**^,@@*,@_@*^,@*__*@*^,@@@,*_@,@@*^;@*__*^,*@@@__*^,@*__@@*^,@@@,*@@,@@*^",),
"一斛珠":("双调57字仄韵:@_@*^,@_@*__*^,@_@*__*^,**__,@**_*^;@_@*__*^,__@*__*^,@_@*__*^,_*__,***_*^",),
"小重山":("双调58字平韵:@*__@*_^,@__**,*__^,@_@**__^,_@*,@**__^;@**__^,@__**,*__^,@_@**__^,_@*,@**__^",),
"踏莎行":("双调58字仄韵:@*__,@_@*^,@_@*__*^,@_@**__,@_@*__*^;@*__,@_@*^,@_@*__*^,@_@**__,@_@*__*^",),
"临江仙":("双调58字平韵:@*@__**,@_@*__^,@_@**__^,@_@*,@**__^;@*@__**,@_@*__^,@_@**__^,@_@*,@**__^",
         "双调60字平韵:@*@__**,@_@*__^,@_@**__^,@__**,@**__^;@*@__**,@_@*__^,@_@**__^,@__**,@**__^",),
"后庭宴":("双调60字仄韵:_**_,___*^,*__*__*^,**_*_*_,___*__*^;__**__,_**__*^,*__*^,_*__*^,***__,*__**^",),
"一剪梅":("双调60字平韵:@*__@*_^,@*__,@*__^,@_@**__,@*__,@*__^;@*__@*_^,@*__,@*__^,@_@**__,@*__,@*__^",),
"钗头凤":("双调60字仄韵:@_*^,@_*^,@_@*__*^,@_*^,@_*^,@_@*,@_@*^,*^,*^,*^(三叠);@_*^,@_*^,@_@*__*^,@_*^,@_*^,@_@*,@_@*^,*^,*^,*^(三叠)",),
"唐多令":("双调60字平韵:@**__^,@_@*_^,*@_,@*__^,@*@__**,@@*,*__^;@**__^,@_@*_^,*@_,@*__^,@*@__**,@@*,*__^",),
"蝶恋花":("双调60字仄韵:@*@__**^,@*__,@*__*^,@*@__**^,@_@*__*^;@*@__**^,@*__,@*__*^,@*@__**^,@_@*__*^",),
"渔家傲":("双调62字仄韵:@*@__**^,@_@*__*^,@*@__**^,_@*^,@_@*__*^;@*@__**^,@_@*__*^,@*@__**^,_@*^,@_@*__*^",),
"苏幕遮":("双调62字仄韵:*__,_**^,@*__,@*__*^,@*@__**^,@*__,@*__*^;*__,_**^,@*__,@*__*^,@*@__**^,@*__,@*__*^",),
"破阵子":("双调62字平韵:@*@_@*,@_@*__^,@*@__**,@*__@*_^,@_@*_^;@*@_@*,@_@*__^,@*@__**,@*__@*_^,@_@*_^",),
"定风波":("双调62字变韵:@*__@*_^,@_@**__^,@*@__**^,_*^,@_@**__^;@*@__**^,_*^,@_@**__^,@*@__**^,_*^,@_@**__^",),
"淡黄柳":("双调65字仄韵:@_**,_*__*^,**___**^,**__@*,_*__*_*^;*_*^,__*_*^,@@*,*_*^,*__**__*^,**__,*__*,_*__**^",),
"行香子":("双调66字平韵:@*__^,@*__^,*__,@*__^,@_@*,@*__^,*@_@,@_*,*__^;@*__,@*__^,*__,@*__^,@_@*,@*__^,*@_@,@_*,*__^",),
"锦缠道":("双调66字仄韵:**__,@**__*^,*__,@__*^,@_@*__*^,@*__,@*__*^;*__*_,@__*^,*__,@__*^,*@_@*__@,@_@*,@@__*^",),
"品令": ("双调66字仄韵:**__*^,*_*,*_*^,__**,__**,*__*^,_*__,**___**^;*__*^,*_*,__*^,*__*,*_**,__**^,**__,_**_**^",),
"谢池春":("双调66字仄韵:@*__,@*@__*^,*__,__**^,___*,*___*^,*__,*__*^;__@*,**@__*^,*__,__**^,___*,*___*^,*__,*__*^",),
"青玉案":("双调67字仄韵:@_@*__*^,@@*,__*^,@*@__**^,@_@*,@_@*^,@*__*^;@_@*__*^,@*@_*_*^,@*@__**^,@_@*,@_@*^,@*__*^",),
"解佩令":("双调67字仄韵:@_@*,@_@*,*__@*__*^,@*__,*@*@__*^,*__,*_@*^;@_@_,@_@*,*__,*__*^,@*__,*@*@*_*^,*__,*_@*^",),
"感皇恩":("双调67字仄韵:@**__,@_@*^,@*__*_*^,@_@*,@*@_@*^,@_@**,__*^;@*__,@_@*^,@*__*_*^,@_@*,@*@_@*^,@_@**,__*^",),
"天仙子":("双调68字仄韵:@*@__**^,@*@__**^,@_@**__,@@*^,@@*^,@*@__**^;@*@__**^,@*@__**^,@_@**__,@@*^,@@*^,@*@__**^",),
"江城子":("双调70字平韵:@*@**__^,*__^,*__^,@*__,@**__^,@*@__**,_**,*__^;@*@**__^,*__^,*__^,@*__,@**__^,@*@__**,_**,*__^",),
"千秋岁":("双调71字仄韵:@_@*^,@*__*^,_**,__*^,@__**,@*__*^,_@*,@_@*__*^;@*__*^,@*__*^,_**,__*^,@__**,@*__*^,_@*,@_@*__*^",),
"粉蝶儿":("双调72字仄韵:@*__,@@@@@*^,*__,*__*^,*__,@**@__*^,*__,_@*__*^;@@@@,@@*@_*^,*__,*_@*^,*__,_**@_@*^,*@_,@@*__*^",),
"忆帝京":("双调72字仄韵:_***__*,*____*^,***__,**__*^,***__,_*__*^;***,*__*,*_*,*__*^,**__,___*,*_**__*^,***__,**__*^",),
"离亭燕":("双调72字仄韵:@*@_@*^,@*@_@*^,@*@__**,@*@_@*^,@**__,@*@_@*^;@*@_@*^,@*@_@*^,@*@__**,@*@_@*^,@**__,@*@_@*^",),
"归田乐":("双调72字仄韵:**__*^,***,*__*^,*___*^,*_*_*,_*_*^,**__*_*^;___**^,***,_*___*^,___*,**__*^,*_**_,*__*^,_*__*_*^",),
"隔浦莲近拍":("双调73字仄韵:___***^,**__*^,**__*,__*,__*^,_*_**^,__*,**__*^;*_*^,__**,___*_*^,__**,***__*^,_*__***^,__,___*_*^",),
"风入松":("双调74字平韵:@_@**__^,@*__^,@_@*__*,@_@,@*__^,@*@_@*,@_@*__^;@_@**__^,@*__^,@_@*__*,@_@,@*__^,@*@_@*,@_@*__^",
         "双调76字平韵:__**__*,@**__^,@_@*__*,@_@,@*__^,@*@_@*,@_@*__^;@_@**__^,@**__^,@_@*__*,@_@,@*__^,@*@_@*,@_@*__^",),
"河满子":("双调74字变韵:@*@_**,@_@*__^,*@@__**,@_@*__^,**___*,@_@*__^;@*@_@*,@_@*__^,@*@__**^,@__*_*^,@*@__*,@_@*__^",),
"千年调":("双调75字仄韵:@@*__,@*@_*^,@*__@*,*@@*^,@_@*,**__*^,@@*,*@_,@**^;@_**,@*@_*^,@*_@@*,**_*^,@_@*,**@_*^,@@@,*__,@**^",),
"诉衷情近":("双调75字仄韵:*_**,@*@_@*^,@_@*@*,@*@_@*^,@*@_@*,**__,**__*^;__*^,@*@_@*^,*__*,**__*^,__*^,@_**,@_**,@__*^,**__*^",),
"阳关引":("双调77字仄韵:**__*^,**__*^,__**__*,__*^,*__@*,**__*^,@*@,_@***_*^;@@@_*^,_**^,*__,*__**_*^,**__*^,**__,**_,_@***_*^",),
"祝英台近":("双调77字仄韵:*__,_**^,@*@_*^,@*__,@**_*^,@_@*__,@_@*,@@*,@_@*^;@_*^,@@@*__,@_*_*^,__@*^,@**_*^,@_@*__,@_@*,*@*,@_@*^",),
"一丛花":("双调78字平韵:@_@**__^,@**__^,@_@*__*,*_@,@*__^,_**_,@_@*,@**__^;@_@**__^,@**__^,@_@*__*,*_@,@*__^,_**_,@_@*,@**__^",),
"御街行":("双调78字仄韵:@_@*__*^,@@*,__*^,@_@**__,@*@_@*^,@_@*,@_@*,@*__*^;@_@*__*^,@@*,__*^,@_@**__,@*@_@*^,@_@*,@_@*,@*__*^",),
"剔银灯":("双调78字仄韵:_*_***,*_____*^,**__,___*^,*____*^,_**__,__*,___*^;_*__**^,*__,*__*^,**__,_**_,**___*^,_**__,*_*,___*^",),
"山亭柳":("双调79字平韵:@*__^,@**__^,_@*,*__^,@*@_@*,@_@*__^,@*@_@*,@*__^;@_@*__*,@_@**__^,_@*,*__^,@*@_@*,@_@*__^,@*@_@*,@*__^",),
"凌歊":("双调81字平韵:*__,__*,*__^,***,**__^,__**,**__**__^,**__,*__**__^;__*,__*,_**,*__^,*_*,_**_^,__**,**__**__^,*__*,**__*__^",),
"最高楼":("双调81字变韵:_@*,@**__^,@**__^,@_@*@_*,@_@**__^,*__,_*@,*__^;@@*@__**^,@@*@__**^,@@*,*__,@_@*__*,@_@**__^,*__,_**,*__^",),
"斗百花":("双调81字仄韵:**___*,@*___*^,@@@@_@,*__@_*^,@_**,_@**__,@_@_@*^;@*__*^,@*__,@@__@*^,@*@_,@@*@_*^,@*__,__**__,@*@__*^",),
"蓦山溪":("双调82字仄韵:@_@*,@*__*^,@**__,*__,@_@*^,@_@*,@**__,_**^,*__,@*@_*^;@_@*,@*__*^,@**__,*__,@_@*^,@_@*,@**__,_**^,*__,@*@_*^",),
"凤归云":("双调82字平韵:__**,_*__^,**___,**__^,**___**,**__^,___**,*__*,**__^;*__*,**__^,_*__*,**__^,*____**,_*__^,*__**,__**,**__^",),
"洞仙歌":("双调83字仄韵:@_@*,*@_@*^,@*__*_*^,*@_,@*@*__,@@*,@*@_@*^;@_@**,@*__,@*__*_*^,@**__,@*__,@@*,@_@*^,*@*,@_*__,*@*,@_*_@*^",),
"婆罗门令":("双调86字仄韵:__*,___*^,__*,*___*^,**__,__*,__*^,_**,_*__*^,__*,_**,*__,**__*^;__**__*,_**,*_*_*^,*_**,_*_*^,**__,**,_*__*^,**__*^",),
"梅花引":("双调87字平韵:*_***__^,*__^,*__^,_*__,_**__^,_**__**,*_*,*__,**_^;*_*__*_^,_*_^,**_^,__**,__*,_*__^,**__,***__^,_*___**,__*,*__,**_^",),
"八六子":("双调88字平韵:*__^,*__*,@_@*__^,***@_@*,*__*__,*_*_^;__@*__^,@*@__*,@_@*__^,***,__*__*,*__*,*__*,__**__**,@_@*__^,*__^,__*_*_^",),
"醉翁操":("双调90字平韵:*_^,__^,__^,*__^,__^,__***__^,*__*__^,_*_^,_**__^,_*_*_*_^;*_**,*___^,*_**,_*_*__^,_*_*__^,*_*__^,___*_^,**___^,***__^,*__**__^",),
"谢池春慢":("双调90字仄韵:___*,_@*,__*^,***__,@*__*^,@*__*,@*__*^,*__,_**^,@__*,_*__*^;___*,_@*,__*^,***__,@*__*^,@*__*,@*__*^,*__,_**^,@__*,_*__*^",),
"满江红":("双调93字仄韵:@*__,@@*,@_@*^,@@*,@_@*,@_@*^,@*@__**,@_@*__*^,@@@,@**__,__*^;@@*,_@*^,_@*,__*^,*@_@*,*__*^,@*@__**,@_@*__*^,@@@,@**__,__*^",),
"驻马听":("双调93字平韵:**__^,*_*,__**__^,__**,___*,__**__^,*__^,_*_,_*__^,_*__,*__*,**__^;__*_**,*__*__^,**_**,_*__^,**___*,_*_*__^,***,**__,_*__^",),
"双声子":("双调93字平韵:@*__^,___*,___*,_***__^,*_**,_**,_*__^,__*,*_*,___*__^;*__,_*_**,__**__^,___*,___*,__**__^,*__**,_**_*__^,__**__,*_**__^",),
"六么令":("双调94字次韵:@_@*,@*@_*,@_@*,**@*@_*,@*___*,@*__*,@__*,@_@*,@*@_*_*;_*___*,@*__*,@*@*__,**_@*,@**__*,@*__*,@__*,@_@*,@*@_*_*",),
"玉漏迟":("双调94字仄韵:*__**^,__**,@__*^,@*__,*@*__*^,**__**,*@*,___*^,_**^,@_**,*__*^;@@**__,*@*__,@__*^,@*__,@**__*^,@*__**,*@*,___*^,_**^,@**__*^",),
"凤凰台上忆吹箫":("双调95字平韵:@*__,@_@*,@_@*__^,**__*,@*__^,@*__@*,_@*,@*__^,__*,__**,**__^;__^,*_**,_@*__,@*__^,**__*,@*__^,@*__@*,_@*,@*__^,__*,__*_,**__^",),
"倦寻芳慢":("双调95字仄韵:*_**,_*__,**_*^,**__,_**_**^,*__,__*,*__*__*^,*__,*__**,___*^;*_*,__**,**__,_*_*^,**__,***__*^,*__,_**,*__*__*^,*__,*__,*__*^",),
"水调歌头":("双调95字平韵:@*@_*,@**__^,@_@*_*,@**__^,@*@_@*,@*@_@*,@**__^,@*@_*,@**__^;@@@,@@*,*__^,@_@*,_@@**__^,@*@_@*,@*@_@*,@**__^,@*@_*,@**__^",),
"满庭芳":("双调95字平韵:@*__,@_@*,*@@*__^,@__*,@**__^,@*__**,@@*,@*__^,__*,@_@*,@**__^;__^,_**,@_@*,@*__^,*@@@@,@*__^,@*@_**,@@*,@*__^,__*,@_@*,@**__^",),
"陌上花":("双调95字仄韵:@_**,@_@*,@__*^,@*__,_**__*^,@_@*__*,@**__*^,*@_**,@__*,*__*^;*__**,@_@*,@*@__*^,@*__,@**__*^,@_@*__*,_*@__*^,*@_**,@__*",),
"伴云来":("双调96字变韵:_*__,__**,@_@*__^,@__*,___*,**___*^,*__*,_**,*__*^,_*__**,***__*^;__*_**^,*__,*__*^,_*__**,*__*^,_*__**^,*__,__*_*^,**__,__**^",),
"黄莺儿":("双调96字仄韵:@__*__*^,@*__,_*__,@@__,@@_*^,_***__,**__*^,*__*__,**___*_*^;_*^,***__,**__*^,*__@,**__,__@@_*^,_***__,**__*^,*@@*__,@*__*^",),
"甘州遍":("三叠96字变韵:__*,_**__^,*__^,__**,__**,__***__^;_**,*__^,__**_*,@**__^,*_*,***__^,*__^,@_**,***__^;@**_,@_@*^,@*__*_*^,*_@@,@*@__*^,@__*@,__*^",),
"汉宫春":("双调96字平韵:**__,*__**,_*__^,__*_,****__^,__**,*___*__^,_**,__**,___*__^;_***__,*__**,_*__^,__*_**,_*__^,__**,*___*__^,_**,__**,__**__^",),
"迷神引":("双调97字仄韵:_**___*^,*_*__*^,__**,*__*^,*__,__*,*_*^,_*__*,*_*^,_*__*,*_*^;**__,**__*^,**__,__*^,*__*,*_*,__*^,*__,__*,*_*^,_*__*,_**^,_*__*,*_*^",),
"庆清朝":("双调97字平韵:_*__,__**,___*__^,__*__*,**__^,_*__**,___**__^,__*,*_**,_*__^;__*,__*,*___***__^,_**__*,_*__^,_*__**,___**__^,__*,*_**,_*__^",),
"翠楼吟":("双调97字仄韵:**__,__**,__*__*^,@__**,__*___*^,___*,***__,___*^,__*^,*__*,*__*^;**^,_*__,**__*,*__*^,@__**,*_*___*^,***__,___*^,__*^,*__*,*__*^",),
"醉蓬莱":("双调97字仄韵:*___*,**__,*__*^,____,**__*^,**__,*__*,**__*^,**__,*__*,___*^;**__,*___,*___,*__*^,_*__,*___*^,*___,**_*,**__*^,**__,__**,*__*^",),
"声声慢":("双调97字仄韵:__**^,**__,__*@@*^,@*___*,*__*^,__*@**,*@_,@@_*^,***,*__,***__*^;**__@*^,@@@,@@*__*^,@*__,@**_@*^,__*_**,*__,@@_*^,***,*___***^",),
"暗香": ("双调97字仄韵:@_@*^,*@_@*,@__*^,**@_,@*__*_*^,@*__**,_**,@__*^,*@@,@*__,_**_*^;_*^,*@*^,**@*_,*@_*^,*_**^,_*@_*_*^,@*__**,_**,___*^,***,_**,*_**^",),
"八声甘州":("双调97字平韵:*@_@**__,@@*__^,*@_@*,@_@*,@*__^,@*@_@*,@**__^,@*@_*,@*__^;@*@_@*,*@_@*,@*__^,*@_@*,@**__^,*__,@_@*,*@_,@**__^,__*,@_@*,@*__^",),
"昼夜乐":("双调98字仄韵:*_*___*^,**_,__*^,__**__,**___*^,*____**^,***,*__*^,_**__,*___*^;****__*^,*__,*_*^,*__*__,**___*^,_*___**,*_*,*__*^,_**_*,*___*^",),
"扬州慢":("双调98字平韵:@*__,@_@*,@_@*__^,*__@*,@@*__^,*@*__@*,@_@*,@*__^,*__,@*@_,_*__^;@_@*,*__,@*__^,*@*__,@_@*,@*__^,**@__*,__*,@*__^,*@__*,@_@*__^",),
"双双燕":("双调98字仄韵:*_**,@_*__,*__*^,__**,@**__*^,_*__**^,*@*,__@*^,__**__,**___*^;_*^,__**^,@**__,*__*^,@__*,@**__*^,_*__**^,*@*,___*^,_@**__,@*@_**^",),
"玲珑四犯":("双调99字仄韵:**__,__**,__*__*^,*__**,**__*^,__*__*^,*__,*__*^,**__,*__*,_*__*^;__*__*^,*__**,*__*^,*__**,**__*^,__**__*,*_**__*^,__*^,__**__*^",),
"琐窗寒":("双调99字仄韵:**__,__**,*__*^,__**,***__*^,*__,*_*_,*_*___*^,**__*^,__**,*__*^;_*^,__*^,***__,*__*^,__**,**___*^,*__,_**_,*_*___*^,*__,**__,**__*^",),
"燕山亭":("双调99字仄韵:@*__,_**_,@*___*^,_**_,**__,@@*__*^,@*__,@@*@__*^,_*^,@@*__,*_@*^;_*_*__,*@*__,@__*^,__**,**__,__*__*^,@*__,@@*@__*^,_*^,_**__@*^",),
"凤箫吟":("双调99字平韵:*__,___*,__**__^,**_**,*__*,**__^,___**,*__,**__^,**___,*_**__^;__^,___*,__*,**__^,___**,*__**,**__^,___**,*__,_*__^,***,__**,**__^",),
"新雁过妆楼":("双调99字平韵:@*__^,_@*,_***__^,*__*,_***__^,@*___**,@_***__^,*__^,*_**,_*__^;__@_**,*@_**,**__^,**__,_***__^,@_@***,*@*,__@*_^,__*,**__*,@*__^",),
"玉蝴蝶":("双调99字平韵:@*@_@*,@@@*,@*__^,@*__,@*@*__^,@_@,@_@*,@@*,@*__^,*__^,@_@*,@*__^;@_^,@_@*,@_@*,@*__^,**__,@_@**__^,*@@@_@*,@@@,@*__^,*__^,@_@*,@*__^",),
"锦堂春":("双调100字平韵:*___,__**,_***__^,*___*,_*__^,*_*__**,*__*__^,*__**,_*__,_*__^;__***_,*__**,_*__^,*___*,_*__^,*_*,__**,_**,**__^,_*_,***_,__**__^",),
"念奴娇":("双调100字仄韵:*__*,*_*,_*___*^,**__,_**,_*__**^,**__,__**,@*__*^,___*,*@_*_*^;@*@*__,*__**,___*^,**__,_**,@*___*^,**__,@_@**,*__*^,@__*,@__*_*^",
        "双调100字仄韵:@_@*,*_@@*,@__*^,@*@__**,@*@__*^,@*__,@_@*,@*__*^,@_@*,@__*@*^;@*@*__,@_@*,@*__*^,@*@__**,@*@__*^,@*__,@_@*,@*__*^,@__*,@_**_*^",),
"高阳台":("双调100字平韵:@*__,__**,@_@*__^,@*__,@_@*__^,@_@*__*,*@_,@*__^,*__,@*__,@*__^;__**__*,*__@*,@*__^,@*__,@_@*__^,@_@*__*,*@_,@*__^,*__,@*__,@*__^",),
"解语花":("双调100字仄韵:__**,**__,_*__*^,*__*^,__*,***_@*^,__**^,@@*,@_@*^,_*_,_*__,**__*^;_*@_**^,*___*,_*_*^,*__*^,__*,@**__*^,__**^,@@*,@_@*^,@*_,_*__,@*__*^",),
"导引":("双调100字平韵:*@@*,_*@__^,@**__^,@_@*__*,@@*__^,__@**__^,@**@_^,__@*__*,_**@_^;*@@*,_*@__^,@**__^,@_@*__*,@@*__^,__@**__^,@**@_^,__@*__*,_**@_^",),
"渡江云":("双调100字平韵:___**,*_**,***__^,*__**,**__,*_*__^,___*,***,_*__^,_**,*__*,***__^;__^,___*,**__,*_*__^,_*_,___*,_*__^,__**__*,***,*___^,***,__**__^",),
"换巢鸾凤":("双调100字变韵:*__*,*__**,@*__^,@__**,***__^,@_@**__^,*_*_,__*_^,__*,*@*,*__*^(换韵);_*^,_**^,_*@_,@*__*^,@*__,@__*,@*@__*^,_*__*__,@_@*__*^,___,*__,@*_*^",),
"东风第一枝":("双调100字仄韵:**__,__**,__**_*^,@_**__,@_*_@*^,__@*,@@*,@__*^,**@,@*__,@**__*^;_**,*_**^,_**,*_@*^,*_**__,@_*_@*^,__@*,@@*,@__*^,*_@,@*__,@**__*^",),
"庆春泽":("双调100字平韵:_*__,__**,*_@*__^,@*__,*_@*__^,@_@*__*,*__,@*__^,*__^,@*__,@*__^;__**__*,*__@*,@*__^,@*__,*_@*__^,@_@*__*,*__,@*__^,*__^,@*__^,@*__^",),
"木兰花慢":("双调101字平韵:@*@_*,*_*,*__^,***__,*__*,_*__^,*_,*_**,*__@**__^,_*___*,__**__^;*_@**__^,@_*__^,***__,*_@*,**__^,__*_**,*__@**__^,**___*,@_@*__^",),
"桂枝香":("双调101字仄韵:__**^,***@_,@@_*^,@*__@*,*__*^,@_@*__*,*__,@__*^,*__*,@_@*,*__*^;**@,__**^,*@@_@,@@_*^,@*__@*,*__*^,@_@*__*,*__@*_*^,*__*,@_@*,*__*^",),
"翦牡丹":("双调101字仄韵:**__,___*,**_*_*^,**__,**__*^,*_**__,___*,___*_*^,_*__,*_*_*^;*__*_*^,**_,*__*^,_**__,___*___*^,*_***_*^,**_*,_*__*^,_*^,**_**,__**^",),
"氐州第一":("双调102字仄韵:_*__,_***,_***_*^,**__,__**,_*___*^,_*__,**_,___*^,**__,_***,*__*^;**___**,*_*,___*^,**__,__****__*^,*__,_**,__*,___*^,**__,*__,__**^",),
"石州慢":("双调102字仄韵:@*__,_**_,_*_*^,__@*__,@*@__*^,*__*,*_@*__,__@*__*^,@**__,*__,_*^;_*^,@_@*,@@@@,@__*^,@*__,@*@__*^,@_@*,@@@*__,@_@*__*^,@**__,*__,_*^",),
"瑞鹤仙":("双调102字仄韵:____*^,**__*,*__*^,__*_*,**__*,*__*^,__**^,___,*_**^,**__*,__*_,*_**^;_*^,__**,**__,*__*^,*_**^,__*__*^,**__*,____,***_**^,*__,**__,*_**^",),
"宴清都":("双调102字仄韵:**__*^,_*_,@_@*_*^,**__,__**,*__*^,_***_*^,@*@__**^,_*_,**_*^,_*^(叠韵),_*^(叠韵),_*^(叠韵);_*^,_*__,*_**,_*_*^,__**,__**,**_*^,@*@_@*^,@*@__**^,*@_@*__,*__*^",),
"忆旧游":("双调102字平韵:*__**,**__,_*__^,***__,__***,*___^,*_*__*,_*___^,*____,*_****__^;__^,*_*,***__,_*__^,**__*,*___*,_*__^,*_**__,_*___^,***__,__**_*_^",),
"水龙吟":("双调102字仄韵:@_@*__,@_@*__*^,@_**,@_@*,@_@*^,@*__,@_@*,@_@*^,*@_@*,@_@*,@_*,__*^;@*@_@*^,*__,@__*^,@_@*,@__*,@_@*^,@*__,@_@*,@__*^,*__**,@_@*,*__*^",),
"还京乐":("双调102字仄韵:*_*,**__**_**^,*__*,*_**,___*^,**__*^,__**__*^,***,_**____*^;*__*^,*___*,__*_,__**_*^,__*___,*__,**_*^,*__,_**__,__**^,*___*,__**_*^",),
"齐天乐":("双调103字仄韵:@_@*__*,__*__*^,**__,__**,_*___*^,__**^,*@*__,*__*^,**__,*_@**_*^;__@@***^,*__**,_*_*^,**__,__**,@*__@*^,__**^,*@*__,*__*^,**__,*__**^",),
"竹马儿":("双调103字仄韵:__*__,__**,*__*^,*__**,____,___*^,*__*__,__**,*__*^,**___,*__,_*___*^;**__*,____,*__*^,__**_*^,__*__*^,_*_*__,___*,_*__*^,*__*,**__*^",),
"喜迁莺慢":("双调103字仄韵:@__*^,*@*@*,___*^,@*_*,@_@*,@**__*^,@**__*,_*___*^,*@*,*__**,___*^;_*^,_**_**_,@*__*^,@*__,@_@*,@**__*^,@**_**,_*___*^,*_*,*__@*,@__*^",),
"雨霖铃":("双调103字仄韵:___*^,*__*,**_*^,__**_*,__**,___*^,**__**,*_*_*^,***,_*__,**__*_*^;__**__*^,*__,**__*^,__**_*,_**,*__*^,**__,_*,__**_*^,***,_*__,**__*^",),
"长相思慢":("双调103字平韵:**_____*,@_@*@_^,__**,**__,@_@*@_^,**__^,*____,**__^,**__^,*__,***_^;*____,*___,@_@*@_^,__**,_*__,**__^,__**,*__,____^,*__**,_*__,_*__^",),
"眉妩":("双调103字仄韵:**__*,**__,_**_*^,**__*,__*,___*_*^,*__*^,**__*_*^,*_*,**__*,*_*_*^;_**__*^,**_@*,_*_*^,@*__*,__**__*_*^,*_**^,**__*_*^,*_*__,__**_*^",),
"西河":("双调104字仄韵:_@*^,@_@*_*^,@_@**__,@_**^,@_@**__,@_@*_*^,@@@,@@*^;@_@*_*^,@_@**__,@_@*^,@_@**__,@_@*_*^,*_*****^,@___@_*^,@*@__*^,*__,**__*^,**____*^",),
"永遇乐":("双调104字仄韵:@*__,@_@*,@__*,@*__,@_**,@*_@*^,@_@*,@_@*,@*@__*^,@__,__@*,*_@@_*^;@_@*,@__*,@*@_@*^,@*__,@_@*,@*_@*^,*__*,@_@*,@*@_@*^,@_*,__**,*_**^",),
"倾杯乐":("双调104字仄韵:**__,*__*,__**_*^,****,_*_*^,**__*^,__**__*,**__*^,__**,_**,**___*^;**^,__**,*__*,_*__*^,***__,___**,___*^,**__,___*,**__*^,*_*^,_**,*__*^",),
"归朝欢":("双调104字仄韵:_**__**^,_*___**^,__***__,___*__*^,**__*^,*__*__*^,*__,*__*,**__*^;**___**^,**___**^,__***__,__**__*^,*__**^,*__*__*^,_*_,*__*,**__*^",),
"拜星月慢":("双调104字仄韵:**__,___*,**__**^,__*_,**__*^,*_*,*___**_*,**___*^,**__,*___*^;*__,*___*^,__*,**__*^,*_**__,*___*^,*__,**__*^,__*,**__*^,***,**__,*___*^",),
"花心动":("双调104字仄韵:_*__,@*@,_*___*,@*__,_*__,@**__*^,__**__*,@@*,@__*^,__*,__**,*__*^;**__**^,***__,*__*^,@*__,***_,@**__*^,*_***__,@@*@__*^,***,**___*^",),
"绮罗香":("双调104字仄韵:**__,__**,@**__*^,@*__,@**__*^,*@*,@*__,*@*,@__*^,*__**__,*_@**_*^;___***^,_*__@*,@__*^,**__,@**__*^,*@_,@*__,*@*,@__*^,*__**__,*__**^",),
"尉迟杯":("双调105字仄韵:__*^,_**,@*@_*^,@_@*@_,@*@__*^,__**,_**,@*@_*^,*__,*__*,*__*_*^;@_@*@_,_**__,*__*^,@*@_*__,_**,__**^,__*,__**,*_*,@__**^,*__,**__,*__*_*^",),
"曲玉管":("三叠105字变韵:**__,__**,__**__*^,_*___*,_*__^(换韵),*__^;**__,___*,__**__*^,**__,**_*__^,___^;**__,*_*,___*,*_**__,__**__^,*__^,*___*,**___*,**__,**__,**__^",),
"安公子":("单阙105字仄韵:**__*^,*_____*^,_*___**,*__*^,***,__**__*^,_**,**__*^,**__*,_*___*^,_*_**,*__*__*^,**___**,*___*^,*__,__**__*^,_*_,*___*^,_**__,*_*__*^",),
"二郎神":("双调105字仄韵:****,@**,@__*^,*@*__,@__*,@*@__*^,**_@__*,**_,@__*^,_@**_,@__*,@__*^;_*^,__*_,@__*^,*@@**,@__*,@*@__*^,*_*_,@__*,@*@__*^,_**,@*@_@*,*__*^",),
"解连环":("双调106字仄韵:*__*^,@__**,*__*^,**@,@*__,*_*@_,*__*^,**__,*@*,@_**^,*__**,__@*,*__*^;__*_**^,___**,*@_*^,**@,@*__,*_*__,*@_*^,**__,*@*,@__*,*__,_*__,*_**^",),
"望湘人":("双调107字仄韵:*__**,_**_,*__*_*^,*___,*__*^,**___*^,*___,*__*,___*^,**__**_,**___*^;_*__**^,*__**,*__*^,*_*__,***__*^,_**_,___*^,**_*_*^,***,_*__,**___*^",),
"望海潮":("双调107字变韵:@__*,__@*,@_@*__^,@**_,__**,@_@*__^,@**__^,*@@@*,@*__^,@*__,*__**__^;__**__^,*__@*,@*__^,@**_,__**,@_@*__^,_**__^,*@_@*,@*__^,@*__**^,_**__^",),
"夺锦标":("双调108字仄韵:_*__,@_@*,**___*^,@*@_@*,_*__,@_@*,*__@*,*_@,@__*^,*__,@*__,**___*^;@*__@*^,@*__,@@@@_*^,@*__@*^,@*__,@__*__@**^,*__,___*^,*__,**__,**___*^",),
"薄幸": ("双调108字仄韵:@__*^,*@*,__**^,*@*,___*,@*@__*^,*@_,_*__,__**__*^,***__,@_@*,@*__@*^;@**,__*,_**,*_@*^,@_@@*,__@*,@_@*__*^,*__*^,*__@*,__**__*^,__**,@*__@*^",),
"疏影": ("双调110字仄韵:__**^,**@*@,@*_*^,@*__,@*__,@@*@_*^,__**__*,@@@,@__*^,*@_,@*__,@**__*^;_*__**,*_@**,@*_*^,@*__@*__,@*___*^,@_**__*,@@*,@__*^,*@@,@*__,@**__*^",),
"过秦楼":("双调111字仄韵:**__,@__*,***__*^,__**,@*__,***__*^,_***__,_*__,@__*^,*__**,___*,*__*^;_**,**__,@__*,***__*^,__**,@*__,***__*^,_*__*_,_*__,@__*^,*__**,*____*^",),
"女冠子":("双调112字仄韵:*__*^,@__*_*^,___*,*__*,**__,___*^,___**^,***_@*,*_@*^,*@_,_*@*,_*___*^;__@*__*^,*@__*,**__*^,*__*,**@,@*@__*^,___**^,***__*,*__*^,**__*,*__*,*__*^",),
"沁园春":("双调114字平韵:@*__,@*__,***_^,*@_@*,@_@*,@_@*,@*__^,@*__,@_@*,@*__@*_^,_@*,*@_@*,@*__^;@_@*__^,@@*__@*_^,*@_@*,@_@*,@_@*,@*__^,@*__,@_@*,@*__@*_^,__*,*@_@*,@*__",),
"摸鱼儿":("双调116字仄韵:*__,@__*,@__*_*^,@_@*__*,@**__*^,@**^,@@*,@_@*__*^,@_@*^,*@*__,@_@*,@**_*^;__*,@*__**^,@__*_*^,@_@*__*,@*@__*^,_**^,@@*,@_@*__*^,@_@*^,*@*__,@_@*,@**_*^",),
"贺新郎":("双调116字仄韵:@*__*^,*__,@_@*,*__*^,@*@_@@*,@*__@*^,@**,@__*^,@*@__@*,*@_@*__*^,@**,*_*^;@_@*__*^,*__,@_@*,*__*^,@*@__@*,@*__@*^,@**,__@*^,@*@__@*,*@_,@*__*^,@**,@_*^",),
"集贤宾":("双调118字平韵:*__*__*,_*__^,**__**,**__^,**__**,__**__^,*_**__*,_**,**__^,*____*,_**__^;*__*___^,***__^,*___**,_*__^,_*___*,*_**__^,*__*,**__,__*,**__^,**_*_*,_**__^",),
"兰陵王":("三叠129字仄韵:@_*^,@*__@*^,__*,_*@_,@*__**^,__*@*^,_*^,@_@*^,@_*,@*@_,@*__*_*^;_@*_*^,*@*_@,@*_*^,@_@*__*^,@*@_*,@_@*,__@@*@*^,@@*@*^;_*^,*_*^,*@*@@,_@_*^,__**__*^,*@@@*,@@_*^,__@*,*@*,***^",),
"破阵子":("双调133字仄韵:*_**,_*_*,_*_*^,@*@_@*,@*@__**^,_*__,__**,__**^,*__,**__*,**__*,__**^,_*__,*_**,__**^;_*^,**__,__**,_**,__*^,@*@__**,@*@_@*^,*__,__*,__**^,@*@_@*,**__,__**,**_*^,*__***,*_**^",),
"瑞龙吟":("三叠133字仄韵:__*^,_***__,*__*^,**_*__,*_**,__**^;*_*^,_**__*,*__*^,__*___,*__*,__**^;_*___*,*__*,___*,_**___,_*_*^,__**,_**_*^,__*,__**,___*^,**__*^,*_**,___*^,_*__*^,__*,_*___*^,*_**,*__*^",),
"大酺": ("双调134字仄韵:**__,__*,_*___*^,___*_,*___*,*__*^,*___,_***,_*___*^,____*,____*,*__*^,*___*,*__*,*__*^;___**^,*_*,____*^,***,___*,*___,*__,*__*^,**__*,_**,___*^,*_*,_**^,___**,_*___*^,*_*__*^",),
"西平乐":("双调136字变韵:**__,*__*,_*____^,_*_*,*__*,__**__^,***__**,_*_***,__**,_*_*,**__^,*__**,_**,***__^;*__*,__**,_*__,*_**^,_**,__**,**__^,**__**,**__,_*__**_^,_**_,__**,_*__,**__,**__,_***__^",),
"夜半乐":("三叠137字仄韵:*_**_*,__**,_*__*^,*@*__,@__*^,*_@*,__@*,*_@*__,*__*^,*@*,__*_*^,*_@***,**__,*__*^;_**,@*___*^,*_@*,__@*,*_@*__,*__*^,*@*,__*_*^,**_*,**__,*__*^;*@*,__*_*^,*__,_***@_*^,_**,**__*^",),
"多丽": ("双调139字平韵:*__^,*_@*__^,*__,@_@*,@_@*__^,*__,@_@*,@@*,@*__^,@*__,@_@*,@_@**__^,*@*,@_@*@**__^,__*,@_@*,@*__^;*__,@_@*,@_@*__^,*__,@_@*,@@*,@*__^,@*__,@_@*,@_@**__^,*@*,@_@*,@**__^,__*,@_@*,@*__^",),
"六丑": ("双调140字仄韵:*__**,***,___*^,*_*_,___**^,**_*^,**__*,*__*,**__*^,__**__*^,**__,__**^,__*__*^,*__**,_*_*^;___*^,*__**^,**__*,_**^,__**_*^,*__**,*__*^,__*,*__*^,_**,**__**,*__*^,__*,**_*^,**_,**__*,__**^",),
"六州歌头":("双调143字平韵:__@*,@**__^,_@*,__*,*__^,*__^,@*@_*,@_*,_@*,@@*,_@*,*__^,@*@_,@*__*,@*__^,*@_@*,@**__^,@*__^,*__^;*__*,@_*,_@*,*__^,@@*,_@*,*__^,*__^,@*__*,@@*,*__^,_@*,_@*,*__^,@*@_@*,@_*,@*__^,*@_@*,@**__^,@*__^",),
"戚氏": ("三叠212字变韵:*__^,_*_**__^,____,**_*^,*__^,__^,*__^,__**___^,__**_*^,**_**__^,**__,___*,*_**__^,*__**,_*_*,_*__^;_*^,**__^,__**^,__*__^,__*,___*,**__^,___^,*_***_^,_***__^,*_**,**__,**_*__^;**___,__**,**__^,**__**,*__***__^,__**__,*_**,_*__*^,**__*__*^,_**,_*__^,**_,**__^,*__***__^,*__*,__**,**__^",),
"莺啼序":("四重240字仄韵:__*_**,*__@*^,@@*,@*__,*@@*_*^,@@*,__**,__**__*^,*@_@*,@_@@_*^;@*__,@@@*,*__@*^,@@*,@*__,@_**@*^,*__,@_**,@@*,@__*^,*@_,@*@_,@__*^;@_@*,@*@_,@@@@*^,@**,@@@*,@*@@,**__,*@@*^,@_@*,__@*,@_@*__*,*__,@*@_*^,__**,@@@*__,@@@@_*^;@_@*,@*__,**_@*^,*@*,@*@*^,**__,@*_@,@@@*^,__**,___*,@_@*@@_,*__,@*__*^,@_@*__,@*__,*_@*^",)                        
}